[
  {
    "id": "theory-ep380-001",
    "title": "Bink's Sake Contains Clues to the One Piece Treasure",
    "summary": "The lyrics of Bink's Sake contain hidden meanings and foreshadowing about the One Piece treasure and the series' ending, particularly the phrase 'funny tale' which connects to Laugh Tale.",
    "fullText": "Many fans theorize that Bink's Sake is more than just a pirate song - it may actually contain encoded information about the One Piece treasure itself. The song's final line contains the phrase 'waraibanashi' (literally 'laugh tale'), which is the same phrase Roger quoted when naming the final island Laugh Tale. The song has been passed down through generations of pirates, suggesting it may tell the story of the Void Century and Joy Boy's adventures. The connection between the popular shanty and the drums of liberation might explain why the song is so well known despite many not knowing the truth behind it.",
    "author": "Multiple theorists including Artur (Library of Ohara)",
    "source": {
      "url": "https://www.cbr.com/one-piece-theory-bink-sake-foreshadows-ending/",
      "title": "One Piece Theory: Bink's Sake Is the Key to the One Piece",
      "platform": "CBR",
      "accessedAt": "2025-12-02"
    },
    "postedDate": null,
    "episodeRange": [62, 1100],
    "minEpisode": 62,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["brook", "roger", "joy-boy"],
    "relatedLocations": ["laugh-tale"],
    "relatedEvents": ["ep380-event-007"],
    "tags": ["binks-sake", "one-piece-treasure", "laugh-tale", "joy-boy", "void-century"]
  },
  {
    "id": "theory-ep380-002",
    "title": "Bink's Sake Tells the Story of Joy Boy and the Void Century",
    "summary": "The song Bink's Sake may actually be a historical account of Joy Boy's adventures during the Void Century, disguised as a simple pirate shanty and passed down through generations.",
    "fullText": "Some fans theorize that Bink's Sake isn't just a fun pirate song, but rather an encoded history of the Void Century and Joy Boy's journey. The song describes a pirate's adventures across the seas with themes of freedom, friendship, and never-ending journeys - all themes associated with Joy Boy and the D. clan. The fact that the song has survived for centuries and is known by pirates worldwide suggests it may have been intentionally preserved as a way to pass down forbidden history. The Rumbar Pirates unknowingly sang a song that contains the world's greatest secrets.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://gamerant.com/one-piece-legendary-pirate-binks-sake-joy-boy-nika/",
      "title": "One Piece: The Legendary Pirate Binks, Explained",
      "platform": "Game Rant",
      "accessedAt": "2025-12-02"
    },
    "postedDate": null,
    "episodeRange": [62, 1100],
    "minEpisode": 62,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["brook", "joy-boy", "roger"],
    "relatedLocations": [],
    "relatedEvents": ["ep380-event-007"],
    "tags": ["binks-sake", "joy-boy", "void-century", "ancient-history", "d-clan"]
  },
  {
    "id": "theory-ep380-003",
    "title": "Yorki May Still Be Alive",
    "summary": "Despite leaving the crew while infected with a deadly disease, some fans theorize that Captain Yorki may have survived and could reappear later in the story.",
    "fullText": "Captain Yorki's fate was never explicitly confirmed in Episode 380. He left with the infected crew members to attempt crossing the Calm Belt back to West Blue, but we never see his death. Some fans believe that Yorki may have found a cure or survived the disease, and could potentially reappear in the story. This would create an emotional reunion with Brook and provide closure to the Rumbar Pirates' story. However, this theory is largely based on the fact that his death wasn't shown on-screen, which could simply be because it wasn't narratively necessary.",
    "author": "Various fan theorists",
    "source": {
      "url": "https://www.tumblr.com/badass-op-theories-blog/124529035973/captain-yorki-of-the-rumbar-pirates-alive",
      "title": "Captain Yorki of the Rumbar Pirates: Alive???",
      "platform": "Tumblr",
      "accessedAt": "2025-12-02"
    },
    "postedDate": null,
    "episodeRange": [380, 1100],
    "minEpisode": 380,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 380
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNLIKELY",
    "relatedCharacters": ["yorki", "brook"],
    "relatedLocations": [],
    "relatedEvents": ["ep380-event-003"],
    "tags": ["yorki", "rumbar-pirates", "survival", "reunion"]
  }
]
