[
  {
    "id": "theory-ep514-001",
    "title": "Sanji's Training Foreshadows His Raid Suit Abilities",
    "summary": "Fans theorized that Sanji's training with the okama and learning to evade them constantly would lead to him developing advanced speed and aerial combat abilities, which proved prescient when he later gained Sky Walk.",
    "fullText": "During the timeskip training setup in Episode 514, viewers noticed that Sanji's challenge - to defeat 99 masters while constantly evading capture by the entire island of okama - seemed designed to force him to develop extreme speed and mobility. Fans theorized this would result in new movement techniques, and they were proven correct when Sanji revealed Sky Walk and later his enhanced speed abilities. The constant evasion training perfectly set up his ability to run on air and move with incredible agility.",
    "author": "One Piece Community Discussion",
    "source": {
      "url": "https://www.sportskeeda.com/anime/one-piece-each-straw-hat-timeskip-training-explained",
      "title": "One Piece: Each Straw Hat timeskip training, explained",
      "platform": "Sportskeeda",
      "accessedAt": "2025-12-16"
    },
    "postedDate": null,
    "episodeRange": [514, 517],
    "minEpisode": 514,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 600
    },
    "popularity": {},
    "status": "CONFIRMED",
    "relatedCharacters": ["sanji"],
    "relatedLocations": ["momoiro-island"],
    "relatedEvents": ["ep514-event-007", "ep514-event-008"],
    "tags": ["sanji", "training", "timeskip", "abilities", "sky-walk"]
  },
  {
    "id": "theory-ep514-002",
    "title": "Attack Cuisine as Power-Up System",
    "summary": "When Attack Cuisine was introduced, fans theorized it would become a unique power-up mechanic where Sanji could temporarily boost his crewmates' strength through special meals, similar to how Chopper uses Rumble Balls.",
    "fullText": "The introduction of Attack Cuisine in Episode 514 led fans to speculate about its future use. Since it's explicitly stated to 'make peoples' bodies stronger and hearts purer,' many theorized that Sanji would use these recipes to provide temporary power boosts to the Straw Hats before major battles, creating a unique support role for the cook beyond just providing sustenance. While Sanji did learn all 99 recipes, the series hasn't explicitly shown him using them to boost allies' combat power in the dramatic way some fans predicted, though his improved cooking does contribute to the crew's overall strength and recovery.",
    "author": "Fan Theory Discussions",
    "source": {
      "url": "https://gamerant.com/one-piece-things-sanji-learned-during-timeskip/",
      "title": "One Piece: 8 Things Sanji Learned During The Timeskip",
      "platform": "Game Rant",
      "accessedAt": "2025-12-16"
    },
    "postedDate": null,
    "episodeRange": [514, 900],
    "minEpisode": 514,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 700
    },
    "popularity": {},
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["sanji"],
    "relatedLocations": ["momoiro-island"],
    "relatedEvents": ["ep514-event-006"],
    "tags": ["sanji", "attack-cuisine", "power-system", "cooking"]
  },
  {
    "id": "theory-ep514-003",
    "title": "Franky's Vegapunk Research Leads to Pacifista-Level Technology",
    "summary": "Upon seeing Franky discover Vegapunk's blueprints in Episode 514, fans immediately theorized he would incorporate Pacifista-style laser technology into his own body, which was confirmed when he returned with the Radical Beam ability.",
    "fullText": "When Franky discovered Vegapunk's hidden laboratory containing weapons research and Devil Fruit studies, fans quickly connected the dots. They theorized that since Vegapunk created the Pacifistas with their laser beams (based on Kizaru's abilities), Franky would study this technology and incorporate similar weapons into his post-timeskip upgrades. This theory was spectacularly confirmed when Franky returned with the Radical Beam and other laser-based attacks, directly inspired by Vegapunk's Pacifista research.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://gamerant.com/one-piece-what-vegapunks-introduction-could-mean-for-franky/",
      "title": "One Piece: What Vegapunk's Introduction Could Mean for Franky",
      "platform": "Game Rant",
      "accessedAt": "2025-12-16"
    },
    "postedDate": null,
    "episodeRange": [514, 600],
    "minEpisode": 514,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 600
    },
    "popularity": {},
    "status": "CONFIRMED",
    "relatedCharacters": ["franky", "vegapunk"],
    "relatedLocations": ["karakuri-island"],
    "relatedEvents": ["ep514-event-004", "ep514-event-005"],
    "tags": ["franky", "vegapunk", "technology", "pacifista", "timeskip"]
  },
  {
    "id": "theory-ep514-004",
    "title": "Timeskip Training Mirrors Original Character Development",
    "summary": "Fans noticed that each Straw Hat's timeskip training location in Episode 514 and surrounding episodes perfectly mirrors their character arc - Sanji in a 'hell' for a ladies' man, Nami with weather scientists, Franky with advanced technology.",
    "fullText": "When the timeskip training locations were revealed, fans appreciated how perfectly each one matched both the character's abilities and personality. Sanji, the ultimate ladies' man, being forced to survive on an island full of okama trying to convert him represents his personal hell while teaching him humility and new techniques. Nami being with weather scientists advances her navigation skills. Franky with Vegapunk's technology builds on his role as shipwright. This thematic consistency led fans to theorize that Oda carefully designed each training location to challenge the characters in ways that would force maximum growth, which proved true as each emerged with abilities that directly addressed their previous limitations.",
    "author": "One Piece Analysis Community",
    "source": {
      "url": "https://hoganreviews.co.uk/2024/03/05/one-piece-post-war-arc-episodes-493-516-review/",
      "title": "One Piece – Post War Arc (Episodes 493 – 516) Review",
      "platform": "Hogan Reviews",
      "accessedAt": "2025-12-16"
    },
    "postedDate": "2024-03-05",
    "episodeRange": [514, 517],
    "minEpisode": 514,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 517
    },
    "popularity": {},
    "status": "CONFIRMED",
    "relatedCharacters": ["sanji", "nami", "franky", "luffy", "zoro"],
    "relatedLocations": ["momoiro-island", "weatheria", "karakuri-island"],
    "relatedEvents": ["ep514-event-003", "ep514-event-005", "ep514-event-008"],
    "tags": ["timeskip", "character-development", "thematic-analysis", "training"]
  }
]
