[
  {
    "id": "thriller-bark",
    "episodeAppearances": [369],
    "keyEvents": [
      {
        "episodeNumber": 369,
        "description": "Luffy chases Moria's shadow through Thriller Bark while the crew battles Oars on the main deck.",
        "significance": "The main battleground for this episode's events",
        "timestamp": "03:30"
      },
      {
        "episodeNumber": 369,
        "description": "Bartholomew Kuma arrives at Thriller Bark to meet with Gecko Moria.",
        "significance": "Kuma's first on-screen appearance at this location",
        "timestamp": "09:15"
      },
      {
        "episodeNumber": 369,
        "description": "The crew discovers that Thriller Bark is drifting out of the Florian Triangle's protective fog due to rudder damage.",
        "significance": "Creates urgent time pressure as shadowless crew members will die at sunrise",
        "timestamp": "16:00"
      },
      {
        "episodeNumber": 369,
        "description": "Moria enters the cockpit inside Oars' stomach, taking direct control of the giant zombie.",
        "significance": "Transforms Thriller Bark into the battleground for the arc's climactic confrontation",
        "timestamp": "19:00"
      }
    ]
  },
  {
    "id": "florian-triangle",
    "episodeAppearances": [369],
    "keyEvents": [
      {
        "episodeNumber": 369,
        "description": "Thriller Bark begins drifting out of the Florian Triangle's protective fog, exposing the ship to potential sunlight.",
        "significance": "The loss of fog protection creates a time limit for the shadowless crew members",
        "timestamp": "16:00"
      }
    ]
  },
  {
    "id": "oars-cockpit",
    "names": {
      "english": "Oars' Cockpit",
      "japanese": "オーズのコックピット",
      "romanized": "Ōzu no Kokkupitto"
    },
    "type": "Interior Structure",
    "debut": {
      "episode": 369,
      "chapter": 474
    },
    "description": "A specially designed cockpit installed inside Oars' stomach by Gecko Moria and Hogback during the restoration of Oars' corpse. It allows Moria to observe and control the giant zombie from within.",
    "episodeAppearances": [369],
    "keyEvents": [
      {
        "episodeNumber": 369,
        "description": "Gecko Moria enters the cockpit inside Oars' stomach, revealing his ultimate strategy to the Straw Hats.",
        "significance": "First appearance of this unique location; creates the 'combination of brains and brawn' that defines the arc's final battle",
        "timestamp": "19:00"
      }
    ],
    "parentLocation": "oars-body"
  }
]
