[
  {
    "id": "theory-ep529-001",
    "title": "Luffy Will Destroy Fish-Man Island to Free the Fishmen",
    "summary": "The prophecy will come true, but the destruction will be beneficial. Luffy will destroy Fish-Man Island to fulfill Joy Boy's promise, allowing fishmen and merfolk to migrate to the surface and live under the real sun.",
    "fullText": "Many fans theorize that Shyarly's prophecy about Luffy destroying Fish-Man Island will indeed come true, but not in a villainous way. The theory suggests that when Luffy defeats the World Government and potentially destroys the Red Line (which Fish-Man Island sits beneath), the island will be destroyed as a consequence. However, this destruction will fulfill Joy Boy's ancient promise to relocate the fishmen and merfolk to the surface world, where they can live freely under the real sun without fear of discrimination. This would align with the recurring theme in One Piece that prophecies can be both true and beneficial, and that destruction can lead to rebirth and freedom.",
    "author": "Multiple One Piece theorists",
    "source": {
      "url": "https://www.cbr.com/one-piece-theory-luffy-destroys-fish-man-island-fishmen-live-on-surface/",
      "title": "One Piece Theory: Luffy Will Destroy Fish-Man Island Himself - For the Better",
      "platform": "CBR",
      "accessedAt": "2025-12-19"
    },
    "postedDate": "2024-03-15",
    "episodeRange": [529, 1100],
    "minEpisode": 529,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["luffy", "shyarly", "joy-boy"],
    "relatedLocations": ["fish-man-island"],
    "relatedEvents": ["ep529-event-012"],
    "tags": ["prophecy", "joy-boy", "red-line", "fishmen-migration", "endgame"]
  },
  {
    "id": "theory-ep529-002",
    "title": "Red Line Destruction Will Collapse Fish-Man Island",
    "summary": "Luffy will destroy the Red Line when defeating the World Government, causing Fish-Man Island (located 10,000 meters below the Red Line) to collapse. This will create the All Blue and allow fishmen to surface.",
    "fullText": "This theory posits that Luffy's ultimate confrontation with the World Government will involve destroying Marie Jois and the Red Line itself. Since Fish-Man Island is located 10,000 meters below the Red Line at the ocean floor, the collapse of the Red Line would inevitably destroy the island. However, this catastrophic event would have positive outcomes: it would create the All Blue (fulfilling Sanji's dream) by connecting all the seas, and it would force the fishmen and merfolk to migrate to the surface world, finally achieving their long-held dream of living under the sun. Shyarly's prophecy is accurate but lacks the context that this destruction is necessary for a greater good.",
    "author": "One Piece community consensus",
    "source": {
      "url": "https://gamerant.com/one-piece-luffy-will-destroy-fishman-island-explained/",
      "title": "One Piece: How Luffy Will Destroy Fishman Island, Explained",
      "platform": "Game Rant",
      "accessedAt": "2025-12-19"
    },
    "postedDate": "2024-06-20",
    "episodeRange": [529, 1100],
    "minEpisode": 529,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["luffy", "shyarly", "sanji"],
    "relatedLocations": ["fish-man-island", "red-line", "marie-jois"],
    "relatedEvents": ["ep529-event-012"],
    "tags": ["prophecy", "red-line", "all-blue", "endgame", "world-government"]
  },
  {
    "id": "theory-ep529-003",
    "title": "Seraphim Luffy Will Destroy Fish-Man Island",
    "summary": "The prophecy shows a figure in flames, suggesting it might not be Luffy himself but a Seraphim clone of Luffy (who possess Lunarian fire abilities) that destroys Fish-Man Island.",
    "fullText": "A more recent theory suggests that Shyarly's vision might have been misinterpreted. The vision shows flames, which could indicate that the destroyer is not actually Luffy but rather a Seraphim version of him. Seraphim are powerful clones created by Dr. Vegapunk that possess Lunarian abilities, including fire powers. Since Shyarly saw someone in a straw hat surrounded by flames, it could be a Seraphim clone of Luffy (S-Luffy) rather than Luffy himself. This would technically fulfill the prophecy (destruction by someone with Luffy's appearance and a straw hat) while allowing the real Luffy to remain heroic. The theory gained traction after the introduction of Seraphim in the manga.",
    "author": "CBR and One Piece theorists",
    "source": {
      "url": "https://www.cbr.com/one-piece-theory-fishman-island-seraphim-luffy-destroy/",
      "title": "One Piece Theory: Fishman Island Will Be Destroyed By a Seraphim Luffy",
      "platform": "CBR",
      "accessedAt": "2025-12-19"
    },
    "postedDate": "2024-08-10",
    "episodeRange": [529, 1100],
    "minEpisode": 529,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["luffy", "shyarly", "vegapunk"],
    "relatedLocations": ["fish-man-island"],
    "relatedEvents": ["ep529-event-012"],
    "tags": ["prophecy", "seraphim", "lunarian", "vegapunk", "clones"]
  },
  {
    "id": "theory-ep529-004",
    "title": "Luffy vs. Blackbeard Battle Will Destroy Fish-Man Island",
    "summary": "The prophesied destruction will occur during Luffy's final battle with Blackbeard, with Luffy's Gear 5 powers accidentally demolishing Fish-Man Island as collateral damage.",
    "fullText": "This theory suggests that Luffy won't intentionally destroy Fish-Man Island, but will do so as collateral damage during his climactic battle with Blackbeard. The theory notes that Luffy's Gear 5 transformation has shown incredible destructive potential, and a battle between two Yonko-level fighters could easily devastate an entire island. Blackbeard might attack Fish-Man Island for strategic reasons (such as acquiring ancient weapons or Poneglyphs), forcing Luffy to fight there. The prophecy would be fulfilled not through malice but through the unavoidable collateral damage of an epic battle. This would maintain Luffy's heroic nature while still validating Shyarly's accurate vision.",
    "author": "One Piece fan community",
    "source": {
      "url": "https://gamerant.com/one-piece-luffy-destroy-world-explained/",
      "title": "One Piece: Why Luffy Will Destroy The World, Explained",
      "platform": "Game Rant",
      "accessedAt": "2025-12-19"
    },
    "postedDate": "2024-05-05",
    "episodeRange": [529, 1100],
    "minEpisode": 529,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["luffy", "blackbeard", "shyarly"],
    "relatedLocations": ["fish-man-island"],
    "relatedEvents": ["ep529-event-012"],
    "tags": ["prophecy", "blackbeard", "gear-5", "final-battle", "collateral-damage"]
  }
]
