[
  {
    "name": {
      "english": "Gum-Gum Fruit",
      "japanese": "ゴムゴムの実",
      "romanized": "Gomu Gomu no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 1,
    "debutChapter": 1,
    "description": "Grants the user's body the properties of rubber, allowing them to stretch and become immune to blunt attacks and electricity.",
    "episodeAppearances": [617],
    "users": [
      {
        "characterId": "luffy",
        "episodeStart": 1,
        "episodeEnd": "present",
        "circumstances": "Luffy accidentally ate the fruit as a child"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Gomu Gomu no Grizzly Magnum",
        "episodeRevealed": 617,
        "description": "Luffy activates Gear 3 on both arms simultaneously, infuses them with Armament Haki, and delivers a devastating double-armed attack. He stretches both arms back while running, then launches forward with tremendous power.",
        "severity": "MAJOR",
        "firstUseContext": "Luffy uses this powerful new technique to defeat Caesar Clown, combining the size advantage of Gear 3 with the enhanced power and durability of Armament Haki."
      }
    ],
    "weaknesses": [],
    "strengths": [],
    "awakening": null,
    "rarity": "COMMON",
    "powerTier": "HIGH"
  },
  {
    "name": {
      "english": "Op-Op Fruit",
      "japanese": "オペオペの実",
      "romanized": "Ope Ope no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 392,
    "debutChapter": 504,
    "description": "Allows the user to create a spherical domain called a Room, inside which they can manipulate anything, performing 'surgical' operations on people and objects.",
    "episodeAppearances": [617],
    "users": [
      {
        "characterId": "trafalgar-law",
        "episodeStart": 392,
        "episodeEnd": "present",
        "circumstances": "Law ate the fruit as a child after Corazon gave it to him to cure his Amber Lead Syndrome"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Mountain-Scale Room",
        "episodeRevealed": 617,
        "description": "Law creates a massive Room that encompasses the entire Punk Hazard laboratory facility and surrounding mountains. He then performs a slash that cuts everything within the Room in half, including buildings and landscape.",
        "severity": "MAJOR",
        "firstUseContext": "Used to defeat Vergo and destroy the SAD production facility. The attack literally bisects Punk Hazard's mountains and research complex, demonstrating the incredible range and power Law has achieved with his Devil Fruit abilities."
      }
    ],
    "weaknesses": [],
    "strengths": [
      {
        "strength": "Can affect massive areas with Room",
        "episodeRevealed": 617,
        "description": "Law demonstrates the ability to create a Room large enough to encompass mountains and entire facility complexes.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "VERY_HIGH"
  },
  {
    "name": {
      "english": "Gas-Gas Fruit",
      "japanese": "ガスガスの実",
      "romanized": "Gasu Gasu no Mi"
    },
    "type": "LOGIA",
    "debutEpisode": 581,
    "debutChapter": 658,
    "description": "Allows the user to create, control, and transform into various types of gas, including poisonous ones.",
    "episodeAppearances": [617],
    "users": [
      {
        "characterId": "caesar-clown",
        "episodeStart": 581,
        "episodeEnd": "present",
        "circumstances": "Caesar ate the fruit at some point before the timeskip"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Shinokuni Merger",
        "episodeRevealed": 617,
        "description": "Caesar absorbs and merges with massive quantities of the deadly Shinokuni poison gas, transforming his entire body into a huge toxic gas monster. This allows him to increase his size dramatically and wield the poisonous properties of Shinokuni as a weapon.",
        "severity": "MAJOR",
        "firstUseContext": "Used as a desperate measure against Luffy after realizing his operation was collapsing. Caesar demonstrates the ability to fully merge with external gases and control them as extensions of his body."
      }
    ],
    "weaknesses": [],
    "strengths": [
      {
        "strength": "Can merge with and control external gases",
        "episodeRevealed": 617,
        "description": "Caesar can absorb and merge with gases that he didn't create himself, controlling them and incorporating them into his body.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "HIGH"
  }
]
