[
  {
    "id": "hana-hana-no-mi",
    "name": {
      "english": "Flower-Flower Fruit",
      "japanese": "ハナハナの実",
      "romanized": "Hana Hana no Mi"
    },
    "type": "Paramecia",
    "debutEpisode": 67,
    "debutChapter": 114,
    "episodeAppearances": [549],
    "currentUser": "robin",
    "previousUsers": [],
    "abilities": [
      {
        "abilityName": "Cuerpo Fleur",
        "description": "Creates a complete duplicate of the user's entire body in another location. The clone can act independently while the real body remains safe elsewhere.",
        "episodeFirstUsed": 549,
        "firstUsedAgainst": null,
        "limitations": "The clone appears to share damage or effects with the original body based on manga precedent."
      }
    ],
    "awakening": null,
    "weaknesses": ["Standard Devil Fruit weaknesses: seawater, Sea-Prism Stone, Haki"],
    "keyMoments": [
      {
        "episodeNumber": 549,
        "eventId": "ep549-event-003",
        "description": "Robin debuts her Cuerpo Fleur technique, creating a full-body clone to stop Luffy and Jinbe's fight.",
        "significance": "First demonstration of Robin's enhanced post-timeskip Devil Fruit mastery."
      }
    ],
    "trivia": []
  },
  {
    "id": "yomi-yomi-no-mi",
    "name": {
      "english": "Revive-Revive Fruit",
      "japanese": "ヨミヨミの実",
      "romanized": "Yomi Yomi no Mi"
    },
    "type": "Paramecia",
    "debutEpisode": 337,
    "debutChapter": 442,
    "episodeAppearances": [549],
    "currentUser": "brook",
    "previousUsers": [],
    "abilities": [
      {
        "abilityName": "Soul Separation",
        "description": "Allows the user to separate their soul from their body, manifesting as a spectral form engulfed in spiritual flames. While in this state, the physical body cannot move and must be protected.",
        "episodeFirstUsed": 549,
        "firstUsedAgainst": null,
        "limitations": "Cannot move or use the physical body while the soul is separated. The body is vulnerable to attack during separation."
      }
    ],
    "awakening": null,
    "weaknesses": ["Standard Devil Fruit weaknesses", "Physical body is defenseless during soul separation"],
    "keyMoments": [
      {
        "episodeNumber": 549,
        "eventId": "ep549-event-004",
        "description": "Brook reveals his ability to separate his soul from his skeleton body, demonstrating the true potential of the Yomi Yomi no Mi beyond just resurrection.",
        "significance": "Establishes Brook's soul manipulation abilities that expand the fruit's utility beyond its initial one-time resurrection power."
      }
    ],
    "trivia": [
      {
        "fact": "Brook discovered this ability while praying during a slump in his musical career during the two-year timeskip.",
        "sources": []
      },
      {
        "fact": "Brook's soul appears as green spiritual flames in both the manga (Volume 64 cover) and anime, establishing visual consistency.",
        "sources": []
      }
    ]
  }
]
