[
  {
    "name": {
      "english": "Slow-Slow Fruit",
      "japanese": "ノロノロの実",
      "romanized": "Noro Noro no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 210,
    "debutChapter": 308,
    "episodeAppearances": [210],
    "currentUser": {
      "characterId": "foxy",
      "episodeObtained": null,
      "episodeLost": null,
      "status": "ACTIVE"
    },
    "previousUsers": [],
    "abilities": [
      {
        "abilityName": "Noro Noro Beam",
        "description": "Fires purple beams of Noroma Photons that slow down anything they hit for exactly thirty seconds.",
        "episodeFirstUsed": 210,
        "limitations": "Can be reflected by mirrors or reflective surfaces. The user is not immune to their own beams.",
        "strength": "Can slow down objects, people, and even portions of space, making it extremely versatile for combat and manipulation."
      },
      {
        "abilityName": "Kyubi Rush",
        "description": "After slowing an opponent, the user delivers rapid punches that accumulate and strike all at once when the thirty seconds expire.",
        "episodeFirstUsed": null,
        "limitations": "Requires the target to be slowed first.",
        "strength": "Allows weak punches to accumulate into a devastating attack."
      }
    ],
    "awakening": {
      "isAwakened": false,
      "awakeningEpisode": null,
      "awakeningAbilities": []
    },
    "weaknesses": [
      "Beams can be reflected by mirrors or reflective surfaces",
      "User is not immune to their own Noroma Photons",
      "In the anime, beams only affect objects roughly their size"
    ],
    "keyMoments": [
      {
        "episodeNumber": 210,
        "eventId": "ep210-event-002",
        "momentType": "POWER_REVEAL",
        "title": "First Appearance of Noro Noro no Mi",
        "description": "Foxy uses the Noro Noro no Mi for the first time in the anime, firing beams that slow down the Straw Hats' boat.",
        "significance": "Introduction of one of the most unique Paramecia-type Devil Fruits with time manipulation properties.",
        "timestamp": "10:30"
      },
      {
        "episodeNumber": 210,
        "eventId": "ep210-event-003",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "Noro Noro Beam Debut",
        "description": "The signature technique of the Noro Noro no Mi is demonstrated, showing its ability to slow targets for thirty seconds.",
        "significance": "Establishes the primary combat application of the fruit.",
        "timestamp": "12:00"
      }
    ],
    "trivia": [
      "The Noro Noro no Mi is considered one of the most versatile Devil Fruits due to its time manipulation properties",
      "Despite its powerful abilities, Foxy's poor combat skills and the fruit's exploitable weaknesses limit its effectiveness",
      "The name 'Noro Noro' is Japanese onomatopoeia for sluggishness or slowness"
    ]
  }
]
