[
  {
    "id": "baratie",
    "name": "Baratie",
    "nameJapanese": "海上レストラン バラティエ",
    "nameRomanized": "Kaijō Resutoran Baratie",
    "aliases": ["Floating Restaurant Baratie", "Sea Restaurant Baratie"],
    "type": "RESTAURANT",
    "debut": {
      "episode": 20,
      "chapter": 42
    },
    "episodeAppearances": [20],
    "keyEvents": [
      {
        "episode": 20,
        "timestamp": "09:20",
        "description": "The Straw Hat crew arrives at the Baratie, a famous floating restaurant shaped like a fish.",
        "significance": "First appearance of the Baratie, which becomes the primary setting for the arc"
      },
      {
        "episode": 20,
        "timestamp": "17:00",
        "description": "The Baratie's roof is damaged when Luffy deflects a cannonball from Fullbody's Marines.",
        "significance": "The damage leads to Luffy working as a chore boy and sets up the arc's events"
      },
      {
        "episode": 20,
        "timestamp": "21:50",
        "description": "Sanji defeats Marine Lieutenant Fullbody inside the Baratie after he wastes food.",
        "significance": "Establishes the Baratie's policy and Sanji's fighting abilities"
      }
    ],
    "description": "The Baratie is a famous floating restaurant in the East Blue shaped like a fish. It serves all customers regardless of their allegiance - pirates, Marines, and civilians alike. The restaurant is owned and operated by the former pirate 'Red-Leg' Zeff and his crew of cooks.",
    "geography": "Located in the East Blue, the Baratie is a ship-restaurant that floats on the ocean and can move to different locations.",
    "culture": "The Baratie has a strict policy of serving anyone who is hungry, regardless of whether they can pay. However, customers who damage the restaurant or waste food face severe consequences. The restaurant is staffed by skilled cooks who are also capable fighters.",
    "significance": "The Baratie is where Luffy meets and eventually recruits Sanji as the crew's cook. It represents Zeff's dream of creating a place where no one would go hungry at sea.",
    "currentStatus": "ACTIVE",
    "inhabitants": [
      {
        "characterId": "zeff",
        "role": "Owner and Head Chef"
      },
      {
        "characterId": "sanji",
        "role": "Sous Chef"
      }
    ]
  }
]
