[
  {
    "id": "puffing-tom",
    "name": {
      "english": "Puffing Tom",
      "japanese": "パッフィング・トム",
      "romanized": "Paffingu Tomu"
    },
    "type": "SEA_TRAIN",
    "debut": {
      "episode": 229,
      "chapter": 352
    },
    "episodeAppearances": [257],
    "description": "The Puffing Tom is one of the Sea Trains designed by Tom, connecting Water 7 to Enies Lobby. In this episode, it is being used by CP9 to transport Nico Robin to Enies Lobby, while Sanji, Franky, and Usopp (as Sogeking) infiltrate it to rescue her.",
    "keyEvents": [
      {
        "episodeNumber": 257,
        "title": "Sogeking Debuts on Puffing Tom",
        "description": "Sogeking makes his dramatic first appearance on top of the Puffing Tom, shooting a Marine to save Sanji and Franky from being spotted.",
        "timestamp": "19:05"
      },
      {
        "episodeNumber": 257,
        "title": "Wanze Guards Kitchen Car",
        "description": "Wanze appears in the kitchen car of the Puffing Tom, confronting the infiltrators with his Ramen Kenpo.",
        "timestamp": "05:20"
      },
      {
        "episodeNumber": 257,
        "title": "T Bone Shows Compassion",
        "description": "T Bone bandages an injured Marine's wound on the Puffing Tom, demonstrating his honorable nature.",
        "timestamp": "03:45"
      }
    ],
    "significance": "The Puffing Tom serves as the mobile battlefield for the rescue mission, with multiple confrontations happening aboard as the Straw Hats attempt to reach Robin before she arrives at Enies Lobby."
  },
  {
    "id": "water-7",
    "name": {
      "english": "Water 7",
      "japanese": "ウォーターセブン",
      "romanized": "Wōtā Sebun"
    },
    "type": "ISLAND_CITY",
    "episodeAppearances": [257],
    "description": "Water 7 is a city built on water, known for its shipbuilding industry and canals. In this episode, it is being struck by the annual Aqua Laguna tidal wave.",
    "keyEvents": [
      {
        "episodeNumber": 257,
        "title": "Luffy and Zoro Break Through Aqua Laguna",
        "description": "Luffy and Zoro use their combination attack Gomu Gomu no Sanbyaku Pound Cannon to blast a hole through the massive Aqua Laguna tidal wave, allowing the Rocketman to pass through safely.",
        "timestamp": "12:07"
      },
      {
        "episodeNumber": 257,
        "title": "Franky Family Attempts to Stop Aqua Laguna",
        "description": "The Franky Family fires their cannons at the Aqua Laguna in an attempt to break through, but their weapons prove ineffective against the massive wave.",
        "timestamp": "09:30"
      }
    ],
    "significance": "Water 7 and the Aqua Laguna serve as both the starting point for the rescue mission and a massive natural obstacle that demonstrates the crew's determination and power."
  }
]
