[
  {
    "id": "theory-ep390-001",
    "title": "The World Nobles' Space Suits Hide a Dark Secret",
    "summary": "Fan theory that the Celestial Dragons wear space suits not out of arrogance, but because they physically cannot breathe the same air as common people due to genetic modification or ancient technology.",
    "fullText": "Many fans have theorized that the World Nobles' distinctive space suits and refusal to breathe the same air as commoners may be more than just arrogance. Some believe the Celestial Dragons have been genetically modified or altered through ancient technology, making them unable to survive without their protective suits. This would explain why they always wear them, even in Sabaody which is very close to Mary Geoise. The theory suggests this modification might be related to the Void Century or the original twenty kingdoms that formed the World Government.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/World_Noble",
      "title": "World Noble - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-04"
    },
    "postedDate": "2024-01-01",
    "episodeRange": [390, 1000],
    "minEpisode": 390,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1000
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": [],
    "relatedLocations": ["sabaody-archipelago"],
    "relatedEvents": ["ep390-event-007"],
    "tags": ["world-nobles", "celestial-dragons", "void-century", "ancient-technology"]
  },
  {
    "id": "theory-ep390-002",
    "title": "Sabaody's Strategic Importance to the World Government",
    "summary": "Theory that Sabaody Archipelago's proximity to Mary Geoise is intentional, serving as a testing ground and showcase of the World Government's power to pirates about to enter the New World.",
    "fullText": "Fans theorize that Sabaody Archipelago's location near the Red Line and Mary Geoise is strategically chosen by the World Government. The island serves as the final checkpoint before the New World, where the World Nobles can demonstrate their absolute power and the futility of opposing the World Government. The slave auctions, the presence of Marines, and the World Nobles' visits all serve to intimidate pirates and remind them of the hierarchy. Hatchan's warning in this episode emphasizes this power dynamic - the World Nobles can do anything without consequences, even kill people, because Admirals will respond to any threat against them.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://www.goodnovel.com/qa/celestial-dragons-occupy-sabaody-archipelago",
      "title": "Why Did The Celestial Dragons Occupy Sabaody Archipelago?",
      "platform": "GoodNovel",
      "accessedAt": "2025-12-04"
    },
    "postedDate": "2024-01-01",
    "episodeRange": [390, 405],
    "minEpisode": 390,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 405
    },
    "popularity": {},
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["hatchan"],
    "relatedLocations": ["sabaody-archipelago"],
    "relatedEvents": ["ep390-event-007"],
    "tags": ["sabaody-archipelago", "world-government", "world-nobles", "power-dynamics"]
  },
  {
    "id": "theory-ep390-003",
    "title": "No Celestial Dragons Have Devil Fruits - Why?",
    "summary": "Fan theory exploring why no Celestial Dragon has been shown with Devil Fruit powers, despite their wealth and access to resources.",
    "fullText": "It's noted by fans that despite the Celestial Dragons' immense wealth, power, and access to resources, no Celestial Dragon has been confirmed to have eaten a Devil Fruit. This is extremely unusual given that Devil Fruits are highly sought after and the World Nobles could easily acquire them. Theories range from religious or cultural prohibitions, to the possibility that Devil Fruits are incompatible with whatever makes Celestial Dragons 'special,' to the idea that they view Devil Fruit users as beneath them since they need external power. Some speculate it's related to their space suits or their ancestry from the original twenty kingdoms.",
    "author": "Reddit/r/OnePiece community",
    "source": {
      "url": "https://gamerant.com/one-piece-all-celestial-dragons/",
      "title": "One Piece: All Known Celestial Dragons In The Series, Ranked",
      "platform": "GameRant",
      "accessedAt": "2025-12-04"
    },
    "postedDate": "2024-01-01",
    "episodeRange": [390, 1000],
    "minEpisode": 390,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1000
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": [],
    "relatedLocations": ["sabaody-archipelago"],
    "relatedEvents": ["ep390-event-007"],
    "tags": ["celestial-dragons", "devil-fruits", "world-nobles", "mystery"]
  }
]
