[
  {
    "id": "vivre-card",
    "name": "Vivre Card",
    "nameJapanese": "ビブルカード",
    "nameRomanized": "Biburu Kādo",
    "alternateNames": ["Paper of Life", "Life Card"],
    "type": "NAVIGATION_TOOL",
    "debut": {
      "episode": 101,
      "context": "Ace gives Luffy his Vivre Card before departing to hunt Blackbeard"
    },
    "episodeAppearances": [101],
    "description": "A special piece of paper made from a person's fingernail clippings in the New World. The card is completely waterproof and fireproof, though it can be torn into pieces. Each piece will always point toward the card's owner, allowing others to track their location regardless of distance. The card also reflects the owner's life force - it burns away as the person weakens and disintegrates completely upon their death, but grows back if they recover.",
    "properties": [
      "Waterproof",
      "Fireproof",
      "Can be torn into pieces",
      "Points toward card's owner",
      "Reflects owner's life force",
      "Burns when owner is weakened or injured",
      "Disintegrates when owner dies",
      "Restores size when owner recovers"
    ],
    "keyMoments": [
      {
        "episodeNumber": 101,
        "description": "Ace gives Luffy his Vivre Card, explaining its properties and how it will help them reunite in the future",
        "timestamp": "20:30",
        "significance": "CRITICAL"
      }
    ],
    "currentOwner": "luffy",
    "originalOwner": "ace",
    "manufacturingLocation": "New World",
    "significance": "The Vivre Card becomes one of the most important items in One Piece. Ace's Vivre Card guides Luffy to Ace during the Impel Down arc and serves as a visual indicator of Ace's deteriorating condition while imprisoned. The card's burning creates urgency for the rescue mission, and its complete disintegration upon Ace's death becomes a powerful symbol of his loss. This seemingly simple gift sets up one of the series' most emotional storylines over 350 episodes later.",
    "relatedEpisodes": [416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483],
    "notes": "While Vivre Cards are introduced in the manga in Chapter 159, the anime extends this moment across the desert filler episodes. The concept of Vivre Cards represents advanced New World technology and becomes a key navigation tool throughout the series. Multiple characters later use Vivre Cards, including Big Mom's crew."
  },
  {
    "id": "prescorraci-rifle",
    "name": "Prescorraci Rifle",
    "nameJapanese": "プレスコラッチライフル",
    "nameRomanized": "Puresukoratti Raifuru",
    "type": "WEAPON",
    "debut": {
      "episode": 101,
      "context": "Scorpion uses this backpack-mounted weapon against Ace"
    },
    "episodeAppearances": [101],
    "description": "A backpack-mounted weapon system capable of firing multiple types of projectiles including high-pressure acid, steel nets, and spike-protruding explosives. The weapon is wielded by Scorpion during his confrontation with Ace.",
    "properties": [
      "Backpack-mounted design",
      "Fires acid projectiles",
      "Launches steel nets",
      "Shoots spike-protruding explosives",
      "Multi-purpose weapon system"
    ],
    "keyMoments": [
      {
        "episodeNumber": 101,
        "description": "Scorpion uses the Prescorraci Rifle in his battle against Ace",
        "timestamp": "12:15",
        "significance": "MINOR"
      }
    ],
    "currentOwner": "scorpion",
    "characterType": "ANIME_ORIGINAL",
    "significance": "An anime-original weapon that demonstrates Scorpion's resourcefulness as a bounty hunter. Despite its versatility, it proves ineffective against Ace's superior Devil Fruit abilities.",
    "notes": "This weapon exists only in the anime filler episode and showcases the creative weaponry used by bounty hunters in the One Piece world."
  }
]
