[
  {
    "id": "theory-ep490-001",
    "title": "Doflamingo's 'Higher Authority' Theory",
    "summary": "When Doflamingo tells Moria that the order to eliminate him came from 'even higher up' than Sengoku, fans theorized this was a hint at the Celestial Dragons or the Gorosei (Five Elders) being involved in Warlord decisions.",
    "fullText": "In Episode 490, Doflamingo cryptically reveals that the order to eliminate Gecko Moria came from an authority 'even higher up' than Fleet Admiral Sengoku. This sparked widespread fan discussion about who could have such authority. The leading theory is that this refers to either the Celestial Dragons (World Nobles) or the Gorosei (Five Elders), who are the highest-ranking members of the World Government. This moment was one of the first clear hints that there are shadowy figures pulling strings behind the scenes, and that even the Warlord system is controlled by these mysterious authorities. Some fans even theorized that Doflamingo himself might have connections to the Celestial Dragons, which would explain why he has access to such high-level orders. This theory was later confirmed in the Dressrosa Arc when Doflamingo's true identity as a former Celestial Dragon was revealed.",
    "author": "One Piece Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_490",
      "title": "Episode 490 Discussion - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-15"
    },
    "postedDate": "2011-03-20",
    "episodeRange": [490, 700],
    "minEpisode": 490,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 700
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["doflamingo", "gecko-moria", "sengoku"],
    "relatedLocations": ["marineford"],
    "relatedEvents": ["ep490-event-007"],
    "tags": ["world-government", "celestial-dragons", "gorosei", "doflamingo", "warlords"]
  },
  {
    "id": "theory-ep490-002",
    "title": "Hawkins' Zero Percent Death Theory for Luffy",
    "summary": "Basil Hawkins' observation that Luffy's survival odds never reach zero sparked theories that Luffy is protected by destiny or fate, possibly related to the Will of D or his role as a prophesied figure.",
    "fullText": "When Basil Hawkins uses his fortune-telling abilities in Episode 490 and notes that 'the odds of Straw Hat Luffy being alive never reaches zero,' it immediately sparked fan theories about destiny and fate in One Piece. Many fans theorized that this is evidence that Luffy is protected by some higher force - whether it's the Will of D, the prophecy mentioned by various characters, or something related to Joy Boy. This moment suggested that Luffy's survival through impossible odds isn't just luck or willpower, but might be guided by fate itself. Some fans connected this to other moments throughout the series where Luffy survived seemingly impossible situations, from Loguetown (where lightning struck Buggy just as he was about to execute Luffy) to Marineford itself. The theory gained more traction as the series progressed and more was revealed about the Will of D, ancient prophecies, and Luffy's connection to Joy Boy. This episode was one of the first explicit acknowledgments within the story that Luffy's plot armor might be an actual in-universe force.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_490",
      "title": "Episode 490 - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-15"
    },
    "postedDate": "2011-03-20",
    "episodeRange": [490, 1100],
    "minEpisode": 490,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["luffy", "basil-hawkins"],
    "relatedLocations": [],
    "relatedEvents": ["ep490-event-009"],
    "tags": ["destiny", "will-of-d", "luffy", "hawkins", "prophecy", "joy-boy"]
  },
  {
    "id": "theory-ep490-003",
    "title": "Trafalgar Law's Secret Motivation Theory",
    "summary": "Scratchmen Apoo's question about why Law saved Luffy sparked numerous theories about Law's true motivations, ranging from a shared connection through the Will of D to strategic alliance planning.",
    "fullText": "When Scratchmen Apoo questions in Episode 490 why the brutal Trafalgar Law would save Monkey D. Luffy, it sparked one of the longest-running mysteries in the Post-War period. Fans developed numerous theories: (1) Law recognized Luffy's importance due to their shared 'D' initial and wanted to preserve this lineage; (2) Law was planning a strategic alliance with Luffy to take down a Yonko (later confirmed); (3) Law had some personal connection to Luffy's family or past; (4) Law simply respected Luffy's actions at Marineford and acted on instinct, as Ivankov suggested. The mystery of Law's motivations became a major discussion point among fans, with many believing there had to be a deeper reason beyond simple respect or instinct. This was eventually addressed in the Punk Hazard and Dressrosa arcs, where Law's plan to use an alliance with Luffy to take down Doflamingo and Kaido was revealed. However, some fans still believe there are deeper, unexplored reasons for Law's decision.",
    "author": "One Piece Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_490",
      "title": "Episode 490 - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-15"
    },
    "postedDate": "2011-03-20",
    "episodeRange": [490, 750],
    "minEpisode": 490,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 750
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["trafalgar-law", "luffy", "scratchmen-apoo"],
    "relatedLocations": [],
    "relatedEvents": ["ep490-event-010"],
    "tags": ["law", "luffy", "alliance", "will-of-d", "motivation"]
  }
]
