[
  {
    "name": {
      "english": "Cat-Cat Fruit, Model: Leopard",
      "japanese": "ネコネコの実 モデル:豹",
      "romanized": "Neko Neko no Mi, Moderu: Hyō"
    },
    "fruitType": "ZOAN",
    "subType": "CARNIVOROUS",
    "debutEpisode": 274,
    "debutChapter": 349,
    "episodeAppearances": [308],
    "description": "The Neko Neko no Mi, Model: Leopard is a Zoan-type Devil Fruit that allows the user to transform into a leopard or a leopard-human hybrid. As a carnivorous Zoan fruit, it is particularly well-suited for combat, enhancing the user's physical abilities including strength, speed, and ferocity. The hybrid form provides enlarged fists and enhanced physical power while maintaining human intelligence and technique.",
    "currentUser": "rob-lucci",
    "previousUsers": [],
    "userHistory": [
      {
        "userId": "rob-lucci",
        "episodeConsumed": null,
        "episodeLost": null,
        "status": "ACTIVE"
      }
    ],
    "abilities": [
      {
        "abilityName": "Leopard Hybrid Form",
        "episodeRevealed": 274,
        "description": "Rob Lucci transforms into a bulky leopard-human hybrid form that dramatically increases his physical strength, speed, and combat ability. In this form, his fists are enlarged, enhancing the power of his Rokushiki techniques.",
        "usedBy": "rob-lucci"
      },
      {
        "abilityName": "Enhanced Rokuougan",
        "episodeRevealed": 308,
        "description": "In his leopard hybrid form, Lucci's ultimate Rokushiki technique, the Rokuougan (Six King Gun), is enhanced to maximum power. The enlarged fists create a larger attack radius and greater destructive force, making it capable of overwhelming even Gear Second Luffy.",
        "usedBy": "rob-lucci"
      }
    ],
    "awakening": null,
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit Weaknesses",
        "description": "Like all Devil Fruit users, Rob Lucci cannot swim and is vulnerable to Seastone and standing water."
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 308,
        "eventId": "ep308-event-007",
        "momentType": "POWER_REVEAL",
        "description": "Rob Lucci uses his leopard hybrid form to unleash the Rokuougan at maximum power, demonstrating the fruit's enhancement of his already formidable Rokushiki abilities. The attack proves devastating enough to defeat Luffy.",
        "significance": "Showcases how the Neko Neko no Mi, Model: Leopard enhances Lucci's ultimate technique, making him CP9's most dangerous member.",
        "timestamp": "16:00"
      }
    ],
    "trivia": [
      "According to Rob Lucci, carnivorous Zoan fruits like the Neko Neko no Mi, Model: Leopard are especially specialized for combat and close-quarters fighting.",
      "The leopard hybrid form's enlarged fists make Lucci's Rokushiki techniques even more devastating, particularly the Rokuougan which requires close-range contact.",
      "This fruit represents one of the first carnivorous Zoan fruits shown in the series and demonstrates the combat-oriented nature of such transformations."
    ]
  },
  {
    "name": {
      "english": "Gum-Gum Fruit",
      "japanese": "ゴムゴムの実",
      "romanized": "Gomu Gomu no Mi"
    },
    "fruitType": "PARAMECIA",
    "subType": null,
    "debutEpisode": 1,
    "debutChapter": 1,
    "episodeAppearances": [308],
    "description": "The Gomu Gomu no Mi is a Paramecia-type Devil Fruit that gives the user's body the properties of rubber, making them a Rubber Human. This allows the user to stretch their limbs to great lengths, become immune to blunt force and electricity, and combine their rubber properties with various combat techniques.",
    "currentUser": "luffy",
    "previousUsers": [],
    "userHistory": [
      {
        "userId": "luffy",
        "episodeConsumed": 1,
        "episodeLost": null,
        "status": "ACTIVE"
      }
    ],
    "abilities": [
      {
        "abilityName": "Gomu Gomu no Jet Bullet",
        "episodeRevealed": 308,
        "description": "A Gear Second technique where Luffy delivers a high-speed bullet-like punch combining his rubber abilities with enhanced speed and power.",
        "usedBy": "luffy"
      },
      {
        "abilityName": "Gomu Gomu no Twin Jet Pistol",
        "episodeRevealed": 308,
        "description": "A Gear Second technique where Luffy attacks with two simultaneous high-speed punches, doubling the impact of his standard Jet Pistol.",
        "usedBy": "luffy"
      },
      {
        "abilityName": "Gomu Gomu no Jet Axe",
        "episodeRevealed": 308,
        "description": "A Gear Second technique where Luffy brings his leg down with tremendous force enhanced by increased speed, delivering a powerful axe kick.",
        "usedBy": "luffy"
      }
    ],
    "awakening": null,
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit Weaknesses",
        "description": "Like all Devil Fruit users, Luffy cannot swim and is vulnerable to Seastone and standing water."
      },
      {
        "weakness": "Bladed Weapons",
        "description": "While immune to blunt force, Luffy's rubber body can still be cut by sharp weapons and bladed attacks."
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 308,
        "eventId": "ep308-event-002",
        "momentType": "TECHNIQUE_DEBUT",
        "description": "Luffy uses Gomu Gomu no Jet Bullet, showcasing another variation of his Gear Second arsenal against Rob Lucci.",
        "significance": "Demonstrates the variety of Gear Second techniques Luffy has developed for the battle against CP9's strongest member.",
        "timestamp": "05:15"
      },
      {
        "episodeNumber": 308,
        "eventId": "ep308-event-003",
        "momentType": "TECHNIQUE_DEBUT",
        "description": "Luffy demonstrates the Twin Jet Pistol, attacking with two simultaneous high-speed punches.",
        "significance": "Shows Luffy's tactical thinking in overwhelming a powerful opponent with double attacks.",
        "timestamp": "07:45"
      },
      {
        "episodeNumber": 308,
        "eventId": "ep308-event-004",
        "momentType": "TECHNIQUE_DEBUT",
        "description": "Luffy executes Gomu Gomu no Jet Axe, demonstrating that Gear Second enhancement applies to kicks as well as punches.",
        "significance": "Showcases the versatility of Gear Second by applying it to different attack types.",
        "timestamp": "09:20"
      }
    ],
    "trivia": [
      "This episode showcases multiple new Gear Second techniques, demonstrating Luffy's continued development and mastery of this power-up form.",
      "Despite the variety of powerful Gear Second attacks, Luffy is still overwhelmed by Rob Lucci's ultimate Rokuougan technique, showing the limits of his current abilities."
    ]
  }
]
