[
  {
    "name": {
      "english": "Bridge of Hesitation",
      "japanese": "ためらいの橋",
      "romanized": "Tamerai no Hashi"
    },
    "locationType": "BRIDGE",
    "seaRegion": "PARADISE",
    "islandName": "Enies Lobby",
    "debutEpisode": 263,
    "debutChapter": 401,
    "description": "The Bridge of Hesitation is a massive bridge structure at Enies Lobby that connects the main island to the Gate of Justice. This bridge serves as the final path for criminals being transported to Impel Down or Marineford. During the Straw Hats' rescue of Nico Robin, it becomes the site of the climactic battle between Luffy and Rob Lucci, as well as the location where the remaining crew members face off against a massive Marine army.",
    "episodeAppearances": [308],
    "keyEvents": [
      {
        "episodeNumber": 308,
        "eventId": "ep308-event-001",
        "eventType": "BATTLE_START",
        "title": "Luffy Gains Upper Hand Against Lucci",
        "description": "The intense battle between Luffy and Rob Lucci continues on the Bridge of Hesitation, with Luffy appearing to gain the upper hand using his Gear Second techniques.",
        "significance": "The Bridge of Hesitation serves as the dramatic battlefield for the climactic confrontation between Luffy and CP9's strongest agent.",
        "timestamp": "03:30"
      },
      {
        "episodeNumber": 308,
        "eventId": "ep308-event-005",
        "eventType": "LOCATION_ARRIVAL",
        "title": "Marines Attack the Bridge of Hesitation",
        "description": "A massive Marine army launches an assault on the Bridge of Hesitation, using cannon fire from surrounding battleships to attack the bridge's pillars.",
        "significance": "Escalates the danger by adding a secondary threat while Luffy battles Lucci, forcing the crew to defend their position.",
        "timestamp": "11:30"
      },
      {
        "episodeNumber": 308,
        "eventId": "ep308-event-006",
        "eventType": "BATTLE_START",
        "title": "Straw Hats Face Off Against Marine Army",
        "description": "The Straw Hat Pirates defend their position on the Bridge of Hesitation against the massive Marine army while waiting for Luffy to defeat Lucci.",
        "significance": "The bridge becomes a multi-front battlefield where the crew must hold their ground against overwhelming odds.",
        "timestamp": "13:45"
      },
      {
        "episodeNumber": 308,
        "eventId": "ep308-event-007",
        "eventType": "POWER_REVEAL",
        "title": "Rob Lucci Unleashes Ultimate Rokuougan",
        "description": "On the Bridge of Hesitation, Rob Lucci unleashes his ultimate technique, the Rokuougan, in his leopard hybrid form against Luffy.",
        "significance": "The bridge witnesses the deployment of the ultimate Rokushiki technique and Luffy's apparent defeat.",
        "timestamp": "16:00"
      },
      {
        "episodeNumber": 308,
        "eventId": "ep308-event-009",
        "eventType": "RELATIONSHIP_REVEAL",
        "title": "Usopp Removes Sogeking Mask and Reveals Identity",
        "description": "On the Bridge of Hesitation, Usopp removes his Sogeking mask and reveals his true identity to encourage the fallen Luffy.",
        "significance": "The bridge becomes the site of one of the most emotionally powerful moments in the arc, where Usopp sets aside his pride to support his captain.",
        "timestamp": "18:45"
      },
      {
        "episodeNumber": 308,
        "eventId": "ep308-event-014",
        "eventType": "CULTURAL_MOMENT",
        "title": "Bridge Pillar Damaged by Marine Cannon Fire",
        "description": "The Marine battleships successfully damage the first pillar of the Bridge of Hesitation with cannon fire, threatening the structural integrity of the bridge.",
        "significance": "Creates additional urgency as the bridge's stability becomes compromised, adding a time pressure element to the battle.",
        "timestamp": "22:00"
      }
    ],
    "status": "DAMAGED",
    "statusHistory": [
      {
        "status": "ACTIVE",
        "episodeStart": 263,
        "episodeEnd": 307,
        "reason": "Bridge is intact and operational"
      },
      {
        "status": "DAMAGED",
        "episodeStart": 308,
        "episodeEnd": "present",
        "reason": "Bridge pillars damaged by Marine cannon fire during the battle"
      }
    ],
    "parentLocation": "enies-lobby",
    "childLocations": [],
    "relatedCharacters": ["luffy", "rob-lucci", "usopp", "zoro", "nami", "franky", "chopper"],
    "relatedCrews": ["straw-hat-pirates", "cp9", "marines"],
    "relatedArcs": ["Enies Lobby"],
    "images": []
  }
]
