[
  {
    "id": "bellemere-tangerine-orchard",
    "names": {
      "english": "Bellemere's Tangerine Orchard",
      "japanese": "ベルメールのみかん畑",
      "romanized": "Berumēru no mikan batake"
    },
    "type": "LANDMARK",
    "debutEpisode": 37,
    "episodeAppearances": [37],
    "description": "The tangerine orchard that was tended by Bellemere and is now maintained by Nojiko. This is where Nami buried her accumulated treasure of 93 million berries.",
    "keyEvents": [
      {
        "episodeNumber": 37,
        "event": "Nezumi and his Marines discover Nami's buried treasure of 93 million berries",
        "significance": "The location where Nami's eight years of work and hope are destroyed",
        "timestamp": "06:20"
      },
      {
        "episodeNumber": 37,
        "event": "Nojiko is shot by Nezumi while trying to protect the treasure",
        "significance": "The orchard becomes a site of violence and betrayal",
        "timestamp": "08:15"
      }
    ],
    "culturalSignificance": "The tangerine orchard represents Bellemere's legacy and Nami's connection to her adoptive mother. The fact that Nami chose to hide her treasure here shows how important this place is to her.",
    "geographicalDetails": "Located in or near Cocoyasi Village on the island"
  },
  {
    "id": "cocoyasi-village",
    "names": {
      "english": "Cocoyasi Village",
      "japanese": "ココヤシ村",
      "romanized": "Kokoyashi Mura"
    },
    "type": "VILLAGE",
    "episodeAppearances": [37],
    "description": "Nami's home village, oppressed by the Arlong Pirates for eight years.",
    "keyEvents": [
      {
        "episodeNumber": 37,
        "event": "Nezumi and Marines arrive to confiscate Nami's treasure",
        "significance": "Reveals the extent of corruption - even the Marines oppress the village",
        "timestamp": "03:45"
      },
      {
        "episodeNumber": 37,
        "event": "Nami stabs her Arlong Pirates tattoo in the village street",
        "significance": "The most emotionally powerful moment in the Arlong Park arc occurs here",
        "timestamp": "14:22"
      },
      {
        "episodeNumber": 37,
        "event": "Luffy places his straw hat on Nami's head and declares he will help",
        "significance": "One of the most iconic scenes in One Piece history takes place in this village",
        "timestamp": "16:45"
      },
      {
        "episodeNumber": 37,
        "event": "Villagers arm themselves to join the fight against Arlong",
        "significance": "The village transitions from submission to resistance",
        "timestamp": "19:15"
      }
    ],
    "culturalSignificance": "Represents the struggle of ordinary people against tyranny and corruption"
  },
  {
    "id": "arlong-park",
    "names": {
      "english": "Arlong Park",
      "japanese": "アーロンパーク",
      "romanized": "Āron Pāku"
    },
    "type": "STRONGHOLD",
    "episodeAppearances": [37],
    "description": "The headquarters of the Arlong Pirates, a fortress-like complex that serves as the center of Arlong's control over the region.",
    "keyEvents": [
      {
        "episodeNumber": 37,
        "event": "Nami confronts Arlong about the stolen treasure and broken promise",
        "significance": "Arlong reveals his betrayal and true manipulative nature",
        "timestamp": "11:30"
      },
      {
        "episodeNumber": 37,
        "event": "The Straw Hat crew arrives at Arlong Park ready for battle",
        "significance": "Sets up the climactic battle of the arc",
        "timestamp": "20:45"
      }
    ],
    "culturalSignificance": "Symbolizes oppression and the power structure that must be destroyed for the village to be free"
  }
]
