[
  {
    "id": "theory-ep473-001",
    "title": "Whitebeard's True World-Destruction Capability",
    "summary": "Fan discussion about whether Whitebeard could actually destroy the world with his Gura Gura no Mi power, as claimed by Sengoku during Marineford.",
    "fullText": "Sengoku proclaimed during the Marineford War that Whitebeard holds the power to destroy the world. The particular kanji used for the Gura Gura no Mi's 'Power to Destroy the World' is the exact same as the kanji used for Ancient Weapons, suggesting the threat level is comparable to those legendary weapons. Fans theorize about the full extent of this power - whether Whitebeard could literally shatter the planet, create tsunamis that would flood all islands, or if it's metaphorical destruction referring to his ability to topple the World Government. The fact that Whitebeard chose not to use his full destructive power until after Ace's death raises questions about what would have happened if he had unleashed it from the start.",
    "author": "Various One Piece Fans",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Gura_Gura_no_Mi",
      "title": "Gura Gura no Mi - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-14"
    },
    "postedDate": "2010-10-31",
    "episodeRange": [473, 489],
    "minEpisode": 473,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 489
    },
    "popularity": {},
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["whitebeard", "sengoku"],
    "relatedLocations": ["marineford"],
    "relatedEvents": ["ep473-event-005"],
    "tags": ["whitebeard", "gura-gura-no-mi", "world-destruction", "ancient-weapons", "marineford"]
  },
  {
    "id": "theory-ep473-002",
    "title": "What If the Encircling Walls Had Worked Perfectly?",
    "summary": "Speculation about the outcome of the Marineford War if Little Oars Jr.'s body hadn't blocked the encircling walls.",
    "fullText": "The encircling walls were a crucial part of Sengoku's master plan to trap and annihilate the Whitebeard Pirates. Part of the wall's mechanism was damaged by Oars Jr.'s blood and pressed down by his body, preventing it from rising completely. Fans theorize that if the walls had worked perfectly, the Whitebeard Pirates would have been completely trapped in the bay with melting ice beneath them (from Akainu's Meteor Volcano), no ships, and no way to reach Ace on the execution platform. This would likely have resulted in a catastrophic defeat for the Whitebeard Pirates and the complete failure of Ace's rescue. The implication is that Little Oars Jr.'s sacrifice, even in death, was one of the most critical factors in giving the pirates any chance at all. Some fans argue that without this gap, Luffy would never have reached Ace, and the entire outcome of the war would have been different.",
    "author": "Various One Piece Fans",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Summit_War_of_Marineford",
      "title": "Summit War of Marineford - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-14"
    },
    "postedDate": "2010-10-31",
    "episodeRange": [466, 489],
    "minEpisode": 466,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 489
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": ["little-oars-jr", "whitebeard", "luffy", "sengoku", "akainu"],
    "relatedLocations": ["marineford"],
    "relatedEvents": ["ep473-event-007", "ep473-event-009", "ep473-event-011"],
    "tags": ["encircling-walls", "little-oars-jr", "what-if", "marineford", "strategy"]
  },
  {
    "id": "theory-ep473-003",
    "title": "Little Oars Jr.'s Survival Status",
    "summary": "Fan debate about whether Little Oars Jr. actually died during the Marineford War or merely fell unconscious.",
    "fullText": "It was never confirmed in the story whether Little Oars Jr. died or not after his sacrifice at Marineford. Fans have debated this extensively since his fall. Some argue that the ancient giant was heavily injured during the battle, and used the last of his strength to help the Whitebeard Pirates before succumbing to his wounds. Others point out that Oda typically makes character deaths very explicit, and the ambiguity around Oars Jr.'s fate suggests he may have survived. The fact that his body continued to play a crucial role by blocking the encircling walls even after he fell adds to the discussion. Some fans theorize we may see him again in the story's future, while others view his sacrifice as complete and final. The emotional weight of his determination to save Ace, his friendship with the young pirate, and his willingness to charge into hopeless battle resonates regardless of his ultimate fate.",
    "author": "Various One Piece Fans",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Little_Oars_Jr.",
      "title": "Little Oars Jr. - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-14"
    },
    "postedDate": "2010-10-31",
    "episodeRange": [464, 489],
    "minEpisode": 464,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 489
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": ["little-oars-jr", "ace", "whitebeard"],
    "relatedLocations": ["marineford"],
    "relatedEvents": ["ep473-event-009"],
    "tags": ["little-oars-jr", "death", "survival", "marineford"]
  }
]
