[
  {
    "name": {
      "english": "Straw Hat Pirates",
      "japanese": "麦わらの一味",
      "romanized": "Mugiwara no Ichimi"
    },
    "debutEpisode": 1,
    "episodeAppearances": [373],
    "captain": "luffy",
    "keyMoments": [
      {
        "episodeNumber": 373,
        "eventId": "ep373-event-003",
        "title": "Coordinated Team Attack on Oars",
        "description": "The entire Straw Hat crew executes a perfectly coordinated strategy to defeat Oars, with each member playing a crucial role: Robin creates footholds, Nami dampens Oars, Franky and Usopp freeze his legs, Sanji restrains him with chains, Chopper provides medical analysis, Zoro straightens his spine, Brook carries Luffy, and Luffy delivers the finishing blow.",
        "significance": "Represents one of the crew's most impressive displays of teamwork and coordination, showcasing how their diverse abilities complement each other perfectly."
      },
      {
        "episodeNumber": 373,
        "eventId": "ep373-event-011",
        "title": "Defeats Oars",
        "description": "Through their coordinated efforts, the Straw Hats successfully defeat the legendary zombie Oars, one of their most formidable opponents to date.",
        "significance": "Major victory that demonstrates the crew's growth and ability to overcome seemingly impossible odds through unity and strategic thinking."
      }
    ]
  },
  {
    "name": {
      "english": "Thriller Bark Pirates",
      "japanese": "スリラーバーク海賊団",
      "romanized": "Surirā Bāku Kaizokudan"
    },
    "debutEpisode": 343,
    "episodeAppearances": [373],
    "captain": "gecko-moria",
    "keyMoments": [
      {
        "episodeNumber": 373,
        "eventId": "ep373-event-011",
        "title": "Oars Defeated by Straw Hats",
        "description": "The Thriller Bark Pirates' ultimate weapon, the zombie Oars piloted by Moria, is defeated by the Straw Hats' coordinated assault.",
        "significance": "Represents a major setback for Moria's forces and the loss of their most powerful zombie warrior."
      },
      {
        "episodeNumber": 373,
        "eventId": "ep373-event-013",
        "title": "Moria Sacrifices All Zombie Soldiers",
        "description": "Gecko Moria absorbs the shadows from all 1,000 zombies on Thriller Bark, including his subordinates like Cindry, Hildon, and zombie Lola, causing them to drop lifeless. He sacrifices his entire army for personal power.",
        "significance": "Shows Moria's desperation and willingness to sacrifice everything for victory. This decision leaves him without any zombie forces but grants him enormous power."
      }
    ]
  },
  {
    "name": {
      "english": "Rolling Pirates",
      "japanese": "ローリング海賊団",
      "romanized": "Rōringu Kaizokudan"
    },
    "debutEpisode": 346,
    "episodeAppearances": [373],
    "captain": "charlotte-lola",
    "keyMoments": [
      {
        "episodeNumber": 373,
        "eventId": "ep373-event-011",
        "title": "Witnesses Oars' Defeat",
        "description": "The Rolling Pirates, who had their shadows stolen and were helping the Straw Hats, witness the defeat of Oars and the hope it brings for recovering their shadows.",
        "significance": "Represents hope for all the shadow victims on Thriller Bark that they might finally be freed."
      }
    ]
  }
]
