[
  {
    "name": {
      "english": "Calm Belt",
      "japanese": "凪の帯",
      "romanized": "Nagi no Obi"
    },
    "locationType": "SEA_REGION",
    "debutEpisode": 54,
    "debutChapter": 101,
    "isCanon": true,
    "episodeAppearances": [54],
    "parentLocation": null,
    "sea": "ALL_SEAS",
    "keyEvents": [
      {
        "episodeNumber": 54,
        "eventId": "ep054-event-010",
        "title": "The Calm Belt's First Appearance in Anime",
        "description": "The Going Merry accidentally enters the Calm Belt while fleeing from the Marine fleet, introducing this dangerous region in the anime.",
        "significance": "First introduction of the Calm Belt in the anime, establishing it as a critical geographical feature of the One Piece world.",
        "timestamp": "19:00"
      },
      {
        "episodeNumber": 54,
        "eventId": "ep054-event-011",
        "title": "The Calm Belt Explained",
        "description": "Nami explains that the Calm Belt is a windless region with no ocean currents that serves as home to giant Sea Kings, making it one of the most dangerous areas in the world.",
        "significance": "Provides crucial world-building exposition about the One Piece geography and establishes the Calm Belt's dangers.",
        "timestamp": "20:00"
      }
    ],
    "description": "The Calm Belt consists of two ocean regions that border the north and south edges of the Grand Line. These areas have absolutely no wind or ocean currents, making it impossible for conventional sailing ships to navigate through them. The region is also the primary habitat for massive Sea Kings, making it extremely dangerous for any vessel attempting passage.",
    "significantFeatures": [
      "Complete absence of wind and ocean currents",
      "Home to the world's largest Sea Kings",
      "Natural barrier between the Grand Line and the four seas",
      "Ships with Seastone hulls can pass through more safely"
    ],
    "inhabitants": ["Sea Kings"],
    "controlledBy": null,
    "firstMentionedEpisode": 54,
    "destroyed": false,
    "images": [],
    "trivia": [
      "The Calm Belt was introduced earlier in the anime (Episode 54) than in the manga (Chapter 101)",
      "The Marines later discover that lining ships with Seastone allows passage without attracting Sea Kings",
      "Several important locations exist within the Calm Belt, including Amazon Lily, Rusukaina, and Impel Down"
    ]
  },
  {
    "name": {
      "english": "Warship Island",
      "japanese": "軍艦島",
      "romanized": "Gunkan-jima"
    },
    "locationType": "ISLAND",
    "debutEpisode": 54,
    "debutChapter": null,
    "isCanon": false,
    "episodeAppearances": [54],
    "parentLocation": null,
    "sea": "EAST_BLUE",
    "keyEvents": [
      {
        "episodeNumber": 54,
        "eventId": "ep054-event-005",
        "title": "Warship Island Mentioned",
        "description": "Apis reveals that her home is Warship Island, establishing it as the destination for the arc.",
        "significance": "Introduces Warship Island as Apis's home and the eventual destination of the Warship Island Arc.",
        "timestamp": "08:00"
      }
    ],
    "description": "Warship Island, also known as Battleship Island, is an anime-exclusive location in the East Blue. The island is named for its mountain formation which resembles a warship when viewed from a distance. It is the home of Apis and contains the Dragon's Nest, a location that rises from the ocean every 1000 years where the ancient Sennenryu dragons gather to give birth and die.",
    "significantFeatures": [
      "Mountain shaped like a warship",
      "Dragon's Nest located beneath the island",
      "Home to Apis and her grandfather Bokuden",
      "Sacred nesting ground for Sennenryu dragons"
    ],
    "inhabitants": ["Apis", "Bokuden", "Village residents"],
    "controlledBy": null,
    "firstMentionedEpisode": 54,
    "destroyed": false,
    "images": [],
    "trivia": [
      "Warship Island is entirely anime-original and does not appear in the manga",
      "The island serves as the setting for the Warship Island Arc, the first filler arc in One Piece",
      "The Dragon's Nest beneath the island only appears once every thousand years"
    ]
  },
  {
    "name": {
      "english": "Marine 8th Branch Ship",
      "japanese": "海軍第8支部船",
      "romanized": "Kaigun Dai-hachi Shibu Sen"
    },
    "locationType": "SHIP",
    "debutEpisode": 54,
    "debutChapter": null,
    "isCanon": false,
    "episodeAppearances": [54],
    "parentLocation": null,
    "sea": "EAST_BLUE",
    "keyEvents": [
      {
        "episodeNumber": 54,
        "eventId": "ep054-event-001",
        "title": "Apis's Escape",
        "description": "Apis escapes from her captivity on this Marine ship during a rainstorm by incapacitating a guard and jumping onto a lifeboat.",
        "significance": "The location where Apis was held captive and from which she escapes, starting the Warship Island Arc.",
        "timestamp": "02:15"
      }
    ],
    "description": "A Marine warship belonging to the 8th Branch of the Marines in the East Blue. This ship was used to hold Apis captive before she escaped during a storm. It is one of several vessels in Nelson Royal's fleet.",
    "significantFeatures": [
      "Standard Marine warship design",
      "Holding cells for prisoners",
      "Part of Nelson Royal's fleet"
    ],
    "inhabitants": ["Marine soldiers", "Apis (formerly)"],
    "controlledBy": "Marine 8th Branch",
    "firstMentionedEpisode": 54,
    "destroyed": false,
    "images": [],
    "trivia": []
  },
  {
    "name": {
      "english": "Marine 8th Branch Flagship",
      "japanese": "海軍第8支部旗艦",
      "romanized": "Kaigun Dai-hachi Shibu Kikan"
    },
    "locationType": "SHIP",
    "debutEpisode": 54,
    "debutChapter": null,
    "isCanon": false,
    "episodeAppearances": [54],
    "parentLocation": null,
    "sea": "EAST_BLUE",
    "keyEvents": [
      {
        "episodeNumber": 54,
        "eventId": "ep054-event-007",
        "title": "Nelson Royal Commands from Flagship",
        "description": "Nelson Royal commands his fleet from this flagship, ordering the pursuit of the Straw Hats to recapture Apis.",
        "significance": "The command center for the Marine forces pursuing Apis and the Straw Hats.",
        "timestamp": "14:00"
      },
      {
        "episodeNumber": 54,
        "eventId": "ep054-event-009",
        "title": "Fleet Pursuit Begins",
        "description": "The flagship leads the Marine fleet in pursuit of the Going Merry after spotting Apis aboard.",
        "significance": "Initiates the chase that forces the Straw Hats into the Calm Belt.",
        "timestamp": "17:45"
      }
    ],
    "description": "The flagship of Marine Branch 8, commanded by Commodore Nelson Royal. This large warship serves as the command center for Nelson Royal's operations and houses both him and the mercenary Eric. Due to Nelson Royal's extreme obesity, the ship is specially equipped to accommodate his chair-carried transportation.",
    "significantFeatures": [
      "Flagship of the 8th Branch fleet",
      "Command center for Nelson Royal",
      "Larger than standard Marine warships",
      "Equipped to carry Nelson Royal's throne-like chair"
    ],
    "inhabitants": ["Nelson Royal", "Eric", "Marine soldiers"],
    "controlledBy": "Marine 8th Branch",
    "firstMentionedEpisode": 54,
    "destroyed": false,
    "images": [],
    "trivia": [
      "The flagship stops at the edge of the Calm Belt, unwilling to follow the Straw Hats into the dangerous region"
    ]
  }
]
