[
  {
    "id": "amazon-lily",
    "name": {
      "english": "Amazon Lily",
      "japanese": "アマゾン・リリー",
      "romanized": "Amazon Rirī",
      "aliases": ["Island of Women", "Maiden Island"]
    },
    "debutEpisode": 408,
    "debutChapter": 514,
    "episodeAppearances": [408],
    "locationType": "ISLAND",
    "region": "Calm Belt",
    "seaOrGrandLine": "CALM_BELT",
    "description": "Amazon Lily is an island located in the Calm Belt, inhabited exclusively by the Kuja tribe of female warriors. It is a lush, tropical island with dense forests, exotic flora, and dangerous fauna. The island is protected by Sea Kings in the surrounding waters, making it extremely difficult to reach by conventional means.",
    "keyEvents": [
      {
        "episodeNumber": 408,
        "eventId": "ep408-event-001",
        "title": "Luffy's Arrival on Amazon Lily",
        "description": "Luffy crashes onto Amazon Lily after being sent flying by Bartholomew Kuma's powers, becoming the first man to set foot on the island in recent memory.",
        "significance": "Marks the beginning of the Amazon Lily Arc and violates the island's sacred law forbidding men from entering.",
        "timestamp": "02:15"
      },
      {
        "episodeNumber": 408,
        "eventId": "ep408-event-002",
        "title": "Introduction of Amazon Lily",
        "description": "The narrator introduces Amazon Lily as an island inhabited by the Kuja tribe of female warriors where men face certain death if they set foot.",
        "significance": "Establishes the island's unique culture and the danger Luffy faces simply by being there.",
        "timestamp": "04:30"
      },
      {
        "episodeNumber": 408,
        "eventId": "ep408-event-007",
        "title": "Discovery of Male Intruder",
        "description": "The Kuja warriors discover that their mysterious visitor is actually a male, shocking the entire village.",
        "significance": "Creates the central conflict of the arc as the Kuja must decide what to do about a man on their sacred island.",
        "timestamp": "17:10"
      }
    ],
    "notableFeatures": [
      {
        "feature": "All-Female Population",
        "description": "Amazon Lily is inhabited exclusively by women of the Kuja tribe. Men are strictly forbidden from the island under penalty of death.",
        "episodeIntroduced": 408
      },
      {
        "feature": "Calm Belt Location",
        "description": "The island is located in the Calm Belt, one of the most dangerous areas in the world due to the Sea Kings that inhabit these waters. This makes the island extremely isolated and difficult to reach.",
        "episodeIntroduced": 408
      },
      {
        "feature": "Parasitic Mushrooms",
        "description": "The island's forests contain dangerous 'Body Mushrooms' that cause various emotional effects when eaten but then grow parasitically on the consumer's body, draining their life force.",
        "episodeIntroduced": 408
      },
      {
        "feature": "Kuja Village",
        "description": "The main settlement on Amazon Lily where the Kuja tribe lives. It features traditional architecture and is where Luffy is brought for treatment.",
        "episodeIntroduced": 408
      }
    ],
    "governingBody": "Ruled by an empress from the Kuja tribe",
    "protectionLevel": "EXTREME",
    "accessibilityStatus": "RESTRICTED",
    "culturalSignificance": [
      {
        "aspect": "Isolationist Society",
        "description": "Amazon Lily represents a completely isolated matriarchal society with no contact with men or the outside world for most of its inhabitants.",
        "episodeRevealed": 408
      },
      {
        "aspect": "Warrior Culture",
        "description": "The Kuja are a tribe of powerful female warriors who have developed their own unique combat techniques and culture separate from the rest of the world.",
        "episodeRevealed": 408
      }
    ],
    "statusHistory": [
      {
        "status": "ACTIVE",
        "episodeStart": 408,
        "episodeEnd": "present",
        "description": "Functioning as the home of the Kuja tribe"
      }
    ],
    "images": [],
    "trivia": [
      {
        "fact": "Amazon Lily is one of the few locations in One Piece that is completely isolated from the influence of the World Government due to its location in the Calm Belt.",
        "category": "WORLD_BUILDING"
      },
      {
        "fact": "The island's name and culture are inspired by the Amazons of Greek mythology, warrior women who lived in isolation from men.",
        "category": "CULTURAL_REFERENCE"
      }
    ]
  }
]
