[
  {
    "id": "theory-ep278-001",
    "title": "Saul Survived the Ice: The Time Capsule Theory",
    "theory": "Fans theorized that Jaguar D. Saul survived Aokiji's freezing based on the specific technique used. Aokiji used 'Ice Time Capsule' when freezing Saul - the only time this specific technique was ever used. The concept of a time capsule is to preserve something until it's rediscovered in the future, leading fans to believe this was intentional foreshadowing. Additionally, Aokiji has frozen many people throughout the story without killing them, and no skeleton or remains of Saul were ever shown on Ohara.",
    "author": "One Piece Community (Multiple theorists)",
    "platform": "Reddit/Forums",
    "url": "https://worstgen.alwaysdata.net/forum/threads/olvia-and-saul-are-alive-the-formation-of-the-revolutionary-army.4206/",
    "publishDate": "2020-01-01",
    "episodesSpanned": [278],
    "minEpisode": 278,
    "status": "CONFIRMED",
    "confirmationDetails": "Later confirmed in Chapter 1066 - Saul survived by being freed when Ohara's flames melted the ice, then escaped to Elbaf with the rescued books.",
    "spoilerStatus": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 1000,
      "spoilerType": "FUTURE_REVEAL"
    },
    "popularity": {
      "discussionThreads": 50,
      "upvotes": 5000
    },
    "tags": ["saul", "survival-theory", "confirmed", "ohara", "aokiji"]
  },
  {
    "id": "theory-ep278-002",
    "title": "Kuzan's True Motivation: Testing the World Government's Lies",
    "theory": "A theory suggests that Kuzan let Robin escape Ohara not just out of respect for Saul, but as an experiment to test whether the World Government was lying about the scholars being evil. By witnessing Akainu's brutal destruction of the civilian evacuation ship and the government's extreme measures, Kuzan began to question the absolute justice he was taught. Allowing Robin to live was his way of seeing if the government's narrative about Ohara was truthful - if Robin grew up to be the 'demon' they claimed, or if she would prove the scholars were just seeking knowledge.",
    "author": "One Piece Theory Community",
    "platform": "Reddit/Discussion Forums",
    "url": "https://gamerant.com/one-piece-kuzan-motivation/",
    "publishDate": "2022-01-01",
    "episodesSpanned": [278, 227, 228, 229],
    "minEpisode": 227,
    "status": "UNCONFIRMED",
    "spoilerStatus": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 650,
      "spoilerType": "CHARACTER_MOTIVATION"
    },
    "popularity": {
      "discussionThreads": 30,
      "upvotes": 2000
    },
    "tags": ["kuzan", "aokiji", "motivation", "world-government", "ohara"]
  },
  {
    "id": "theory-ep278-003",
    "title": "Aokiji and SWORD: The Long Game Since Ohara",
    "theory": "This theory proposes that Kuzan's decision to let Robin escape in Episode 278 was the beginning of his doubts about the Marines' absolute justice, which eventually led him to secretly join SWORD (the secret Marine faction). The shock of witnessing Akainu's brutality at Ohara planted the seeds of his eventual defection. Some theorists suggest that his later actions - including his current alliance with Blackbeard - are all part of fulfilling Saul's will and gathering information to understand the true history, just as Robin seeks.",
    "author": "One Piece Theory Community",
    "platform": "Reddit/Forums",
    "url": "https://www.cbr.com/one-piece-chapter-1066-why-aokiji-saved-saul/",
    "publishDate": "2023-01-01",
    "episodesSpanned": [278, 227, 228, 229, 574, 650],
    "minEpisode": 227,
    "status": "UNCONFIRMED",
    "spoilerStatus": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 1100,
      "spoilerType": "FUTURE_PLOT"
    },
    "popularity": {
      "discussionThreads": 100,
      "upvotes": 8000
    },
    "tags": ["kuzan", "aokiji", "sword", "blackbeard", "long-term-planning", "saul"]
  },
  {
    "id": "theory-ep278-004",
    "title": "The D. Will Connection: Why Saul's Words Mattered to Kuzan",
    "theory": "This theory explores why Kuzan was so affected by Saul's final words in Episode 278. Both Saul and Robin carry the 'D.' initial, which represents the 'Will of D.' - the natural enemies of the Gods (Celestial Dragons). Some fans theorize that Kuzan understood on some level that Saul's conviction about Robin finding friends who would protect her was connected to a larger destiny involving the D. clan. By honoring Saul's wish and letting Robin escape, Kuzan unknowingly set in motion events that would eventually lead to the Straw Hats declaring war on the World Government - exactly fulfilling Saul's prophecy.",
    "author": "One Piece Lore Theorists",
    "platform": "Reddit",
    "url": "https://www.tumblr.com/megashadowdragon/693781431996055552/one-piece-theory-aokijis-future-role-the-lost",
    "publishDate": "2021-01-01",
    "episodesSpanned": [278, 312],
    "minEpisode": 278,
    "status": "PARTIALLY_CONFIRMED",
    "confirmationDetails": "The prophecy about Robin finding friends came true in Episode 278 when the Straw Hats fought for her. The D. clan significance has been partially revealed but not fully confirmed.",
    "spoilerStatus": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 1000,
      "spoilerType": "LORE_SPECULATION"
    },
    "popularity": {
      "discussionThreads": 75,
      "upvotes": 6000
    },
    "tags": ["will-of-d", "saul", "kuzan", "prophecy", "destiny", "robin"]
  },
  {
    "id": "theory-ep278-005",
    "title": "Akainu's Philosophy Established: The Birth of Absolute Justice's Dark Side",
    "theory": "Episode 278 marks Sakazuki's first appearance and establishes his extreme philosophy of absolute justice. Fans have theorized that this specific event - ordering the destruction of a civilian ship - was the defining moment that shaped Akainu into the ruthless Fleet Admiral he would become. The theory suggests that Akainu sees this decision as validation that he was 'right' because Robin survived and later became a wanted criminal. This creates a self-fulfilling prophecy where his paranoid actions actually create the threats he fears, but he interprets it as proof his extreme measures were justified all along.",
    "author": "One Piece Character Analysis Community",
    "platform": "Reddit/Forums",
    "url": "https://screenrant.com/one-piece-anime-worst-trope-fake-deaths-op-ed/",
    "publishDate": "2023-01-01",
    "episodesSpanned": [278, 483, 573, 574],
    "minEpisode": 278,
    "status": "SUPPORTED_BY_CANON",
    "confirmationDetails": "Akainu's consistent characterization throughout the series supports this theory. His actions at Marineford and later as Fleet Admiral align with the absolute justice philosophy first shown in Episode 278.",
    "spoilerStatus": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 600,
      "spoilerType": "CHARACTER_DEVELOPMENT"
    },
    "popularity": {
      "discussionThreads": 40,
      "upvotes": 3500
    },
    "tags": ["akainu", "sakazuki", "absolute-justice", "philosophy", "character-study"]
  }
]
