[
  {
    "abilityName": "Gomu Gomu no Hook",
    "abilityType": "DEVIL_FRUIT_TECHNIQUE",
    "user": "luffy",
    "debutEpisode": 218,
    "debutChapter": 315,
    "episodeAppearances": [218],
    "devilFruitRequired": "gomu-gomu-no-mi",
    "description": "Luffy delivers a powerful hooking punch using his rubber arm, adding a curved trajectory to his basic punching attacks. This variation allows him to surprise opponents by attacking from unexpected angles.",
    "firstUseContext": "Used against Foxy after Luffy distracts him by insulting his split-head appearance, taking advantage of Foxy's emotional weakness to land a clean hit.",
    "strengths": [
      "Curved trajectory makes it harder to dodge",
      "Can attack from angles opponents don't expect",
      "Maintains Luffy's signature stretching power"
    ],
    "weaknesses": [],
    "variations": []
  },
  {
    "abilityName": "Foxy Shichihenge",
    "abilityType": "TECHNIQUE",
    "user": "foxy",
    "debutEpisode": 218,
    "debutChapter": 315,
    "episodeAppearances": [218],
    "devilFruitRequired": null,
    "description": "Foxy's Seven Transformations technique where he rapidly changes disguises including nurse and chef costumes, combining them with wooden replicas to create layers of deception and misdirection.",
    "firstUseContext": "Used to confuse Luffy in the combat arena by creating multiple fake Foxys with disguises and smoke to obscure which is the real target.",
    "strengths": [
      "Creates confusion about which target is real",
      "Works well in combination with smoke and other visual obstructions",
      "Allows Foxy to attack while opponent is confused"
    ],
    "weaknesses": [
      "Vulnerable to area-of-effect attacks",
      "Loses effectiveness if opponent can identify the real Foxy",
      "Requires preparation time to set up replicas"
    ],
    "variations": []
  },
  {
    "abilityName": "Counter Fox Blow",
    "abilityType": "PHYSICAL_TECHNIQUE",
    "user": "foxy",
    "debutEpisode": 218,
    "debutChapter": 315,
    "episodeAppearances": [218],
    "devilFruitRequired": null,
    "description": "A physical close-range counterattack that Foxy uses when opponents get too close. This demonstrates that Foxy has some hand-to-hand combat abilities beyond just his Devil Fruit powers.",
    "firstUseContext": "Used against Luffy when he closes in for melee combat, showing that Foxy can defend himself even without using his Noro Noro Beam.",
    "strengths": [
      "Provides close-range defense option",
      "Can be used when Devil Fruit powers are not viable",
      "Quick execution"
    ],
    "weaknesses": [
      "Requires opponent to be in close range",
      "Less effective than his Devil Fruit abilities",
      "Limited power compared to his other attacks"
    ],
    "variations": []
  },
  {
    "abilityName": "Mirror Racket",
    "abilityType": "DEVIL_FRUIT_TECHNIQUE",
    "user": "foxy",
    "debutEpisode": 218,
    "debutChapter": 316,
    "episodeAppearances": [218],
    "devilFruitRequired": "noro-noro-no-mi",
    "description": "Using a special racket, Foxy can reflect and redirect his Noro Noro Beams off mirrors and other reflective surfaces, allowing the slow beams to bounce around enclosed spaces and attack from multiple angles.",
    "firstUseContext": "Introduced in Foxy's mirror room where he uses it to bounce Noro Noro Beams off all the mirrored walls, creating an omnidirectional slow beam assault.",
    "strengths": [
      "Makes slow beams nearly impossible to dodge in enclosed spaces",
      "Allows attacking from multiple angles simultaneously",
      "Combines Devil Fruit power with environmental advantages"
    ],
    "weaknesses": [
      "Requires mirrors or reflective surfaces",
      "Beams can potentially be reflected back at Foxy",
      "Limited to specific prepared environments"
    ],
    "variations": ["Noro Marble Oni Coach"]
  },
  {
    "abilityName": "Noro Marble Oni Coach",
    "abilityType": "DEVIL_FRUIT_TECHNIQUE",
    "user": "foxy",
    "debutEpisode": 218,
    "debutChapter": 316,
    "episodeAppearances": [218],
    "devilFruitRequired": "noro-noro-no-mi",
    "description": "Foxy's ultimate technique combining the Mirror Racket with a chamber of mirrors and the Gorilla Puncher 13. Noro Noro Beams bounce infinitely off mirrors in all directions while the mechanical fists assault the slowed opponent. This represents the peak combination of Foxy's Devil Fruit powers and mechanical weapons.",
    "firstUseContext": "Used as Foxy's final strategy against Luffy in the special mirror room, combining environmental control, Devil Fruit mastery, and mechanical assault.",
    "strengths": [
      "Nearly impossible to dodge the reflected beams",
      "Combines slowing effect with mechanical assault",
      "Forces opponent into purely defensive position",
      "Demonstrates masterful use of preparation and Devil Fruit synergy"
    ],
    "weaknesses": [
      "Requires very specific prepared environment (mirror room with Gorilla Puncher)",
      "Once mirrors are broken, technique becomes ineffective",
      "Foxy himself can be hit by reflected beams",
      "Immobile technique tied to one location"
    ],
    "variations": []
  },
  {
    "abilityName": "Noro Noro Beam Sword",
    "abilityType": "DEVIL_FRUIT_TECHNIQUE",
    "user": "foxy",
    "debutEpisode": 218,
    "debutChapter": 316,
    "episodeAppearances": [218],
    "devilFruitRequired": "noro-noro-no-mi",
    "description": "Foxy creates a whip-like sword made entirely of Noro Noro photons using a wooden hilt as a base. Unlike his regular beam, this can slow down and bind specific body parts rather than slowing the entire target, creating shackles of slow energy that restrict limb movement.",
    "firstUseContext": "Used to bind Luffy's limbs individually in the mirror room, demonstrating advanced control over the shape and application of his Devil Fruit powers.",
    "strengths": [
      "Can target specific body parts rather than whole body",
      "Creates binding effect in addition to slowing",
      "Shows advanced Devil Fruit control and shaping",
      "More precise than regular beam attacks"
    ],
    "weaknesses": [
      "Requires maintaining the sword form",
      "Still limited by 30-second duration",
      "Can potentially be reflected like regular beams",
      "Requires close-to-medium range"
    ],
    "variations": []
  },
  {
    "abilityName": "Gorilla Punch Golden Hits",
    "abilityType": "WEAPON_TECHNIQUE",
    "user": "foxy",
    "debutEpisode": 218,
    "debutChapter": 316,
    "episodeAppearances": [218],
    "devilFruitRequired": null,
    "description": "Enhanced version of the Gorilla Puncher 13's normal attacks, launching even more powerful burning punches at higher speed. The 'Golden' designation suggests this is the maximum power setting of the mechanical weapon.",
    "firstUseContext": "Activated in the mirror room while Luffy is slowed by Noro Noro Beams, creating a devastating combination of being unable to dodge while facing overwhelming mechanical assault.",
    "strengths": [
      "Extremely powerful burning punches",
      "High rate of fire",
      "Even more devastating when combined with Noro Noro Beam slowing",
      "Can defeat sea monsters according to Foxy"
    ],
    "weaknesses": [
      "Tied to the Gorilla Puncher 13 machine location",
      "Requires the machine to be operational",
      "Predictable attack pattern from fixed position",
      "Can be disabled if machine is damaged"
    ],
    "variations": []
  }
]
