[
  {
    "name": {
      "english": "Slow-Slow Fruit",
      "japanese": "ノロノロの実",
      "romanized": "Noro Noro no Mi"
    },
    "debutEpisode": 207,
    "debutChapter": 309,
    "episodeAppearances": [218],
    "type": "PARAMECIA",
    "currentUser": "foxy",
    "previousUsers": [],
    "abilities": [
      {
        "abilityName": "Mirror Racket",
        "episodeFirstUsed": 218,
        "description": "Using a special racket, the user can reflect their Noro Noro Beams off mirrors and other reflective surfaces, allowing the beams to bounce around enclosed spaces.",
        "firstUseContext": "Foxy uses this ability in his mirror room to create omnidirectional slow beams that are nearly impossible to dodge."
      },
      {
        "abilityName": "Noro Marble Oni Coach",
        "episodeFirstUsed": 218,
        "description": "Foxy's ultimate technique combining the Mirror Racket with a chamber of mirrors and the Gorilla Puncher 13, creating a multi-directional assault of slow beams and mechanical punches.",
        "firstUseContext": "Used as Foxy's final strategy against Luffy in the mirror room, representing the peak combination of his Devil Fruit powers and mechanical weapons."
      },
      {
        "abilityName": "Noro Noro Beam Sword",
        "episodeFirstUsed": 218,
        "description": "The user creates a whip-like sword made of Noro Noro photons using a wooden hilt as a base. Unlike the regular beam, this can slow down specific body parts and create binding shackles of slow energy.",
        "firstUseContext": "Foxy forms this weapon to bind Luffy's limbs individually rather than slowing his entire body, showing advanced control over the fruit's powers."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Reflective surfaces",
        "episodeRevealed": 218,
        "description": "The Noro Noro Beams can be reflected using mirrors or similar reflective surfaces. While Foxy uses this property to his advantage, it also means the user is not immune to their own reflected beams.",
        "severity": "MAJOR"
      }
    ],
    "reveals": [
      {
        "infoType": "ABILITY",
        "information": "The Noro Noro no Mi's photon beams can be shaped and controlled beyond simple beam projection, allowing the user to create weapons like swords made of slow energy.",
        "episodeRevealed": 218,
        "severity": "MINOR"
      }
    ]
  },
  {
    "name": {
      "english": "Gum-Gum Fruit",
      "japanese": "ゴムゴムの実",
      "romanized": "Gomu Gomu no Mi"
    },
    "debutEpisode": 1,
    "debutChapter": 1,
    "episodeAppearances": [218],
    "type": "PARAMECIA",
    "currentUser": "luffy",
    "previousUsers": [],
    "abilities": [
      {
        "abilityName": "Gomu Gomu no Hook",
        "episodeFirstUsed": 218,
        "description": "Luffy delivers a powerful hooking punch using his rubber arm, adding a curved trajectory to his basic punching attacks.",
        "firstUseContext": "Used against Foxy after Luffy distracts him by insulting his appearance, taking advantage of Foxy's emotional weakness."
      }
    ],
    "weaknesses": [],
    "reveals": [
      {
        "infoType": "ABILITY",
        "information": "Luffy's rubber body provides natural resistance to explosive attacks like Foxy's Face Bombs, demonstrating defensive applications beyond the offensive stretching abilities.",
        "episodeRevealed": 218,
        "severity": "MINOR"
      }
    ]
  }
]
