[
  {
    "id": "gomu-gomu-no-mi",
    "name": {
      "english": "Gum-Gum Fruit",
      "japanese": "ゴムゴムの実",
      "romanized": "Gomu Gomu no Mi"
    },
    "type": "PARAMECIA",
    "description": "Grants the user's body the properties of rubber, allowing them to stretch and become immune to blunt attacks and electricity.",
    "episodeAppearances": [372],
    "users": [
      {
        "characterId": "luffy",
        "episodeStart": 372,
        "episodeEnd": "present",
        "circumstances": "Luffy uses enhanced versions of his Devil Fruit techniques while in Nightmare form"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Enhanced Gomu Gomu no Pistol (Nightmare Form)",
        "episodeRevealed": 372,
        "description": "While in Nightmare Luffy form, the Gomu Gomu no Pistol is powerful enough to send Gecko Moria, a Warlord of the Sea, flying through the air.",
        "severity": "MAJOR",
        "firstUseContext": "Nightmare Luffy catches the fleeing Moria and punches him with devastating force."
      },
      {
        "abilityName": "Enhanced Gomu Gomu no Storm (Nightmare Form)",
        "episodeRevealed": 372,
        "description": "The signature rapid-fire punch barrage is amplified by the power of 100 shadows, capable of sending the massive zombie Oars flying.",
        "severity": "CRITICAL",
        "firstUseContext": "Nightmare Luffy uses Gomu Gomu no Balloon to dodge, then untwists his body to unleash a devastating Storm attack on Oars."
      },
      {
        "abilityName": "One-Handed Block (Nightmare Form)",
        "episodeRevealed": 372,
        "description": "Nightmare Luffy effortlessly blocks Oars' Gomu Gomu no Rifle with a single hand, showcasing the dramatic strength increase.",
        "severity": "MAJOR",
        "firstUseContext": "Demonstrates the power gap between Nightmare Luffy and Oars who possesses a copy of Luffy's abilities."
      }
    ],
    "weaknesses": [],
    "strengths": [
      {
        "strength": "Techniques can be dramatically enhanced when combined with shadow absorption",
        "episodeRevealed": 372,
        "description": "The 100 shadows absorbed in Nightmare form multiply the power of Gomu Gomu techniques to devastating effect.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "COMMON",
    "powerTier": "HIGH"
  },
  {
    "id": "kage-kage-no-mi",
    "name": {
      "english": "Shadow-Shadow Fruit",
      "japanese": "カゲカゲの実",
      "romanized": "Kage Kage no Mi"
    },
    "type": "PARAMECIA",
    "description": "Allows the user to manifest and control shadows, steal them from others, and implant them into corpses to create zombies or living beings to enhance their strength.",
    "episodeAppearances": [372],
    "users": [
      {
        "characterId": "gecko-moria",
        "episodeStart": 372,
        "episodeEnd": "present",
        "circumstances": "Moria uses his shadow manipulation abilities to defend against the Straw Hats and control Oars"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Remote Shadow Interception",
        "episodeRevealed": 372,
        "description": "Moria's shadow can move independently to intercept attacks, as demonstrated when it catches and destroys the salt meant for Oars.",
        "severity": "MAJOR",
        "firstUseContext": "When Usopp shoots salt into Oars' mouth, Moria's shadow catches it mid-air and throws it away, breaking the bag."
      },
      {
        "abilityName": "Shadow Enhancement (100 Shadows)",
        "episodeRevealed": 372,
        "description": "The Kage Kage no Mi's power allows implanting multiple shadows into a single person, with Luffy containing 100 shadows to become Nightmare Luffy.",
        "severity": "CRITICAL",
        "firstUseContext": "The Rolling Pirates use shadows previously stolen by Moria to power up Luffy into his Nightmare form, though this is using shadows against Moria's will."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Shadows can be used against the user if freed from their control",
        "episodeRevealed": 372,
        "severity": "MAJOR"
      }
    ],
    "strengths": [],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "HIGH"
  }
]
