[
  {
    "id": "theory-ep372-001",
    "title": "Thriller Bark is a Fragment of God Valley",
    "summary": "Theory that Thriller Bark's island base is actually one of the fragments of God Valley after the legendary God Valley Incident, connecting it to the Rocks Pirates and ancient history.",
    "fullText": "Fans have theorized that Thriller Bark is connected to God Valley, as both locations are tied to the West Blue. The theory suggests that the island serving as Thriller Bark's main quarters is actually one of the fragments of God Valley after the legendary incident. Supporting evidence includes Captain John, a zombie on Thriller Bark, who was revealed to be a high-ranking member of the Rocks Pirates present during the God Valley Incident. This would explain why Moria chose this particular island for his base and add deeper significance to the Thriller Bark arc.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://gamerant.com/one-piece-god-valley-foreshadowed-over-a-decade-ago/",
      "title": "'Only Oda Can Do This': One Piece Fans Think God Valley Was Foreshadowed Over A Decade Ago",
      "platform": "GameRant",
      "accessedAt": "2025-11-30"
    },
    "postedDate": "2024-01-01",
    "episodeRange": [337, 381],
    "minEpisode": 337,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1000
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["gecko-moria", "captain-john"],
    "relatedLocations": ["thriller-bark", "god-valley"],
    "relatedEvents": [],
    "tags": ["thriller-bark", "god-valley", "rocks-pirates", "ancient-history", "foreshadowing"]
  },
  {
    "id": "theory-ep372-002",
    "title": "The Florian Triangle Creature Connection to Ancient Giants",
    "summary": "Theory that the mysterious creatures in the Florian Triangle mist seen during the Thriller Bark arc are connected to ancient giants, possibly related to Oars' original species.",
    "fullText": "During the Thriller Bark arc, mysterious massive shadows appear in the Florian Triangle mist. Fans theorize these creatures may be ancient giants related to Oars' species. The theory suggests connections to various One Piece mysteries including Davy Jones lore, the character Imu, and the ancient history of giants in the One Piece world. The presence of Oars, an ancient giant zombie, in the same location as these mysterious creatures may not be coincidental, potentially hinting at Gecko Moria's knowledge of ancient giant history.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://thrillerbark.com/forums/onepiece/",
      "title": "One Piece Discussion - Thriller Bark Forums",
      "platform": "Thriller Bark Forums",
      "accessedAt": "2025-11-30"
    },
    "postedDate": "2020-01-01",
    "episodeRange": [337, 381],
    "minEpisode": 337,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 900
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["oars", "gecko-moria"],
    "relatedLocations": ["thriller-bark", "florian-triangle"],
    "relatedEvents": [],
    "tags": ["florian-triangle", "ancient-giants", "oars", "mystery", "world-building"]
  },
  {
    "id": "theory-ep372-003",
    "title": "Nightmare Luffy Foreshadows Gear 4",
    "summary": "Theory that Nightmare Luffy's visual design and power-up nature foreshadowed the eventual development of Gear 4, with similarities in appearance changes and temporary power boosts.",
    "fullText": "Fans have noted striking similarities between Nightmare Luffy and Gear 4, both featuring dramatic physical transformations, pale/different colored skin tones, bulkier physiques, and immense power increases with time limitations. Some theorize that Oda used Nightmare Luffy as a test concept for what would eventually become Gear 4, or that Luffy's experience with the overwhelming power of 100 shadows influenced his later development of advanced techniques. Both forms show Luffy with enhanced strength far beyond his normal capabilities and both have strict time limits before exhaustion.",
    "author": "One Piece Theory Fans",
    "source": {
      "url": "https://www.reddit.com/r/OnePiece/",
      "title": "One Piece Subreddit Discussions",
      "platform": "Reddit",
      "accessedAt": "2025-11-30"
    },
    "postedDate": "2019-01-01",
    "episodeRange": [372, 733],
    "minEpisode": 372,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 733
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["luffy"],
    "relatedLocations": [],
    "relatedEvents": ["ep372-event-005", "ep372-event-006"],
    "tags": ["nightmare-luffy", "gear-4", "foreshadowing", "power-ups", "transformation"]
  }
]
