[
  {
    "id": "theory-ep068-001",
    "title": "Koby Will Become Luffy's Garp",
    "summary": "A popular theory that Koby will become to Luffy what Garp was to Gol D. Roger - a Marine rival who respects and pursues the Pirate King throughout his journey.",
    "fullText": "Based on the parallel between Garp's relationship with Roger and Koby's relationship with Luffy, fans theorize that Koby is being set up as Luffy's Marine counterpart. Just as Garp was Roger's rival and the Marine who cornered him multiple times, Koby will grow to become a powerful Marine who can stand as Luffy's equal. Episode 68 marks the beginning of this parallel by showing Garp taking Koby under his wing, just as Koby started his journey after meeting Luffy. The theory suggests that by the end of the series, Koby will be one of the strongest Marines and will have a relationship with Luffy similar to the respect Garp and Roger shared.",
    "author": "One Piece Community (r/OnePiece)",
    "source": {
      "url": "https://www.reddit.com/r/OnePiece/",
      "title": "Koby as Luffy's Garp - Community Theory",
      "platform": "Reddit",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2015-01-01",
    "episodeRange": [1, 1100],
    "minEpisode": 68,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": 5000,
      "comments": 1200,
      "shares": 300
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["koby", "luffy", "garp"],
    "relatedLocations": [],
    "relatedEvents": ["ep068-event-013"],
    "tags": ["koby", "luffy", "garp", "parallel", "endgame", "marines"]
  },
  {
    "id": "theory-ep068-002",
    "title": "Helmeppo Will Become Koby's Zoro",
    "summary": "Theory that Helmeppo's relationship with Koby mirrors Zoro's relationship with Luffy, suggesting Helmeppo will become a powerful Marine swordsman and Koby's right-hand man.",
    "fullText": "Fans have noted parallels between the Luffy-Zoro dynamic and the Koby-Helmeppo relationship. Just as Zoro is Luffy's first crew member and right-hand swordsman, Helmeppo is Koby's first friend in the Marines and uses a sword. The theory suggests that as Koby rises through Marine ranks to eventually rival Luffy, Helmeppo will grow proportionally strong to rival Zoro. Episode 68 reinforces this by showing both entering Garp's training together, similar to how Luffy and Zoro began their journey together. The databook describes both as 'promising individuals,' supporting the theory that they're being set up as Marine counterparts to the Straw Hat Pirates' captain and first mate.",
    "author": "Worstgen Forums",
    "source": {
      "url": "https://worstgen.alwaysdata.net/forum/threads/why-people-deny-the-fact-that-helmeppo-and-koby-will-be-rivals-for-zoro-and-luffy.14874/",
      "title": "Why People Deny the Fact That Helmeppo and Koby Will Be Rivals for Zoro and Luffy?",
      "platform": "Worstgen",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2021-01-01",
    "episodeRange": [1, 1100],
    "minEpisode": 68,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": 234,
      "comments": 89,
      "shares": 12
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["helmeppo", "koby", "zoro", "luffy"],
    "relatedLocations": [],
    "relatedEvents": ["ep068-event-013"],
    "tags": ["helmeppo", "koby", "zoro", "luffy", "parallel", "rivalry"]
  },
  {
    "id": "theory-ep068-003",
    "title": "Bogard's Hidden Power Level",
    "summary": "Theory that Bogard, despite his minimal screen time, is incredibly powerful - potentially Admiral level or higher - based on his position as Garp's right-hand man.",
    "fullText": "Bogard's mysterious nature and role as Garp's trusted subordinate has led fans to theorize about his true power level. The theory posits that for someone to be Garp the Fist's right-hand man, they would need to be extraordinarily powerful. Some fans speculate Bogard could be Admiral level or even stronger, but chooses to remain a lower rank to stay with Garp. His katana suggests he's a swordsman, leading to theories that he might be one of the strongest swordsmen in the world. The fact that Oda has kept Bogard largely mysterious despite his early introduction in Episode 68 suggests he may have a significant role to play later in the series. The theory gained more traction after his appearance in recent manga chapters showed him still active alongside Garp.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://screenrant.com/one-piece-bogard-biggest-mystery/",
      "title": "One Piece's Biggest Mystery Has Nothing To Do With The Final Treasure",
      "platform": "Screen Rant",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2023-01-01",
    "episodeRange": [68, 1100],
    "minEpisode": 68,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": 3400,
      "comments": 567,
      "shares": 145
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["bogard", "garp"],
    "relatedLocations": [],
    "relatedEvents": ["ep068-event-009"],
    "tags": ["bogard", "power-level", "mystery", "swordsman", "garp"]
  },
  {
    "id": "theory-ep068-004",
    "title": "Koby's Extreme Training Foreshadows Haki Mastery",
    "summary": "Theory that Koby's dedication to training 100-200 times harder than others (mentioned in connection to this arc) foreshadows his eventual mastery of advanced Haki.",
    "fullText": "In discussions about the Diary of Koby-Meppo arc, it's revealed that Koby trains extraordinarily hard - believing he must train 100-200 times more than others because he started as weaker than average. Fans theorize this intense dedication, combined with Garp's training starting in Episode 68, is why Koby develops powerful Observation Haki relatively quickly compared to other characters. The theory suggests that Koby's Haki awakening during the Marineford War is a direct result of this extreme training regimen that began when Garp recruited him. Some extend this theory to predict Koby will eventually master advanced Conqueror's Haki, as his determination and willpower match that of Luffy and other Conqueror's Haki users.",
    "author": "One Piece Fans",
    "source": {
      "url": "https://gamerant.com/one-piece-koby-honesty-impact-explained/",
      "title": "One Piece: Koby's Honesty Impact, Explained",
      "platform": "Game Rant",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2024-01-01",
    "episodeRange": [68, 1100],
    "minEpisode": 68,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": 2100,
      "comments": 445,
      "shares": 89
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["koby", "garp"],
    "relatedLocations": [],
    "relatedEvents": ["ep068-event-013"],
    "tags": ["koby", "haki", "training", "observation-haki", "power-growth"]
  }
]
