[
  {
    "name": {
      "english": "Shadow-Shadow Fruit",
      "japanese": "カゲカゲの実",
      "romanized": "Kage Kage no Mi"
    },
    "debutEpisode": 343,
    "debutChapter": 449,
    "episodeAppearances": [346],
    "type": "PARAMECIA",
    "currentUser": "gecko-moria",
    "previousUsers": [],
    "keyMoments": [
      {
        "episodeNumber": 346,
        "eventId": "ep346-event-003",
        "momentType": "POWER_REVEAL",
        "title": "Shadow Abilities Transfer Completely",
        "description": "Jigoro demonstrates that implanting a shadow into a zombie transfers not just the original person's strength, but their complete fighting techniques and some personality traits.",
        "significance": "Reveals the true extent and horror of the Kage Kage no Mi's power - victims lose their shadows and their abilities are weaponized against them.",
        "timestamp": "08:15"
      },
      {
        "episodeNumber": 346,
        "eventId": "ep346-event-011",
        "momentType": "WORLD_LORE",
        "title": "General Zombies System Explained",
        "description": "The episode reveals how Moria creates General Zombies by combining legendary warriors' corpses with shadows from powerful living individuals, creating elite undead soldiers.",
        "significance": "Explains the strategic application of the Kage Kage no Mi's power in creating a powerful army.",
        "timestamp": "20:15"
      }
    ],
    "abilities": [
      {
        "abilityName": "Shadow Extraction",
        "description": "The user can extract and manipulate the shadows of living beings. Those who lose their shadow will be vaporized if exposed to sunlight.",
        "episodeFirstUsed": 343
      },
      {
        "abilityName": "Shadow Implantation",
        "description": "Extracted shadows can be implanted into corpses to create zombies. The zombie gains the fighting abilities, techniques, and some personality traits of the shadow's original owner.",
        "episodeFirstUsed": 343
      },
      {
        "abilityName": "Shadow Transfer Effects",
        "description": "When a shadow is implanted into a zombie, all of the original person's combat skills, techniques, and fighting instincts transfer completely, as demonstrated by Jigoro using Zoro's sword techniques.",
        "episodeFirstUsed": 346
      }
    ],
    "weaknesses": [
      {
        "weakness": "Salt",
        "description": "Salt can purify zombies created with this power, forcing the shadow out of the body and returning it to its original owner.",
        "episodeRevealed": 345
      },
      {
        "weakness": "Standard Devil Fruit Weaknesses",
        "description": "The user cannot swim and is weakened by seawater and Seastone.",
        "episodeRevealed": 343
      }
    ],
    "userHistory": [
      {
        "userId": "gecko-moria",
        "acquisitionEpisode": null,
        "lossEpisode": null,
        "status": "CURRENT_USER"
      }
    ]
  }
]
