[
  {
    "theoryTitle": "Zoro's Shadow Was Never Defeated",
    "theoryText": "Some fans theorize that Zoro's shadow, as embodied in Jigoro, was the only shadow in Thriller Bark that was never actually defeated in combat. Unlike the other shadows that were beaten by the Straw Hats, Jigoro was only stopped when Gecko Moria withdrew all shadows from his zombies to empower himself during the final battle. This suggests that Zoro's fighting spirit and abilities were so strong that even when transferred to a zombie, they remained unbeatable.",
    "theorist": "Worstgen Forum Community",
    "source": {
      "url": "https://worstgen.alwaysdata.net/forum/threads/was-zoros-shadow-in-thriller-bark-the-only-one-thats-never-beaten.46525/",
      "platform": "Worstgen Forum",
      "publishDate": null
    },
    "episodesReferenced": [346, 347, 362, 377],
    "status": "SPECULATIVE",
    "popularity": "MODERATE",
    "containsSpoilers": true,
    "spoilerEpisodes": [362, 377],
    "relatedCharacters": ["jigoro", "roronoa-zoro", "gecko-moria"],
    "tags": ["thriller-bark", "jigoro", "zoro", "shadows", "combat-ability"]
  },
  {
    "theoryTitle": "Moria's Shadow Selection Strategy Based on Bounties",
    "theoryText": "Fans have theorized and canon has confirmed that Gecko Moria strategically matches shadows to corpses based on bounty amounts and perceived power levels. Higher bounty pirates like Zoro get placed into General Zombie bodies (legendary warriors), while lower or no-bounty individuals are placed into weaker zombie bodies. This explains why Jigoro, who contains Zoro's shadow, is a General Zombie inhabiting the body of a legendary swordsman who killed 7,000 pirates. The theory suggests Moria has a systematic approach to maximizing his army's combat effectiveness by pairing strong shadows with strong corpses.",
    "theorist": "One Piece Fan Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Zombies",
      "platform": "One Piece Wiki",
      "publishDate": null
    },
    "episodesReferenced": [343, 344, 345, 346],
    "status": "CANON_SUPPORTED",
    "popularity": "HIGH",
    "containsSpoilers": true,
    "spoilerEpisodes": [362],
    "relatedCharacters": ["gecko-moria", "jigoro", "roronoa-zoro", "tararan"],
    "tags": ["thriller-bark", "moria-strategy", "shadow-system", "power-scaling"]
  },
  {
    "theoryTitle": "Shadow Personality Retention and Fade Theory",
    "theoryText": "A popular discussion among fans questions why some zombies retain personality traits from their shadows longer than others. The theory suggests that the strength of the original shadow owner's will and personality determines how long those traits persist in the zombie. Strong-willed individuals like Zoro maintain their personality traits (like his sense of honor about wounds on one's back) in their zombie counterparts longer, while weaker personalities fade quickly and the zombie becomes purely obedient to Moria. This is demonstrated when Jigoro initially shows Zoro's pride but eventually becomes completely subservient to orders.",
    "theorist": "Quora One Piece Discussion Community",
    "source": {
      "url": "https://www.quora.com/In-One-Piece-during-the-Thriller-Bark-arc-why-did-Brooks-zombie-retain-his-personality-for-5-years-while-the-rest-of-the-crews-personalities-began-to-fade-from-their-zombie-counterparts-after-only-a-few-hours",
      "platform": "Quora",
      "publishDate": null
    },
    "episodesReferenced": [346, 347, 348],
    "status": "SPECULATIVE",
    "popularity": "MODERATE",
    "containsSpoilers": true,
    "spoilerEpisodes": [350, 362],
    "relatedCharacters": ["jigoro", "roronoa-zoro", "gecko-moria", "ryuma"],
    "tags": ["thriller-bark", "shadow-mechanics", "personality", "willpower"]
  },
  {
    "theoryTitle": "Jigoro and Inuppe's Instant Rivalry Reflects Zoro and Sanji",
    "theoryText": "Fans noticed and discussed how Jigoro (with Zoro's shadow) and Inuppe (with Sanji's shadow) immediately began fighting each other upon meeting, despite being on the same side. This perfectly mirrors the constant rivalry and bickering between Zoro and Sanji. The theory proposes that shadows don't just transfer combat abilities, but also deep-seated relationships and rivalries. The zombies acted out the Zoro-Sanji dynamic without conscious understanding, suggesting that shadow transfer includes subconscious emotional patterns and interpersonal dynamics.",
    "theorist": "One Piece Fan Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Jigoro",
      "platform": "One Piece Wiki",
      "publishDate": null
    },
    "episodesReferenced": [346, 347, 348],
    "status": "CANON_CONFIRMED",
    "popularity": "HIGH",
    "containsSpoilers": false,
    "spoilerEpisodes": [],
    "relatedCharacters": ["jigoro", "inuppe", "roronoa-zoro", "sanji"],
    "tags": ["thriller-bark", "shadow-mechanics", "zoro-sanji-rivalry", "character-relationships"]
  },
  {
    "theoryTitle": "General Zombies Contain Rocks Pirates Members",
    "theoryText": "A theory that emerged from careful analysis suggests that three of the General Zombies were created from the corpses of members of the infamous Rocks Pirates crew. According to information revealed by Buhichuck, General Zombies are built from the corpses of renowned and strong warriors, and some fans believe Moria specifically collected bodies from the Rocks Pirates after their defeat. If true, this would make the General Zombies even more dangerous, as they combine legendary pirate bodies with powerful modern shadows. This theory gained traction after later revelations about the Rocks Pirates' strength and influence.",
    "theorist": "One Piece Theory Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Zombies",
      "platform": "One Piece Wiki",
      "publishDate": null
    },
    "episodesReferenced": [346],
    "status": "UNCONFIRMED",
    "popularity": "MODERATE",
    "containsSpoilers": true,
    "spoilerEpisodes": [957, 958],
    "relatedCharacters": ["gecko-moria", "jigoro", "tararan"],
    "tags": ["thriller-bark", "general-zombies", "rocks-pirates", "world-lore", "speculation"]
  }
]
