[
  {
    "theoryTitle": "Wyper's Inherited Trauma as Foreshadowing for Generational Conflict Themes",
    "theoryText": "Wyper's portrayal as carrying 'four hundred years of hate' in Episode 177 establishes one of One Piece's major recurring themes - how historical injustices and trauma are passed down through generations. This concept, introduced through the Shandian displacement, would later be explored with the Fishmen (slavery and discrimination), Wano (Kozuki clan persecution), and the Void Century mystery itself. Wyper's character serves as the first clear embodiment of how inherited rage can both drive justice-seeking and lead to self-destructive behavior, a nuance Oda would develop further in later arcs.",
    "author": "Multiple One Piece analysts and Tumblr bloggers",
    "sourceUrl": "https://neverwatchedonepiece.tumblr.com/post/113113358854/177-the-ordeal-of-iron-white-barbed-death",
    "dateProposed": "2015-03-01",
    "platform": "Tumblr",
    "episodeStart": 177,
    "episodeEnd": null,
    "affectedCharacters": ["wyper", "luffy", "robin"],
    "affectedLocations": ["upper-yard"],
    "theoryStatus": "SUPPORTED",
    "containsSpoilers": true,
    "spoilerSeverity": "MAJOR",
    "spoilsEpisodes": [195, 400, 500, 900],
    "supportingEvidence": [
      "Wyper's explicit characterization in Episode 177 as carrying ancestral rage",
      "Later arcs directly parallel Shandian displacement with other groups",
      "Robin's interest in Shandian history connects to Void Century themes"
    ],
    "counterEvidence": [],
    "popularity": "MODERATE",
    "engagement": {
      "upvotes": null,
      "comments": null,
      "shares": null
    }
  },
  {
    "theoryTitle": "Iron Cloud Technology as Precursor to Wapol Metal",
    "theoryText": "Ohm's Iron Cloud - a substance that combines the properties of metal and clouds - shares conceptual similarities with Wapol Metal introduced later in the series. Both represent Oda exploring materials that defy conventional physics. Some fans theorize that Skypiea's dial and cloud technology, including Iron Cloud, represents an ancient scientific achievement that parallels or even predates modern innovations. This fits with Skypiea's connection to the Void Century and suggests that advanced civilizations existed before the current era.",
    "author": "One Piece technology theory community",
    "sourceUrl": "https://onepiece.fandom.com/wiki/Ordeals",
    "dateProposed": "2016-01-01",
    "platform": "Reddit/Forums",
    "episodeStart": 177,
    "episodeEnd": null,
    "affectedCharacters": ["ohm", "wapol", "vegapunk"],
    "affectedLocations": ["skypiea", "upper-yard"],
    "theoryStatus": "SPECULATIVE",
    "containsSpoilers": true,
    "spoilerSeverity": "MINOR",
    "spoilsEpisodes": [878],
    "supportingEvidence": [
      "Both Iron Cloud and Wapol Metal combine properties of multiple materials",
      "Skypiea has confirmed connections to ancient history",
      "Dial technology shows advanced scientific understanding"
    ],
    "counterEvidence": [
      "No explicit connection made in the manga between these technologies",
      "Different mechanisms of creation"
    ],
    "popularity": "LOW",
    "engagement": {
      "upvotes": null,
      "comments": null,
      "shares": null
    }
  },
  {
    "theoryTitle": "Nola's 400-Year Lifespan Hints at Ancient Zone Creatures",
    "theoryText": "Nola's survival for over 400 years, established in Episode 177, raises questions about the lifespans of creatures in the One Piece world. Some fans theorize that animals in certain regions, particularly those connected to ancient history, have unnaturally long lifespans. This could connect to the Sea Kings (who are known to live for centuries), Zunesha the elephant (confirmed to be over 1000 years old), and other ancient creatures. The theory suggests these long-lived creatures may be connected to the Void Century or serve as living witnesses to history.",
    "author": "One Piece world-building theorists",
    "sourceUrl": "https://onepiece.fandom.com/wiki/Nola",
    "dateProposed": "2015-01-01",
    "platform": "Reddit/Forums",
    "episodeStart": 177,
    "episodeEnd": null,
    "affectedCharacters": ["nola", "luffy"],
    "affectedLocations": ["skypiea", "upper-yard"],
    "theoryStatus": "PARTIALLY_CONFIRMED",
    "containsSpoilers": true,
    "spoilerSeverity": "MAJOR",
    "spoilsEpisodes": [803, 967],
    "supportingEvidence": [
      "Nola confirmed to be over 400 years old",
      "Zunesha confirmed to be over 1000 years old",
      "Sea Kings shown to have extremely long lifespans",
      "Connection between ancient creatures and important historical events"
    ],
    "counterEvidence": [
      "Not all ancient regions have long-lived creatures",
      "Could be coincidental rather than systematic"
    ],
    "popularity": "MODERATE",
    "engagement": {
      "upvotes": null,
      "comments": null,
      "shares": null
    }
  }
]
