[
  {
    "name": {
      "english": "Sanji",
      "japanese": "サンジ",
      "romanized": "Sanji"
    },
    "episodeAppearances": [109],
    "keyMoments": [
      {
        "episodeNumber": 109,
        "eventId": "ep109-event-002",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "Anti-Manner Kick Course Debut",
        "description": "Sanji debuts his powerful new technique, Anti-Manner Kick Course, delivering a massive 180-degree kick to defeat a Bananawani threatening the imprisoned crew.",
        "significance": "First appearance of one of Sanji's signature finishing moves. This technique becomes a staple of his fighting style throughout the series.",
        "timestamp": "05:45",
        "quote": "Anti-Manner Kick Course!"
      },
      {
        "episodeNumber": 109,
        "eventId": "ep109-event-007",
        "momentType": "MAJOR_DECISION",
        "title": "Forcing Mr. 3 to Create Wax Key",
        "description": "Sanji convinces Mr. 3 to use his Devil Fruit powers to create a perfect wax replica of the cage key, securing the crew's escape.",
        "significance": "Sanji's tactical thinking and intimidation skills prove crucial to the escape plan, showing he contributes intelligence as well as combat ability.",
        "timestamp": "14:45",
        "quote": ""
      }
    ],
    "abilities": [
      {
        "abilityName": "Anti-Manner Kick Course",
        "abilityType": "COMBAT_TECHNIQUE",
        "episodeFirstUsed": 109,
        "description": "A powerful finishing kick where Sanji lifts one leg a full 180 degrees in the air and delivers a devastating strike to the center of the opponent's torso, usually enough to defeat them with one blow."
      }
    ],
    "reveals": []
  },
  {
    "name": {
      "english": "Usopp",
      "japanese": "ウソップ",
      "romanized": "Usoppu"
    },
    "episodeAppearances": [109],
    "keyMoments": [
      {
        "episodeNumber": 109,
        "eventId": "ep109-event-006",
        "momentType": "MAJOR_DECISION",
        "title": "Devises Plan to Use Mr. 3's Wax Powers",
        "description": "Usopp comes up with the clever idea to use Mr. 3's Doru Doru no Mi abilities to create a wax copy of the cage key after the original is lost to the Bananawani.",
        "significance": "Demonstrates Usopp's intelligence and creative problem-solving abilities. His quick thinking saves the crew from certain death in Crocodile's trap.",
        "timestamp": "12:30",
        "quote": ""
      }
    ],
    "abilities": [],
    "reveals": []
  },
  {
    "name": {
      "english": "Tony Tony Chopper",
      "japanese": "トニートニー・チョッパー",
      "romanized": "Tonī Tonī Choppā"
    },
    "episodeAppearances": [109],
    "keyMoments": [
      {
        "episodeNumber": 109,
        "eventId": "ep109-event-001",
        "momentType": "BATTLE_START",
        "title": "Distracts Crocodile",
        "description": "Chopper bravely confronts the Warlord Crocodile to buy time for Sanji to rescue the imprisoned crew members, despite being vastly outmatched.",
        "significance": "Demonstrates Chopper's courage and willingness to risk his life for his new crewmates, showing his growth as a Straw Hat pirate since joining at Drum Island.",
        "timestamp": "03:30",
        "quote": ""
      }
    ],
    "abilities": [],
    "reveals": []
  },
  {
    "name": {
      "english": "Mr. 3",
      "japanese": "Mr.3",
      "romanized": "Misutā Surī",
      "otherNames": ["Galdino"]
    },
    "episodeAppearances": [109],
    "keyMoments": [
      {
        "episodeNumber": 109,
        "eventId": "ep109-event-003",
        "momentType": "POWER_REVEAL",
        "title": "Emerges from Bananawani with Doru Doru Ball",
        "description": "Mr. 3 emerges alive from inside a Bananawani's stomach, having protected himself from the stomach acid by encasing himself in a ball of wax using his Doru Doru no Mi powers.",
        "significance": "Reveals Mr. 3's survival and introduces the Doru Doru Ball defensive technique, showing the versatility of the Doru Doru no Mi beyond offensive attacks.",
        "timestamp": "07:20",
        "quote": ""
      },
      {
        "episodeNumber": 109,
        "eventId": "ep109-event-007",
        "momentType": "MAJOR_DECISION",
        "title": "Creates Wax Key for Escape",
        "description": "Under pressure from Sanji, Mr. 3 uses his Devil Fruit abilities to create a perfect wax replica of the cage key, enabling the Straw Hats' escape.",
        "significance": "Mr. 3's powers, previously used against the crew at Little Garden, now become the key to their survival. Shows how the Straw Hats can turn enemies' abilities to their advantage.",
        "timestamp": "14:45",
        "quote": ""
      }
    ],
    "devilFruitProgression": {
      "fruitId": "doru-doru-no-mi"
    },
    "abilities": [
      {
        "abilityName": "Doru Doru Ball",
        "abilityType": "DEVIL_FRUIT",
        "episodeFirstUsed": 109,
        "description": "Mr. 3 completely encases himself in a ball of hardened wax, protecting him from external damage including the stomach acid of a Bananawani. A defensive application of the Doru Doru no Mi."
      }
    ],
    "reveals": [
      {
        "infoType": "ABILITY",
        "information": "Can use his wax powers defensively by creating a protective Doru Doru Ball around himself",
        "episodeRevealed": 109,
        "severity": "MAJOR"
      }
    ]
  },
  {
    "name": {
      "english": "Smoker",
      "japanese": "スモーカー",
      "romanized": "Sumōkā",
      "otherNames": ["White Hunter Smoker"]
    },
    "episodeAppearances": [109],
    "keyMoments": [
      {
        "episodeNumber": 109,
        "eventId": "ep109-event-009",
        "momentType": "RELATIONSHIP_REVEAL",
        "title": "Saved by Zoro on Luffy's Orders",
        "description": "During the escape, Zoro carries the weakened Smoker to safety. When Smoker questions why, Zoro reveals it was Luffy's direct order.",
        "significance": "This moment begins to shift Smoker's perspective on Luffy and the Straw Hats, showing they have honor and compassion even for their enemies.",
        "timestamp": "17:30",
        "quote": ""
      },
      {
        "episodeNumber": 109,
        "eventId": "ep109-event-010",
        "momentType": "RELATIONSHIP_REVEAL",
        "title": "Perspective on Luffy Changes",
        "description": "After being saved by the Straw Hats despite being their enemy, Smoker's perspective shifts. Annoyed by Luffy's illogical but honorable behavior, he decides not to arrest them for now.",
        "significance": "A pivotal character moment for Smoker. This marks the beginning of his complex relationship with Luffy - still duty-bound to capture him, but respecting his character.",
        "timestamp": "18:45",
        "quote": ""
      },
      {
        "episodeNumber": 109,
        "eventId": "ep109-event-011",
        "momentType": "BOUNTY_REVEAL",
        "title": "Reveals Miss All Sunday's Bounty",
        "description": "Smoker reveals to the Straw Hats that Miss All Sunday (Nico Robin) has a bounty of 79 million berries and has been hunted by the World Government for 20 years.",
        "significance": "First revelation to the Straw Hats about Robin's criminal status and dangerous position. Foreshadows her eventual joining of the crew and conflicts from her past.",
        "timestamp": "19:30",
        "quote": ""
      }
    ],
    "abilities": [],
    "reveals": [],
    "relationships": [
      {
        "targetCharacterId": "luffy",
        "relationshipType": "COMPLEX_RIVALRY",
        "description": "Smoker's view of Luffy begins to shift after being saved by the Straw Hats. While still determined to capture him as a Marine, he now respects Luffy's character and honor.",
        "episodeEstablished": 109,
        "evolutionMoments": [
          {
            "episodeNumber": 109,
            "description": "After being rescued by the Straw Hats when they could have left him to die, Smoker acknowledges the debt and chooses not to arrest them immediately.",
            "newRelationshipType": "COMPLEX_RIVALRY"
          }
        ]
      }
    ]
  },
  {
    "name": {
      "english": "Crocodile",
      "japanese": "クロコダイル",
      "romanized": "Kurokodairu",
      "otherNames": ["Sir Crocodile", "Mr. 0"]
    },
    "episodeAppearances": [109],
    "keyMoments": [
      {
        "episodeNumber": 109,
        "eventId": "ep109-event-005",
        "momentType": "POWER_REVEAL",
        "title": "Reveals He Had the Real Key",
        "description": "Crocodile reveals that he possessed the real cage key all along, demonstrating his manipulative nature and love of psychological torture. He enjoys crushing his enemies' hopes.",
        "significance": "Shows Crocodile's sadistic personality and strategic mind. He doesn't just want to defeat his enemies - he wants to torture them psychologically and watch them struggle futilely.",
        "timestamp": "11:00",
        "quote": "I've had the real key this entire time."
      }
    ],
    "abilities": [],
    "reveals": [
      {
        "infoType": "PERSONALITY",
        "information": "Crocodile is not just cruel but sadistic, enjoying psychological torture and crushing his enemies' hopes rather than simply defeating them",
        "episodeRevealed": 109,
        "severity": "MAJOR"
      }
    ]
  },
  {
    "name": {
      "english": "Nico Robin",
      "japanese": "ニコ・ロビン",
      "romanized": "Niko Robin",
      "otherNames": ["Miss All Sunday"]
    },
    "episodeAppearances": [109],
    "keyMoments": [
      {
        "episodeNumber": 109,
        "eventId": "ep109-event-011",
        "momentType": "BOUNTY_REVEAL",
        "title": "Bounty and Wanted Status Revealed to Straw Hats",
        "description": "Smoker reveals that Miss All Sunday (Nico Robin) carries a bounty of 79 million berries and has been chased by the World Government for 20 years.",
        "significance": "The Straw Hats learn for the first time about Robin's dangerous criminal status and the World Government's pursuit of her, setting up future plot developments.",
        "timestamp": "19:30",
        "quote": ""
      }
    ],
    "bounties": [
      {
        "amount": 79000000,
        "episodeRevealed": 109,
        "reason": "Revealed by Smoker to have a 79 million berry bounty and being hunted by the World Government for 20 years"
      }
    ],
    "abilities": [],
    "reveals": [
      {
        "infoType": "BOUNTY",
        "information": "Has a bounty of 79 million berries and has been hunted by the World Government for 20 years",
        "episodeRevealed": 109,
        "severity": "MAJOR"
      }
    ]
  }
]
