[
  {
    "name": {
      "english": "Gum-Gum Fruit",
      "japanese": "ゴムゴムの実",
      "romanized": "Gomu Gomu no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 4,
    "debutChapter": 1,
    "episodeAppearances": [304],
    "currentUser": "luffy",
    "previousUsers": [],
    "abilities": [
      {
        "abilityName": "Gear Third",
        "episodeFirstUsed": 304,
        "description": "A technique where the user bites their thumb and blows air directly into their bones, inflating them to gigantic proportions. This gives attacks the power and size of a giant. The air can be transferred through the skeleton to different body parts. Originally had a shrinking side effect where the user would shrink to a small size for a period proportional to how long Gear Third was active.",
        "firstUsedAgainst": "Rob Lucci"
      },
      {
        "abilityName": "Bone Balloon (Hone Fusen)",
        "episodeFirstUsed": 304,
        "description": "The foundational technique of Gear Third where the user inflates their skeleton by blowing air into their bones through their thumb. The air can be redistributed throughout the skeleton to inflate different body parts.",
        "firstUsedAgainst": "Rob Lucci"
      },
      {
        "abilityName": "Gomu Gomu no Gigant Pistol",
        "episodeFirstUsed": 304,
        "description": "A Gear Third technique where the user inflates their arm to giant size and delivers a devastating punch with tremendous force and range. Powerful enough to overwhelm Iron Body (Tekkai) defenses and send opponents flying extreme distances.",
        "firstUsedAgainst": "Rob Lucci"
      }
    ],
    "awakeningEpisode": null,
    "userHistory": [
      {
        "userId": "luffy",
        "episodeObtained": 4,
        "episodeLost": null,
        "howObtained": "Consumed"
      }
    ],
    "weaknesses": [
      {
        "weakness": "Gear Third Side Effect",
        "episodeRevealed": 304,
        "description": "After using Gear Third, the user's body shrinks to a small child-like size for a period proportional to how long the technique was active, leaving them vulnerable."
      }
    ],
    "reveals": [
      {
        "infoType": "TECHNIQUE",
        "information": "The Gomu Gomu no Mi user can inflate their bones by blowing air into them, creating giant-sized attacks through Gear Third",
        "episodeRevealed": 304,
        "severity": "CRITICAL"
      },
      {
        "infoType": "MECHANIC",
        "information": "The air inflated into bones can be transferred throughout the skeleton to different body parts",
        "episodeRevealed": 304,
        "severity": "MAJOR"
      },
      {
        "infoType": "POWER_LEVEL",
        "information": "Gear Third attacks have the destructive power comparable to giants and can overwhelm advanced Rokushiki techniques like Iron Body",
        "episodeRevealed": 304,
        "severity": "CRITICAL"
      }
    ]
  }
]
