[
  {
    "theory": "Luffy's bones are hollow like a bird's skeleton, which would explain how he can inflate them with air without breaking them. Since Luffy can stretch and still stand tall, his bones must have properties of both rubber and bone, combining the hardness of bone with the elasticity of rubber.",
    "author": "One Piece Fandom Community",
    "sourceUrl": "https://onepiece.fandom.com/f/p/4400000000000057325",
    "platform": "Fandom Forum",
    "publishedDate": null,
    "episodesSpanned": [304, 305, 306],
    "relatedCharacters": ["luffy"],
    "relatedConcepts": ["gear-third", "gomu-gomu-no-mi", "devil-fruit-mechanics"],
    "supportingEvidence": [
      "Luffy can inflate his bones without them breaking",
      "The skeleton fully connects all joints allowing air redistribution",
      "Luffy maintains structural integrity despite bone inflation"
    ],
    "counterEvidence": [
      "Never explicitly stated in canon that bones are hollow",
      "Luffy's body has shown normal bone density in other contexts"
    ],
    "popularity": "MODERATE",
    "spoilerStatus": false,
    "spoilsUpToEpisode": 304,
    "theoryStatus": "UNCONFIRMED"
  },
  {
    "theory": "The shrinking side effect of Gear Third is proportional to how much the user inflates and how long they maintain it, suggesting it's an energy conservation mechanic where the body must compensate for the temporary enlargement by temporarily shrinking.",
    "author": "One Piece Community Discussions",
    "sourceUrl": "https://anime.stackexchange.com/questions/8177/how-do-luffys-gear-attacks-work",
    "platform": "Stack Exchange",
    "publishedDate": null,
    "episodesSpanned": [304, 305, 306],
    "relatedCharacters": ["luffy"],
    "relatedConcepts": ["gear-third", "side-effects", "devil-fruit-mechanics"],
    "supportingEvidence": [
      "Episode 305 shows Luffy shrinking after using Gear Third",
      "The duration of shrinking appears connected to usage time",
      "This mechanic prevents Gear Third from being overpowered"
    ],
    "counterEvidence": [
      "After the timeskip, Luffy overcomes this side effect entirely",
      "The exact mechanics are never fully explained"
    ],
    "popularity": "HIGH",
    "spoilerStatus": false,
    "spoilsUpToEpisode": 306,
    "theoryStatus": "PARTIALLY_CONFIRMED"
  },
  {
    "theory": "Gear Third's power being comparable to giants foreshadows that Luffy will eventually face or befriend giants, and that the technique was specifically developed by Luffy thinking about how to match giant-level strength to overcome powerful enemies.",
    "author": "CBR Analysis",
    "sourceUrl": "https://www.cbr.com/one-piece-gear-third-facts/",
    "platform": "CBR",
    "publishedDate": "2019-12-01",
    "episodesSpanned": [304, 400, 500],
    "relatedCharacters": ["luffy"],
    "relatedConcepts": ["gear-third", "giants", "foreshadowing"],
    "supportingEvidence": [
      "Luffy explicitly states his attacks have the power of giants",
      "Later arcs feature significant giant characters and locations",
      "Luffy's creative problem-solving often draws from his experiences"
    ],
    "counterEvidence": [
      "Luffy had already encountered giants before (Little Garden arc)",
      "The connection may be coincidental rather than intentional foreshadowing"
    ],
    "popularity": "MODERATE",
    "spoilerStatus": true,
    "spoilsUpToEpisode": 900,
    "theoryStatus": "SPECULATIVE"
  }
]
