[
  {
    "name": {
      "english": "Whisper-Whisper Fruit",
      "japanese": "ヒソヒソの実",
      "romanized": "Hiso Hiso no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 54,
    "debutChapter": null,
    "description": "Grants the user the ability to telepathically communicate with and understand the minds of any animal. This power allows the user to gather information from animals and even influence their behavior through communication.",
    "episodeAppearances": [55],
    "users": [
      {
        "characterId": "apis",
        "episodeStart": 54,
        "episodeEnd": "present",
        "circumstances": "Apis ate the fruit at some point before the Warship Island arc, giving her the ability to communicate with Ryu and other animals."
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Animal Telepathy",
        "episodeRevealed": 55,
        "description": "The user can telepathically read the minds of any animal and understand their thoughts, feelings, and intentions.",
        "severity": "MAJOR",
        "firstUseContext": "Apis officially reveals this ability when explaining how she can communicate with Ryu and how she used it to learn about incoming weather from seagulls."
      },
      {
        "abilityName": "Sea King Communication",
        "episodeRevealed": 55,
        "description": "The user can communicate even with massive Sea Kings, as demonstrated when Apis interacted with the Sea King in the Calm Belt.",
        "severity": "MAJOR",
        "firstUseContext": "Apis uses this to communicate with a Sea King, pulling its nostril hair to make it sneeze and launch the Going Merry to safety."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 55,
        "severity": "MAJOR"
      },
      {
        "weakness": "One-way communication limitations",
        "episodeRevealed": 55,
        "severity": "MINOR",
        "description": "While Apis can understand animals, they may not fully comprehend complex human concepts she tries to convey."
      }
    ],
    "strengths": [
      {
        "strength": "Universal animal communication",
        "episodeRevealed": 55,
        "description": "Can communicate with any animal regardless of species, including legendary creatures like Sennenryu and massive Sea Kings.",
        "severity": "MAJOR"
      },
      {
        "strength": "Information gathering",
        "episodeRevealed": 54,
        "description": "Can gather crucial information from animals, such as weather warnings from birds or locations from various creatures.",
        "severity": "MINOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "MEDIUM",
    "notes": "This is an anime-only Devil Fruit that does not appear in the manga or any canon One Piece material. It was created specifically for the Warship Island filler arc."
  }
]
