[
  {
    "id": "theory-ep613-001",
    "title": "Zoro's Strategic Restraint: Why He Didn't Use Haki Against Monet",
    "summary": "Fans theorize that Zoro deliberately chose not to use Armament Haki when cutting Monet, not because of inability or gender bias, but as a strategic demonstration of overwhelming power and intimidation.",
    "fullText": "When Zoro used his Daishinkan technique to slice Monet in half during Episode 613, many fans initially questioned why he didn't use Haki to finish her off completely. The prevailing theory is that this was a calculated tactical decision. By cutting her without Haki, Zoro demonstrated that he was so far above her in strength that he didn't need to use his full arsenal. The psychological impact of this - Monet being unable to reform properly due to fear - was more effective than a killing blow. This interpretation suggests Zoro has matured beyond simply overpowering opponents, now understanding that victory can come through intimidation and tactical superiority. Additionally, by holding back, he created an opportunity for Tashigi to prove herself by landing the final blow, showing respect for his Marine ally's growth.",
    "author": "One Piece Community Discussion",
    "source": {
      "url": "https://www.quora.com/Why-is-Zoro-unable-to-kill-Monet-Im-currently-in-Episode-613-and-still-confused-Can-someone-explain",
      "title": "Why is Zoro unable to kill Monet? - Quora",
      "platform": "Quora",
      "accessedAt": "2026-01-07"
    },
    "postedDate": "2013-09-22",
    "episodeRange": [613, 613],
    "minEpisode": 613,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 613
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["zoro", "monet", "tashigi"],
    "relatedLocations": ["punk-hazard-biscuit-room"],
    "relatedEvents": ["ep613-event-004", "ep613-event-005"],
    "tags": ["zoro", "haki", "strategy", "character-development", "monet"]
  },
  {
    "id": "theory-ep613-002",
    "title": "Strength-Based Discrimination vs. Gender Bias",
    "summary": "A debate in the fandom about whether Zoro's restraint against Monet was due to gender or purely based on the vast difference in their combat strength.",
    "fullText": "Episode 613 sparked significant discussion in the One Piece community about Zoro's character development regarding fighting women. Earlier in the series, Zoro showed reluctance to fight female opponents seriously. However, the theory suggests that by the Punk Hazard arc, Zoro has evolved beyond gender-based hesitation. His statement 'I don't make promises to wild animals. They don't know any better' indicates he now views opponents based on their threat level and intentions rather than gender. The strength gap between Zoro and Monet was so vast that killing her would have been overkill - similar to how he wouldn't kill any vastly weaker opponent regardless of gender. This interpretation positions the episode as a key moment in Zoro's character growth, showing he can now fight women when necessary (he did cut her) while still showing appropriate restraint based on the actual threat level.",
    "author": "One Piece Community Discussion",
    "source": {
      "url": "https://x.com/prymbanega/status/1658457511744118785",
      "title": "Discussion about Zoro vs Monet strength difference",
      "platform": "X (Twitter)",
      "accessedAt": "2026-01-07"
    },
    "postedDate": "2023-05-16",
    "episodeRange": [613, 613],
    "minEpisode": 613,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 613
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "DEBATED",
    "relatedCharacters": ["zoro", "monet"],
    "relatedLocations": ["punk-hazard-biscuit-room"],
    "relatedEvents": ["ep613-event-001", "ep613-event-004"],
    "tags": ["zoro", "character-development", "gender", "strength", "debate"]
  },
  {
    "id": "theory-ep613-003",
    "title": "Zoro Creating an Opportunity for Tashigi",
    "summary": "Theory that Zoro deliberately held back against Monet to give Tashigi the opportunity to prove herself and land the finishing blow.",
    "fullText": "Some fans theorize that Zoro's decision not to use Haki against Monet was partially motivated by his desire to give Tashigi an opportunity to prove herself. Throughout their interactions, Zoro has shown a complex relationship with Tashigi, who reminds him of his deceased friend Kuina and shares her dream of becoming a great swordswoman. By psychologically defeating Monet without killing her, Zoro created the perfect opening for Tashigi to step in and land the decisive blow with her Kiri Shigure technique. This allowed Tashigi to gain the experience and confidence of defeating a Logia-type Devil Fruit user - a significant accomplishment for any fighter. This theory positions Zoro as not just a powerful fighter, but as someone who understands the importance of allowing others to grow through their own victories.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://www.roadtolaughtale.com/why-cant-zoro-fight-monet/",
      "title": "Why can't Zoro fight Monet? - Road to laugh tale",
      "platform": "Road to Laugh Tale",
      "accessedAt": "2026-01-07"
    },
    "postedDate": "2023-08-10",
    "episodeRange": [613, 613],
    "minEpisode": 613,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 613
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["zoro", "monet", "tashigi"],
    "relatedLocations": ["punk-hazard-biscuit-room"],
    "relatedEvents": ["ep613-event-007", "ep613-event-008"],
    "tags": ["zoro", "tashigi", "mentorship", "character-relationships"]
  }
]
