[
  {
    "name": {
      "english": "Franky",
      "japanese": "フランキー",
      "romanized": "Furankī"
    },
    "episodeAppearances": [523],
    "keyMoments": [
      {
        "episodeNumber": 523,
        "eventId": "ep523-event-005",
        "momentType": "BACKSTORY_REVEAL",
        "title": "Reveals Kuma's Protection of the Sunny",
        "description": "Franky reveals to the crew that Bartholomew Kuma had been protecting the Thousand Sunny for the past two years, explaining the deal Kuma made with Vegapunk.",
        "significance": "Franky serves as the bearer of crucial information that deepens the crew's understanding of Kuma's sacrifice and shows Franky's role in connecting important plot points.",
        "timestamp": "11:30",
        "quote": "Before Bartholomew Kuma was fully converted into PX-0, he made a deal with Dr. Vegapunk to allow him to include a mission of his own into his programming: to protect the ship of the Straw Hat Pirates until the day one of their members returns."
      },
      {
        "episodeNumber": 523,
        "eventId": "ep523-event-006",
        "momentType": "BACKSTORY_REVEAL",
        "title": "Explains Hatchan and Duval's Injuries",
        "description": "Franky explains that Hatchan and Duval sustained heavy injuries fighting the Marines to protect the Thousand Sunny before Kuma arrived.",
        "significance": "Shows Franky's awareness of events that transpired during the timeskip and his role as an information conduit for the crew.",
        "timestamp": "14:15",
        "quote": ""
      }
    ],
    "reveals": [
      {
        "infoType": "KNOWLEDGE",
        "information": "Franky learned about Kuma's protection of the Thousand Sunny upon his return to Sabaody",
        "episodeRevealed": 523,
        "severity": "MAJOR"
      }
    ]
  },
  {
    "name": {
      "english": "Bartholomew Kuma",
      "japanese": "バーソロミュー・くま",
      "romanized": "Bāsoromyū Kuma"
    },
    "episodeAppearances": [523],
    "keyMoments": [
      {
        "episodeNumber": 523,
        "eventId": "ep523-event-005",
        "momentType": "BACKSTORY_REVEAL",
        "title": "Kuma's Protection Revealed",
        "description": "It is revealed that Kuma protected the Thousand Sunny for two years after making a deal with Vegapunk to program this mission before his full conversion to PX-0.",
        "significance": "Reveals Kuma's true nature as a secret ally and the depth of his sacrifice for the Straw Hats, transforming understanding of his character from mysterious antagonist to tragic hero.",
        "timestamp": "11:30",
        "quote": ""
      }
    ],
    "reveals": [
      {
        "infoType": "MOTIVATION",
        "information": "Kuma made a deal with Vegapunk to protect the Thousand Sunny as his final act before losing his humanity",
        "episodeRevealed": 523,
        "severity": "CRITICAL"
      },
      {
        "infoType": "ACTION",
        "information": "Kuma protected the Thousand Sunny for two years against Marine attacks",
        "episodeRevealed": 523,
        "severity": "CRITICAL"
      }
    ]
  },
  {
    "name": {
      "english": "Silvers Rayleigh",
      "japanese": "シルバーズ・レイリー",
      "romanized": "Shirubāzu Reirī"
    },
    "episodeAppearances": [523],
    "keyMoments": [
      {
        "episodeNumber": 523,
        "eventId": "ep523-event-003",
        "momentType": "BACKSTORY_REVEAL",
        "title": "Recalls Meeting Gol D. Roger",
        "description": "Rayleigh has a flashback to his first meeting with Gol D. Roger while talking with Shakky at the coast where the Straw Hats departed.",
        "significance": "Provides important backstory about the legendary partnership between Rayleigh and Roger, and shows Rayleigh's belief that Luffy is worthy of Roger's hat.",
        "timestamp": "06:20",
        "quote": "Luffy has taken another step towards becoming a man worthy of that hat he wears."
      }
    ],
    "reveals": [
      {
        "infoType": "BELIEF",
        "information": "Rayleigh believes Luffy has grown to become more worthy of Roger's straw hat",
        "episodeRevealed": 523,
        "severity": "MAJOR"
      }
    ]
  },
  {
    "name": {
      "english": "Caribou",
      "japanese": "カリブー",
      "romanized": "Karibū"
    },
    "episodeAppearances": [523],
    "keyMoments": [
      {
        "episodeNumber": 523,
        "eventId": "ep523-event-002",
        "momentType": "POWER_REVEAL",
        "title": "Caribou Attacks Fake Straw Hats",
        "description": "Caribou attacks the Fake Straw Hats, revealing he joined them to kill the crew from the inside. He demonstrates his Logia-type Numa Numa no Mi powers.",
        "significance": "Establishes Caribou as a dangerous antagonist with Logia powers and murderous intent toward the real Straw Hats.",
        "timestamp": "03:45",
        "quote": "I joined the 'Straw Hat Pirates' so I could kill the crew from the inside!"
      },
      {
        "episodeNumber": 523,
        "eventId": "ep523-event-009",
        "momentType": "POWER_REVEAL",
        "title": "Confirms Logia-Type Devil Fruit",
        "description": "Caribou absorbs a cannonball into his swamp body, confirming his Devil Fruit is Logia-based. This is the first Logia-type revealed after the timeskip.",
        "significance": "First demonstration of post-timeskip Devil Fruit powers and establishes the danger level of Caribou's abilities.",
        "timestamp": "12:30",
        "quote": ""
      },
      {
        "episodeNumber": 523,
        "eventId": "ep523-event-008",
        "momentType": "BATTLE_START",
        "title": "Caribou Pirates Attack",
        "description": "Caribou and his crew attack the Thousand Sunny underwater, attempting to kill the Straw Hat Pirates.",
        "significance": "Sets up Caribou as an immediate threat and antagonist for the Fish-Man Island arc.",
        "timestamp": "19:20",
        "quote": ""
      }
    ],
    "devilFruitProgression": {
      "fruitId": "numa-numa-no-mi",
      "episodeConsumed": null,
      "episodeLost": null,
      "awakeningEpisode": null
    },
    "abilities": [
      {
        "abilityName": "Numa Numa no Mi",
        "abilityType": "DEVIL_FRUIT",
        "episodeFirstUsed": 523,
        "description": "Logia-type Devil Fruit that allows Caribou to create, control, and transform into swamp/mud, making him a Swamp Human. Can absorb attacks and objects into his body."
      }
    ],
    "reveals": [
      {
        "infoType": "ABILITY",
        "information": "Caribou possesses the Logia-type Numa Numa no Mi (Swamp-Swamp Fruit)",
        "episodeRevealed": 523,
        "severity": "MAJOR"
      },
      {
        "infoType": "MOTIVATION",
        "information": "Caribou joined the fake Straw Hats with the intention of killing the crew from the inside",
        "episodeRevealed": 523,
        "severity": "MINOR"
      }
    ]
  },
  {
    "name": {
      "english": "Sentomaru",
      "japanese": "戦桃丸",
      "romanized": "Sentōmaru"
    },
    "episodeAppearances": [523],
    "keyMoments": [
      {
        "episodeNumber": 523,
        "eventId": "ep523-event-007",
        "momentType": "WORLD_LORE",
        "title": "Reports to Marine Headquarters",
        "description": "Sentomaru reports to Marine Headquarters in the New World about capturing Demaro Black and warns them about the Straw Hats' return and newfound strength.",
        "significance": "Establishes that the Marines are aware of the Straw Hats' return and their increased power level, setting up future confrontations.",
        "timestamp": "16:45",
        "quote": "Call Marine Headquarters in the New World and warn them that the Straw Hats have finally returned."
      }
    ],
    "reveals": [
      {
        "infoType": "KNOWLEDGE",
        "information": "Sentomaru witnessed the Straw Hats' increased strength and easily destroying two Pacifistas",
        "episodeRevealed": 523,
        "severity": "MAJOR"
      }
    ]
  },
  {
    "name": {
      "english": "Nami",
      "japanese": "ナミ",
      "romanized": "Nami"
    },
    "episodeAppearances": [523],
    "keyMoments": [
      {
        "episodeNumber": 523,
        "eventId": "ep523-event-004",
        "momentType": "CULTURAL_MOMENT",
        "title": "Explains Bubble Coating Mechanics",
        "description": "Nami explains to the crew how the bubble coating works, describing how it has the same properties as the bubbles on Sabaody Archipelago.",
        "significance": "Demonstrates Nami's role as the crew's navigator and her technical knowledge about their journey.",
        "timestamp": "08:45",
        "quote": "A coated ship has all the same properties of the bubbles on the Sabaody Archipelago. They will expand until a certain point before letting an object go through the bubble."
      }
    ],
    "reveals": []
  }
]
