[
  {
    "name": {
      "english": "Swamp-Swamp Fruit",
      "japanese": "ヌマヌマの実",
      "romanized": "Numa Numa no Mi"
    },
    "type": "LOGIA",
    "debutEpisode": 523,
    "debutChapter": 603,
    "description": "A Logia-type Devil Fruit that allows the user to create, control, and transform into mud/swamp at will, making the user a Swamp Human. The user can create bottomless swamps and store objects and people within their body.",
    "episodeAppearances": [523],
    "users": [
      {
        "characterId": "caribou",
        "episodeStart": 523,
        "episodeEnd": "present",
        "circumstances": "Caribou had already consumed the fruit before this episode; this is the first time it is shown in the anime"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Logia Intangibility",
        "episodeRevealed": 523,
        "description": "User can transform into swamp/mud, allowing attacks to pass through them harmlessly. Demonstrated when Caribou absorbs a cannonball into his body.",
        "severity": "MAJOR",
        "firstUseContext": "Caribou demonstrates his Logia powers while attacking the Fake Straw Hats, absorbing attacks into his swamp body."
      },
      {
        "abilityName": "Swamp Body Storage",
        "episodeRevealed": 523,
        "description": "User can store objects and people within their swamp body, functioning as bottomless storage space.",
        "severity": "MAJOR",
        "firstUseContext": "Caribou uses this ability during his attack on the Fake Straw Hats."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim and weakness to seawater",
        "episodeRevealed": 523,
        "severity": "MAJOR"
      },
      {
        "weakness": "Cannot return to human form if trapped somewhere their normal body cannot fit",
        "episodeRevealed": null,
        "severity": "MAJOR"
      }
    ],
    "strengths": [
      {
        "strength": "Logia intangibility allows user to avoid most physical attacks",
        "episodeRevealed": 523,
        "description": "As a Logia-type, the user can become intangible and avoid conventional attacks.",
        "severity": "MAJOR"
      },
      {
        "strength": "Bottomless swamp creation can trap enemies",
        "episodeRevealed": 523,
        "description": "User can create swamps that are impossible to escape from; victims sink deeper if they struggle.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "HIGH"
  }
]
