[
  {
    "id": "ami-ami-no-mi",
    "name": {
      "english": "Net-Net Fruit",
      "japanese": "アミアミの実",
      "romanized": "Ami Ami no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 426,
    "debutChapter": null,
    "description": "An anime-only Devil Fruit that grants the user the ability to produce and manipulate nets. The user can create different types of nets by ingesting various materials, and can even transform their entire body into a net structure. This provides both offensive trapping capabilities and defensive properties similar to Logia-type intangibility.",
    "isCanon": false,
    "episodeAppearances": [429],
    "users": [
      {
        "characterId": "largo",
        "episodeStart": 426,
        "episodeEnd": 429,
        "circumstances": "Largo ate the Ami Ami no Mi at an unknown time, gaining net-based powers that he uses to capture creatures for Shiki."
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Net-Body Transformation",
        "episodeRevealed": 429,
        "description": "The user can transform their entire body into a net structure, allowing them to trap opponents inside their own stomach. Physical attacks disperse across the net surface, providing defense similar to Logia fruits.",
        "severity": "MAJOR",
        "firstUseContext": "Largo transforms his body into a spiked net to trap Luffy, demonstrating the full extent of his Devil Fruit powers in their final battle."
      },
      {
        "abilityName": "Material-Based Net Creation",
        "episodeRevealed": 429,
        "description": "By ingesting different materials (metal, boiling water, fire), the user can create specialized nets with those properties, including metal cages, barbed wire nets, fire nets, and boiling water nets.",
        "severity": "MAJOR",
        "firstUseContext": "Used throughout the arc to create various types of nets for capturing Boss and fighting the Straw Hats."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 426,
        "severity": "MAJOR"
      },
      {
        "weakness": "Size-based attacks can tear through net structure",
        "episodeRevealed": 429,
        "severity": "MAJOR",
        "description": "Luffy's Gear Third inflation was able to break free from Largo's net-body form, showing that extreme size changes can overcome the net's trapping ability."
      }
    ],
    "strengths": [
      {
        "strength": "Versatile trapping and capturing abilities",
        "episodeRevealed": 426,
        "description": "The nets have high tensile strength and adhesive properties, making them excellent for capturing targets. Largo claims a 120% capture success rate.",
        "severity": "MAJOR"
      },
      {
        "strength": "Disperses physical impact",
        "episodeRevealed": 429,
        "description": "When transformed into a net, the user can disperse the force of physical blows across the net surface, providing defensive capabilities.",
        "severity": "MAJOR"
      },
      {
        "strength": "Customizable net properties",
        "episodeRevealed": 429,
        "description": "By consuming different materials, the user can create nets with various properties (fire, metal, water), making it extremely versatile.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "MID"
  },
  {
    "id": "gomu-gomu-no-mi",
    "name": {
      "english": "Gum-Gum Fruit",
      "japanese": "ゴムゴムの実",
      "romanized": "Gomu Gomu no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 1,
    "debutChapter": 1,
    "description": "Grants the user's body the properties of rubber, allowing them to stretch and become immune to blunt attacks and electricity.",
    "isCanon": true,
    "episodeAppearances": [429],
    "users": [
      {
        "characterId": "luffy",
        "episodeStart": 1,
        "episodeEnd": "present",
        "circumstances": "Luffy accidentally ate the fruit as a child"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Gomu Gomu no Gigant Pistol",
        "episodeRevealed": 429,
        "description": "A Gear Third technique where Luffy inflates his arm to gigantic proportions and delivers a massive punch with devastating force, capable of destroying ships and defeating powerful opponents.",
        "severity": "MAJOR",
        "firstUseContext": "Luffy uses Gomu Gomu no Gigant Pistol as his finishing move against Largo, sending him flying into his own ship and destroying it."
      }
    ],
    "weaknesses": [],
    "strengths": [
      {
        "strength": "Gear Third size manipulation",
        "episodeRevealed": 429,
        "description": "Luffy demonstrates using Gear Third not just for attacking, but also for breaking free from Largo's net trap by inflating his body.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "COMMON",
    "powerTier": "HIGH"
  }
]
