[
  {
    "abilityName": "Kaimen Wari",
    "translatedName": "Ocean Surface Splitter",
    "abilityType": "FISHMAN_KARATE",
    "debutEpisode": 209,
    "debutChapter": 306,
    "episodeAppearances": [209],
    "users": [
      {
        "characterId": "capote",
        "episodeFirstUsed": 209,
        "masteryLevel": "PROFICIENT",
        "notes": "Uses this technique during the Donut Race to attack opponents"
      }
    ],
    "description": "A Fish-Man Karate technique where the user performs a powerful karate chop that generates shock waves capable of slicing through the ocean surface itself.",
    "visualDescription": "Capote performs a downward karate chop motion, creating visible shock waves that travel through the water and air.",
    "strengths": [
      "Effective at range over water",
      "Can be used to attack boats and opponents from a distance",
      "Demonstrates mastery of Fish-Man Karate principles"
    ],
    "weaknesses": [
      "Can be countered by Devil Fruit abilities like Robin's Hana Hana no Mi",
      "Requires proximity to water for maximum effectiveness"
    ],
    "relatedAbilities": ["Fishman Karate"],
    "keyMoments": [
      {
        "episodeNumber": 209,
        "eventId": "ep209-event-006",
        "description": "Capote uses Kaimen Wari during the Donut Race to attack the Straw Hats' boat.",
        "outcome": "The attack is countered by Robin's Ocho Fleur: Flip technique.",
        "timestamp": "13:45"
      }
    ]
  },
  {
    "abilityName": "Ocho Fleur: Flip",
    "translatedName": "Eight Flowers: Flip",
    "abilityType": "DEVIL_FRUIT",
    "debutEpisode": 209,
    "debutChapter": 307,
    "episodeAppearances": [209],
    "users": [
      {
        "characterId": "robin",
        "episodeFirstUsed": 209,
        "masteryLevel": "PROFICIENT",
        "notes": "Uses this defensive technique to counter Capote's Fish-Man Karate attack"
      }
    ],
    "description": "A Hana Hana no Mi technique where Robin sprouts eight arms - six to hold the opponent still and two from the opponent's lower back to hold the ground - then flips the opponent upside down so they fall on their head.",
    "visualDescription": "Eight arms bloom from Robin's body and the opponent's body. Six arms grab and restrain the opponent while two sprout from their lower back, anchoring to the ground and providing leverage to flip them over.",
    "strengths": [
      "Effective restraint and counter technique",
      "Can disable opponents through disorientation",
      "Works well against physical attackers"
    ],
    "weaknesses": [
      "Requires the opponent to be within range",
      "Robin feels damage inflicted on her sprouted limbs"
    ],
    "relatedAbilities": ["Hana Hana no Mi", "Dos Fleur", "Seis Fleur", "Treinta Fleur"],
    "devilFruitId": "hana-hana-no-mi",
    "keyMoments": [
      {
        "episodeNumber": 209,
        "eventId": "ep209-event-007",
        "description": "Robin uses Ocho Fleur: Flip to counter Capote's Kaimen Wari attack during the Donut Race.",
        "outcome": "Successfully flips Capote, disrupting his attack and protecting the Barrel Tiger.",
        "timestamp": "15:30"
      }
    ]
  },
  {
    "abilityName": "Two-Fish Engine",
    "translatedName": "Two-Fish Engine",
    "abilityType": "COMBINATION",
    "debutEpisode": 209,
    "debutChapter": 306,
    "episodeAppearances": [209],
    "users": [
      {
        "characterId": "capote",
        "episodeFirstUsed": 209,
        "masteryLevel": "PROFICIENT",
        "notes": "Works in combination with Monda"
      },
      {
        "characterId": "monda",
        "episodeFirstUsed": 209,
        "masteryLevel": "PROFICIENT",
        "notes": "Works in combination with Capote"
      }
    ],
    "description": "A combination technique where Capote places his legs into Monda's mouth, combining the fish-man's swimming power with the shark's natural speed to create an extremely fast propulsion system for their boat.",
    "visualDescription": "Capote positions himself with his legs extended into Monda the shark's open mouth, creating a unified swimming motion that propels their boat at extreme speeds.",
    "strengths": [
      "Dramatically increases swimming and boat speed",
      "Allows navigation through difficult waters like coral reefs and whirlpools",
      "Combines the strengths of both a fish-man and a shark"
    ],
    "weaknesses": [
      "Requires specific teamwork between Capote and Monda",
      "Both participants are vulnerable while in this formation"
    ],
    "relatedAbilities": [],
    "keyMoments": [
      {
        "episodeNumber": 209,
        "eventId": "ep209-event-010",
        "description": "Capote and Monda demonstrate the Two-Fish Engine to gain speed in the Donut Race.",
        "outcome": "Gives the Cutie Wagon a significant speed advantage, allowing them to navigate difficult waters easily.",
        "timestamp": "20:45"
      }
    ]
  }
]
