[
  {
    "name": {
      "english": "Gum-Gum Fruit",
      "japanese": "ゴムゴムの実",
      "romanized": "Gomu Gomu no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 1,
    "debutChapter": 1,
    "description": "Grants the user's body the properties of rubber, making them immune to electricity and able to stretch their body.",
    "episodeAppearances": [182],
    "users": [],
    "abilityReveals": [],
    "weaknesses": [],
    "strengths": [
      {
        "strength": "Complete immunity to electrical attacks",
        "episodeRevealed": 182,
        "description": "Rubber is a natural insulator and does not conduct electricity, making the user completely immune to lightning and electrical attacks. This makes the Gomu Gomu no Mi user the natural enemy of the Goro Goro no Mi user.",
        "severity": "ULTRA_SECRET"
      },
      {
        "strength": "Ability to touch and harm Logia users with electrical powers",
        "episodeRevealed": 182,
        "description": "Due to rubber's insulating properties, the user can physically touch and harm users of the Goro Goro no Mi despite their intangible lightning form.",
        "severity": "CRITICAL"
      }
    ],
    "awakening": null,
    "rarity": null,
    "powerTier": null
  },
  {
    "name": {
      "english": "Rumble-Rumble Fruit",
      "japanese": "ゴロゴロの実",
      "romanized": "Goro Goro no Mi"
    },
    "type": "LOGIA",
    "debutEpisode": 167,
    "debutChapter": 254,
    "description": "Allows the user to create, control, and transform into lightning, making them a Lightning Human.",
    "episodeAppearances": [182],
    "users": [],
    "abilityReveals": [
      {
        "abilityName": "60 Million Volt Jamboule",
        "episodeRevealed": 182,
        "description": "The user releases a massive spherical lightning attack that engulfs the target in electrical energy, delivering 60 million volts of electricity.",
        "severity": "MAJOR",
        "firstUseContext": "Enel uses this technique against Luffy after El Thor fails, attempting to overwhelm him with greater electrical power."
      },
      {
        "abilityName": "100 Million Volt Vari",
        "episodeRevealed": 182,
        "description": "A devastating point-blank electrical discharge delivering 100 million volts, one of Enel's most powerful attacks. The user typically teleports to close range before unleashing this technique.",
        "severity": "MAJOR",
        "firstUseContext": "Enel uses this technique at point-blank range in desperation after his previous attacks fail to harm Luffy."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Complete ineffectiveness against rubber",
        "episodeRevealed": 182,
        "severity": "ULTRA_SECRET",
        "description": "Rubber is a natural insulator that does not conduct electricity. Users of the Gomu Gomu no Mi are completely immune to all electrical attacks from the Goro Goro no Mi, making them the natural enemy of lightning users."
      },
      {
        "weakness": "Logia intangibility nullified by rubber contact",
        "episodeRevealed": 182,
        "severity": "CRITICAL",
        "description": "Despite being a Logia user, the Goro Goro no Mi user can be physically touched and harmed by rubber due to rubber's insulating properties, bypassing their normal intangibility."
      }
    ],
    "strengths": [],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "VERY_HIGH"
  }
]
