[
  {
    "name": {
      "english": "Gas-Gas Fruit",
      "japanese": "ガスガスの実",
      "romanized": "Gasu Gasu no Mi"
    },
    "type": "LOGIA",
    "debutEpisode": 581,
    "debutChapter": 658,
    "description": "A Logia-type Devil Fruit that allows the user to create, control, and transform into various gases. The user can manipulate the air itself, removing oxygen or creating explosive gas attacks.",
    "episodeAppearances": [600],
    "users": [
      {
        "characterId": "caesar-clown",
        "episodeStart": 581,
        "episodeEnd": "present",
        "circumstances": "Caesar Clown is the current user of this Devil Fruit"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Oxygen Removal",
        "episodeRevealed": 600,
        "description": "Caesar can remove oxygen from the air around his targets, causing them to suffocate. This demonstrates his precise control over the composition of gases in a specific area.",
        "severity": "MAJOR",
        "firstUseContext": "Caesar removes oxygen to suffocate Nami and Usopp, preventing them from protecting the children. This shows his willingness to kill and the lethal applications of his gas manipulation."
      },
      {
        "abilityName": "Gastanet",
        "episodeRevealed": 600,
        "description": "Caesar fills a pair of castanets with highly explosive gas and claps them together to create a massive explosion. The technique is named after the castanets used to perform it.",
        "severity": "MAJOR",
        "firstUseContext": "Caesar uses Gastanet to defeat Brownbeard when he tries to intervene, then uses it again to knock out Nami and Usopp. The explosions are powerful enough to incapacitate opponents instantly while causing no harm to Caesar himself."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Logia weaknesses - Haki and Seastone",
        "episodeRevealed": null,
        "severity": "MAJOR"
      },
      {
        "weakness": "Vulnerable when his gas body is contained or compressed",
        "episodeRevealed": null,
        "severity": "MINOR"
      }
    ],
    "strengths": [
      {
        "strength": "Complete control over gases and air composition",
        "episodeRevealed": 600,
        "description": "Caesar can manipulate the very air people breathe, making him extremely dangerous in any environment.",
        "severity": "MAJOR"
      },
      {
        "strength": "Can create explosive gas attacks",
        "episodeRevealed": 600,
        "description": "Caesar can weaponize gases to create powerful explosions.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "HIGH"
  }
]
