[
  {
    "id": "theory-ep598-001",
    "title": "Kin'emon and Momonosuke Are Time Travelers",
    "summary": "Theory that Kin'emon, Momonosuke, and other samurai from Wano traveled through time from 20 years in the past using the Toki Toki no Mi Devil Fruit power.",
    "fullText": "Fans theorized after Kin'emon's introduction in episode 598 that there was something unusual about him and Momonosuke. The theory suggested that Kin'emon and his companions, including Momonosuke, somehow jumped from the past to the present timeline. This was supported by subtle hints like Momonosuke claiming to have met Gol D. Roger despite being only 8 years old. The theory proposed that Kozuki Toki, possessor of the Toki Toki no Mi (Time-Time Fruit), sent them 20 years into the future to escape danger and fulfill a prophecy. This theory was later confirmed during the Wano arc, revealing that Toki sent Momonosuke and four of the Nine Red Scabbards (Kin'emon, Raizo, Kanjuro, and Kikunojo) forward in time to escape Kaido's attack on Oden Castle.",
    "author": "One Piece Community",
    "source": {
      "url": "https://comicbook.com/anime/news/one-piece-episode-909-time-travel-bombshell-akazaya-nine/",
      "title": "One Piece Drops Huge Time Travel Bombshell",
      "platform": "ComicBook.com",
      "accessedAt": "2026-01-04"
    },
    "postedDate": "2013-06-02",
    "episodeRange": [598, 909],
    "minEpisode": 598,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 909
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["kin'emon", "momonosuke", "kozuki-toki", "kozuki-oden"],
    "relatedLocations": ["wano-country"],
    "relatedEvents": ["ep598-event-010", "ep909-event-time-travel-reveal"],
    "tags": ["time-travel", "wano", "toki-toki-no-mi", "momonosuke", "confirmed-theory"]
  },
  {
    "id": "theory-ep598-002",
    "title": "Law Was Intended to be the Third Corazon",
    "summary": "Theory that Doflamingo reserved the 'Heart' seat (Corazon position) in the Donquixote Pirates for Trafalgar Law, making the heart subplot in episode 598 symbolically significant.",
    "fullText": "This theory suggests that Doflamingo always intended for Law to return and take the position of 'Third Corazon' in the Donquixote Pirates. Vergo was the first Corazon, followed by Donquixote Rosinante (the second). After Rosinante's death, Doflamingo left the Heart seat vacant, hoping Law would eventually join. The irony of Vergo literally holding Law's heart in episode 598 carries deep symbolic weight - the first Corazon (whose title means 'heart') physically controls Law's heart, while Doflamingo spiritually wants Law's allegiance as the third heart of his organization. Law naming his crew the 'Heart Pirates' may reference this connection. This theory adds layers to the power dynamic shown in episode 598 where Vergo uses Law's heart against him.",
    "author": "One Piece Theorists",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Forum:Trafalgar_Law_%26_Cora_Theory",
      "title": "Forum: Trafalgar Law & Cora Theory",
      "platform": "One Piece Wiki",
      "accessedAt": "2026-01-04"
    },
    "postedDate": "2013-06-02",
    "episodeRange": [598, 702],
    "minEpisode": 598,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 750
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["trafalgar-law", "vergo", "donquixote-doflamingo", "donquixote-rosinante"],
    "relatedLocations": [],
    "relatedEvents": ["ep598-event-001"],
    "tags": ["donquixote-pirates", "corazon", "heart-symbolism", "law", "confirmed-theory"]
  },
  {
    "id": "theory-ep598-003",
    "title": "Zoro Will Learn Fire-Cutting from Kin'emon",
    "summary": "Theory that Zoro's interest in Kin'emon's Foxfire Style in episode 598 foreshadowed him learning to cut fire, which he later uses against powerful opponents.",
    "fullText": "When Zoro witnessed Kin'emon's Foxfire Style in episode 598, his immediate interest sparked a theory among fans that he would eventually learn this technique. In the episode, Zoro specifically comments on wanting to see more of the technique. Fans theorized that Zoro, known for observing and adapting techniques he sees, would incorporate fire-cutting into his arsenal. This proved true during the Wano arc when Zoro demonstrated the ability to cut through fire using a technique he learned from observing Kin'emon. He used it to cut Kaido's Bolo Breath and later incorporated it into his King of Hell Three Sword Style to defeat King. The seed planted in episode 598 bore fruit hundreds of episodes later.",
    "author": "One Piece Community",
    "source": {
      "url": "https://screenrant.com/one-piece-zoro-steals-ally-techniques/",
      "title": "One Piece: Zoro Just Revealed He Can Steal His Allies' Techniques",
      "platform": "ScreenRant",
      "accessedAt": "2026-01-04"
    },
    "postedDate": "2013-06-02",
    "episodeRange": [598, 1033],
    "minEpisode": 598,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1050
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["zoro", "kin'emon"],
    "relatedLocations": ["punk-hazard", "wano-country"],
    "relatedEvents": ["ep598-event-009", "ep598-event-011"],
    "tags": ["zoro", "foxfire-style", "technique", "foreshadowing", "confirmed-theory"]
  },
  {
    "id": "theory-ep598-004",
    "title": "Wano Country Will Be a Major Arc",
    "summary": "Theory that the mention of Wano Country in episode 598 through Kin'emon foreshadowed a major future arc centered on that isolated nation.",
    "fullText": "When Kin'emon introduced himself as a samurai from the Land of Wano in episode 598, fans immediately theorized that Wano Country would become a significant location in One Piece's story. The mysterious closed-off country of samurai, combined with Kin'emon's desperate mission to rescue Momonosuke, suggested deeper political intrigue and conflict. Fans predicted that the Straw Hats would eventually travel to Wano and become involved in its internal conflicts. This theory proved correct when the Wano Country arc became one of the longest and most important arcs in the series, spanning from episode 892 onwards, dealing with the defeat of Kaido and the liberation of Wano from tyranny.",
    "author": "One Piece Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_598",
      "title": "Episode 598 - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2026-01-04"
    },
    "postedDate": "2013-06-02",
    "episodeRange": [598, 1085],
    "minEpisode": 598,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1085
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["kin'emon", "momonosuke"],
    "relatedLocations": ["wano-country"],
    "relatedEvents": ["ep598-event-008", "ep598-event-012"],
    "tags": ["wano", "arc-prediction", "world-building", "confirmed-theory"]
  }
]
