[
  {
    "name": {
      "english": "Marineford",
      "japanese": "マリンフォード",
      "romanized": "Marinfōdo"
    },
    "type": "ISLAND",
    "debutEpisode": 461,
    "debutChapter": 550,
    "episodeAppearances": [481],
    "region": "Paradise",
    "sea": "Grand Line",
    "controlledBy": "Marines/World Government",
    "keyEvents": [
      {
        "episodeNumber": 481,
        "eventId": "ep481-event-001",
        "description": "Ace and Luffy fight through Marine forces across Marineford as they attempt to escape.",
        "significance": "The battlefield becomes a proving ground for the brothers' coordinated combat abilities."
      },
      {
        "episodeNumber": 481,
        "eventId": "ep481-event-003",
        "description": "Admiral Aokiji confronts Ace and Luffy, launching a massive ice attack across the plaza.",
        "significance": "Shows the scale of Admiral-level combat and the destruction it causes to the environment."
      },
      {
        "episodeNumber": 481,
        "eventId": "ep481-event-004",
        "description": "Squard attempts to ram his ship into Marineford's defenses to create a diversion.",
        "significance": "Demonstrates the physical fortifications of Marineford and the pirates' desperation to escape."
      },
      {
        "episodeNumber": 481,
        "eventId": "ep481-event-006",
        "description": "Whitebeard delivers his final captain's order at Marineford, choosing to stay behind while his crew escapes.",
        "significance": "Marineford becomes the site of Whitebeard's last stand and his legacy-defining moment."
      }
    ],
    "description": "Marine Headquarters, the center of Marine power in the One Piece world. Currently the battlefield for the Summit War between the Marines and Whitebeard Pirates.",
    "culturalSignificance": "Marineford represents the strength and authority of the World Government. The war taking place here symbolizes the clash between the old era of pirates (Whitebeard) and the established world order.",
    "statusChanges": []
  }
]
