[
  {
    "name": {
      "english": "Marineford",
      "japanese": "マリンフォード",
      "romanized": "Marinfōdo"
    },
    "debutEpisode": 151,
    "debutChapter": 234,
    "episodeAppearances": [466],
    "locationType": "MILITARY_FORTRESS",
    "parentLocation": null,
    "keyEvents": [
      {
        "episodeNumber": 466,
        "eventId": "ep466-event-001",
        "title": "Luffy and Impel Down Escapees Arrive",
        "description": "Luffy and 240+ escaped prisoners from Impel Down crash into the battlefield at Marineford on a stolen Marine battleship.",
        "significance": "The arrival of powerful allies completely shifts the dynamics of the war and brings hope to the rescue mission for Ace."
      },
      {
        "episodeNumber": 466,
        "eventId": "ep466-event-009",
        "title": "Luffy Meets Whitebeard",
        "description": "Luffy and Whitebeard meet face-to-face for the first time on the battlefield, with Whitebeard recognizing Luffy's straw hat.",
        "significance": "A historic meeting between the future Pirate King and one of the Four Emperors."
      },
      {
        "episodeNumber": 466,
        "eventId": "ep466-event-011",
        "title": "Luffy Declares He Will Become Pirate King",
        "description": "Luffy boldly declares his intention to become Pirate King directly to Whitebeard in front of the entire battlefield.",
        "significance": "One of the most audacious declarations in the series, shocking everyone present including the most powerful individuals in the world."
      },
      {
        "episodeNumber": 466,
        "eventId": "ep466-event-014",
        "title": "Jinbe Resigns from the Shichibukai",
        "description": "Jinbe formally announces his resignation from the Seven Warlords of the Sea to Fleet Admiral Sengoku.",
        "significance": "A significant political move that weakens the World Government's power structure."
      }
    ],
    "description": "Marineford is the former base of Marine Headquarters, a massive fortress island in Paradise. It serves as the location for the execution of Portgas D. Ace and the subsequent war between the Whitebeard Pirates and the Marines.",
    "climate": "Temperate ocean climate",
    "inhabitants": ["Marines", "Fleet Admiral Sengoku", "Three Admirals", "Vice Admirals", "Marine soldiers"],
    "firstMentionedEpisode": 151,
    "currentStatus": "Active war zone"
  }
]
