[
  {
    "name": {
      "english": "Shirahoshi",
      "japanese": "しらほし",
      "romanized": "Shirahoshi"
    },
    "episodeAppearances": [553],
    "keyMoments": [
      {
        "episodeNumber": 553,
        "eventId": "ep553-event-001",
        "momentType": "BACKSTORY_REVEAL",
        "title": "Reveals the Truth About Otohime's Killer",
        "description": "Shirahoshi publicly reveals that Megalo witnessed Hody Jones shooting Queen Otohime ten years ago, exposing the truth that Hody framed a human pirate for the assassination.",
        "significance": "This is a pivotal moment showing Shirahoshi's incredible strength and marks her breaking the silence she maintained for ten years. It exposes Hody's manipulation and deception to all of Fish-Man Island.",
        "timestamp": "05:30",
        "quote": "Megalo witnessed everything that happened on that fateful day. He told me because he was part of Neptune's army and saw it all."
      },
      {
        "episodeNumber": 553,
        "eventId": "ep553-event-002",
        "momentType": "BACKSTORY_REVEAL",
        "title": "Explains Her Promise to Queen Otohime",
        "description": "Shirahoshi recounts her mother's dying wish that she not harbor hatred toward her killer. Despite knowing the truth since age six, she honored this promise for ten years.",
        "significance": "Demonstrates Shirahoshi's emotional maturity and commitment to her mother's ideals of peace and forgiveness. Shows her character is far stronger than her fearful demeanor suggests.",
        "timestamp": "08:15",
        "quote": "Mother told me not to bear any grudge towards my killer. I promised her, and I've kept that secret ever since."
      }
    ],
    "reveals": [
      {
        "infoType": "SECRET",
        "information": "Shirahoshi has known that Hody Jones killed her mother for ten years but kept it secret to honor her mother's wish not to harbor hatred",
        "episodeRevealed": 553,
        "severity": "CRITICAL"
      }
    ]
  },
  {
    "name": {
      "english": "Monkey D. Luffy",
      "japanese": "モンキー・D・ルフィ",
      "romanized": "Monkī Dī Rufi"
    },
    "episodeAppearances": [553],
    "keyMoments": [
      {
        "episodeNumber": 553,
        "eventId": "ep553-event-005",
        "momentType": "FIRST_APPEARANCE",
        "title": "Emerges from Megalo's Mouth",
        "description": "Luffy dramatically emerges from inside Megalo's mouth onto Gyoncorde Plaza, having been hidden there as part of Jinbe's rescue plan.",
        "significance": "This is the climactic hero entrance that the entire arc has been building toward, fulfilling the citizens' desperate hope for salvation.",
        "timestamp": "14:25",
        "quote": ""
      },
      {
        "episodeNumber": 553,
        "eventId": "ep553-event-006",
        "momentType": "BATTLE_START",
        "title": "Kicks Hody with Gear 2",
        "description": "Luffy activates Gear Second and delivers a powerful kick to Hody Jones, sending him flying through the plaza walls in his first direct attack on the antagonist.",
        "significance": "Showcases Luffy's increased strength after the two-year time skip and marks the beginning of the final battle. The animation quality of this moment was particularly praised.",
        "timestamp": "15:10",
        "quote": ""
      },
      {
        "episodeNumber": 553,
        "eventId": "ep553-event-010",
        "momentType": "CULTURAL_MOMENT",
        "title": "Asks the Citizens: Friend or Foe?",
        "description": "Standing before the assembled citizens with his crew, Luffy poses the question of whether the Straw Hats are friends or enemies to Fish-Man Island, leaving the decision to the people.",
        "significance": "Shows Luffy's maturity in understanding that true alliance must be chosen freely. Addresses the core theme of trust between species.",
        "timestamp": "20:30",
        "quote": "Are we friends or foes? That's for you to decide!"
      }
    ],
    "abilities": [
      {
        "abilityName": "Gear Second",
        "abilityType": "DEVIL_FRUIT",
        "episodeFirstUsed": 553,
        "description": "Luffy uses Gear Second to enhance his speed and power, delivering a devastating kick to Hody Jones."
      }
    ],
    "reveals": []
  },
  {
    "name": {
      "english": "Hody Jones",
      "japanese": "ホーディ・ジョーンズ",
      "romanized": "Hōdi Jōnzu"
    },
    "episodeAppearances": [553],
    "keyMoments": [
      {
        "episodeNumber": 553,
        "eventId": "ep553-event-001",
        "momentType": "BACKSTORY_REVEAL",
        "title": "Exposed as Queen Otohime's True Killer",
        "description": "Shirahoshi reveals that Hody Jones assassinated Queen Otohime and framed a human pirate for the crime, exposing his deception to all of Fish-Man Island.",
        "significance": "This revelation exposes Hody's manipulation and shows that he manufactured the hatred and conflict between humans and fish-men for his own purposes.",
        "timestamp": "05:30",
        "quote": ""
      },
      {
        "episodeNumber": 553,
        "eventId": "ep553-event-003",
        "momentType": "MAJOR_DECISION",
        "title": "Decides to Execute Neptune Immediately",
        "description": "After being exposed, Hody mocks Shirahoshi and decides to execute King Neptune ahead of schedule rather than waiting.",
        "significance": "Shows Hody's cruelty and contempt for the ideals of peace. This decision forces Luffy's intervention.",
        "timestamp": "10:45",
        "quote": "How foolish! Your actions were meaningless. I'll kill the king right now!"
      }
    ],
    "reveals": [
      {
        "infoType": "CRIME",
        "information": "Hody Jones killed Queen Otohime ten years ago and framed a human pirate for the assassination",
        "episodeRevealed": 553,
        "severity": "CRITICAL"
      }
    ]
  },
  {
    "name": {
      "english": "Megalo",
      "japanese": "メガロ",
      "romanized": "Megaro"
    },
    "episodeAppearances": [553],
    "keyMoments": [
      {
        "episodeNumber": 553,
        "eventId": "ep553-event-001",
        "momentType": "BACKSTORY_REVEAL",
        "title": "Revealed as Witness to Otohime's Assassination",
        "description": "It's revealed that Megalo, as a former Neptune Army pet, witnessed Hody Jones shooting Queen Otohime and told Shirahoshi the truth in secret.",
        "significance": "Megalo's testimony (through Shirahoshi) is the key evidence that exposes Hody's crime and the decade-long deception.",
        "timestamp": "05:30",
        "quote": ""
      },
      {
        "episodeNumber": 553,
        "eventId": "ep553-event-005",
        "momentType": "FIRST_APPEARANCE",
        "title": "Spits Out Luffy at the Critical Moment",
        "description": "Megalo struggles for a few moments before spitting Luffy out onto Gyoncorde Plaza, revealing that he had been hiding Luffy inside his mouth as part of Jinbe's rescue plan.",
        "significance": "Megalo plays a crucial tactical role in the rescue operation, demonstrating his loyalty to Shirahoshi and the kingdom.",
        "timestamp": "14:25",
        "quote": ""
      }
    ],
    "reveals": [
      {
        "infoType": "BACKSTORY",
        "information": "Megalo witnessed Hody Jones assassinating Queen Otohime ten years ago and told Shirahoshi",
        "episodeRevealed": 553,
        "severity": "CRITICAL"
      }
    ]
  }
]
