[
  {
    "name": {
      "english": "Straw Hat Pirates",
      "japanese": "麦わらの一味",
      "romanized": "Mugiwara no Ichimi"
    },
    "episodeAppearances": [553],
    "keyMoments": [
      {
        "episodeNumber": 553,
        "eventId": "ep553-event-007",
        "momentType": "LOCATION_ARRIVAL",
        "title": "Full Crew Reunites at Gyoncorde Plaza",
        "description": "The entire Straw Hat crew assembles together at Gyoncorde Plaza for the first time since arriving at Fish-Man Island. The Thousand Sunny arrives carrying the crew members who execute Jinbe's coordinated rescue plan.",
        "significance": "This marks the first time the complete crew is together on Fish-Man Island and demonstrates their coordinated teamwork in the rescue operation.",
        "timestamp": "17:45"
      },
      {
        "episodeNumber": 553,
        "eventId": "ep553-event-010",
        "momentType": "CULTURAL_MOMENT",
        "title": "Luffy Poses the Friend or Foe Question",
        "description": "With his crew assembled, Luffy asks the citizens of Fish-Man Island to decide whether the Straw Hats are friends or enemies to the island.",
        "significance": "Shows the crew's respect for the autonomy of the Fish-Man Island citizens and addresses the theme of choosing one's allies freely.",
        "timestamp": "20:30"
      }
    ]
  },
  {
    "name": {
      "english": "New Fish-Man Pirates",
      "japanese": "新魚人海賊団",
      "romanized": "Shin Gyojin Kaizokudan"
    },
    "episodeAppearances": [553],
    "keyMoments": [
      {
        "episodeNumber": 553,
        "eventId": "ep553-event-001",
        "momentType": "BACKSTORY_REVEAL",
        "title": "Captain Hody Exposed as Queen Otohime's Killer",
        "description": "The crew's captain, Hody Jones, is publicly exposed as the one who assassinated Queen Otohime and framed a human pirate for the crime.",
        "significance": "This revelation undermines the ideological foundation of Hody's crew, which was built on hatred of humans supposedly justified by a human killing their queen.",
        "timestamp": "05:30"
      },
      {
        "episodeNumber": 553,
        "eventId": "ep553-event-007",
        "momentType": "BATTLE_START",
        "title": "Attacked by the Thousand Sunny's Gaon Cannon",
        "description": "The New Fish-Man Pirates' forces are attacked when the Thousand Sunny fires its Gaon Cannon at them during the rescue operation.",
        "significance": "Marks the beginning of the final battle between the New Fish-Man Pirates and the Straw Hats.",
        "timestamp": "17:45"
      }
    ]
  }
]
