[
  {
    "name": {
      "english": "Sand-Sand Fruit",
      "japanese": "スナスナの実",
      "romanized": "Suna Suna no Mi"
    },
    "type": "LOGIA",
    "debutEpisode": 76,
    "debutChapter": 170,
    "description": "Grants the user the ability to create, control, and transform into sand at will. As a Logia type, the user can become intangible by turning their body into sand.",
    "episodeAppearances": [110],
    "users": [
      {
        "characterId": "crocodile",
        "episodeStart": 76,
        "episodeEnd": "present",
        "circumstances": "Crocodile consumed the fruit at some point before the series"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Desert Spada",
        "episodeRevealed": 110,
        "description": "A blade of fast-moving sand that cuts through the ground like a torpedo, sharp enough to slice opponents in half. Anything hit by the sand trail is drained of all moisture.",
        "severity": "MAJOR",
        "firstUseContext": "Crocodile uses it as an offensive attack against Luffy during their first battle, demonstrating both cutting power and dehydration ability."
      },
      {
        "abilityName": "Desert Girasole",
        "episodeRevealed": 110,
        "description": "Crocodile stabs the ground, causing the area in front of him to collapse and create a massive sinkhole of quicksand that sucks in and buries anything caught in it. Can only be used in desert terrain.",
        "severity": "MAJOR",
        "firstUseContext": "Used to trap Luffy in quicksand during their battle, showcasing Crocodile's mastery over the desert environment."
      },
      {
        "abilityName": "Barchan",
        "episodeRevealed": 110,
        "description": "Creates crescent-shaped sand dune formations for attack or defense, demonstrating versatile sand manipulation.",
        "severity": "MAJOR",
        "firstUseContext": "Demonstrated during the battle with Luffy as part of Crocodile's diverse arsenal of sand-based techniques."
      },
      {
        "abilityName": "Logia Intangibility",
        "episodeRevealed": 110,
        "description": "As a Logia user, Crocodile can transform his body into sand, allowing physical attacks to pass harmlessly through him.",
        "severity": "CRITICAL",
        "firstUseContext": "This is the first time Luffy encounters Logia intangibility in serious combat. All of Luffy's physical attacks phase through Crocodile's sand body."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Water and moisture solidify sand body",
        "episodeRevealed": 110,
        "severity": "CRITICAL",
        "description": "When Crocodile's sand body comes into contact with water or any moisture, it solidifies and becomes tangible, negating his Logia intangibility. This is an elemental weakness specific to sand beyond the standard Devil Fruit weakness."
      }
    ],
    "strengths": [
      {
        "strength": "Complete mastery over desert environments",
        "episodeRevealed": 110,
        "description": "In desert terrain, Crocodile can manipulate the environment itself, creating massive sinkholes and using the abundant sand as an unlimited weapon.",
        "severity": "MAJOR"
      },
      {
        "strength": "Dehydration ability",
        "episodeRevealed": 110,
        "description": "Crocodile can drain moisture from anything he touches with his sand, including living beings and the environment.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "VERY_HIGH"
  },
  {
    "name": {
      "english": "Gum-Gum Fruit",
      "japanese": "ゴムゴムの実",
      "romanized": "Gomu Gomu no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 1,
    "debutChapter": 1,
    "description": "Grants the user's body the properties of rubber, allowing them to stretch and become immune to blunt attacks and electricity.",
    "episodeAppearances": [110],
    "users": [
      {
        "characterId": "luffy",
        "episodeStart": 1,
        "episodeEnd": "present",
        "circumstances": "Luffy accidentally ate the fruit as a child"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Gomu Gomu no Baku Baku",
        "episodeRevealed": 110,
        "description": "Luffy stretches his mouth wide open to chomp at his opponent, similar to Wapol's Baku Baku no Mi technique. The attack attempts to bite or contain the opponent in Luffy's mouth.",
        "severity": "MINOR",
        "firstUseContext": "Luffy uses it to attack Crocodile during their battle, copying the chomping technique from Wapol. Crocodile dodges but is momentarily infuriated by the ridiculous attack."
      }
    ],
    "weaknesses": [],
    "strengths": [],
    "awakening": null,
    "rarity": "COMMON",
    "powerTier": "HIGH"
  }
]
