[
  {
    "name": {
      "english": "Clone-Clone Fruit",
      "japanese": "マネマネの実",
      "romanized": "Mane Mane no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 89,
    "debutChapter": 155,
    "episodeAppearances": [116],
    "currentUser": "bon-clay",
    "previousUsers": [],
    "awakened": false,
    "abilities": [
      {
        "abilityName": "Perfect Physical Transformation",
        "description": "User can transform their entire physical appearance into an exact copy of anyone whose face they have touched with their right hand, including voice, body size, and all physical traits.",
        "episodeFirstSeen": 89,
        "limitations": ["Does not copy the target's abilities or strength", "Must physically touch the target's face first"]
      },
      {
        "abilityName": "Transformation Reversal",
        "description": "User reverts to original form by touching their own face with their left hand.",
        "episodeFirstSeen": 116,
        "limitations": []
      },
      {
        "abilityName": "Memory Storage",
        "description": "User can store and recall transformations of people they have touched in the past, cycling through their 'saved' appearances.",
        "episodeFirstSeen": 89,
        "limitations": []
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 116,
        "eventId": "ep116-event-007",
        "title": "Used to Exploit Sanji's Weakness",
        "description": "Mr. 2 transforms into Nami to take advantage of Sanji's chivalrous nature, completely paralyzing him from attacking.",
        "significance": "Demonstrates the psychological warfare potential of the fruit beyond simple deception.",
        "timestamp": "15:30"
      },
      {
        "episodeNumber": 116,
        "eventId": "ep116-event-010",
        "title": "Combat Limitation Revealed",
        "description": "Sanji discovers that Mr. 2 cannot properly execute his Okama Kenpo techniques while transformed, requiring him to revert to original form for martial arts.",
        "significance": "Reveals a critical weakness in the fruit's combat application - the user's own fighting style requires their original body form.",
        "timestamp": "20:10"
      },
      {
        "episodeNumber": 116,
        "eventId": "ep116-event-011",
        "title": "Transformation Mechanic Exploited",
        "description": "Sanji tricks Mr. 2 into touching his left cheek, forcing an involuntary transformation reversal that creates an opening for attack.",
        "significance": "Shows how the fruit's specific activation mechanics can be used against the user.",
        "timestamp": "21:30"
      }
    ],
    "reveals": [
      {
        "infoType": "LIMITATION",
        "information": "User cannot effectively use their own martial arts techniques while transformed into someone else",
        "episodeRevealed": 116,
        "severity": "MAJOR"
      },
      {
        "infoType": "MECHANIC",
        "information": "Left cheek touch specifically triggers transformation reversal to original form",
        "episodeRevealed": 116,
        "severity": "MAJOR"
      },
      {
        "infoType": "TACTICAL_USE",
        "information": "Can be used for psychological warfare by transforming into people the opponent cannot bring themselves to harm",
        "episodeRevealed": 116,
        "severity": "MAJOR"
      }
    ],
    "strengths": [
      "Perfect infiltration and espionage capabilities",
      "Psychological warfare through strategic transformations",
      "Can deceive even those close to the impersonated person",
      "Unlimited storage of transformation targets"
    ],
    "weaknesses": [
      "Does not grant the copied person's abilities or strength",
      "User's own combat style may be incompatible with transformed body",
      "Transformation mechanics (left cheek touch) can be exploited",
      "Standard Devil Fruit weaknesses (sea water, Seastone)"
    ]
  }
]
