[
  {
    "name": {
      "english": "Mark-Mark Fruit",
      "japanese": "マトマトの実",
      "romanized": "Mato Mato no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 540,
    "debutChapter": 620,
    "description": "Allows the user to mark targets by touching them with their hands. Any object thrown with the same hand will automatically lock onto and chase that target until it hits them or is stopped by an obstacle.",
    "episodeAppearances": [546],
    "users": [
      {
        "characterId": "vander-decken-ix",
        "episodeStart": 540,
        "episodeEnd": "present",
        "circumstances": "Vander Decken IX consumed the fruit at an unknown time before the series."
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Target Marking - Shirahoshi",
        "episodeRevealed": 546,
        "description": "Vander Decken IX marks Shirahoshi with his right hand during the chaos of Queen Otohime's assassination. This allows him to target her with thrown objects from any distance for years to come.",
        "severity": "MAJOR",
        "firstUseContext": "Decken takes advantage of Shirahoshi's shock and distraction during her mother's death to mark the young princess, condemning her to years of harassment."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 540,
        "severity": "MAJOR"
      },
      {
        "weakness": "User can only mark as many targets as they have hands (two for most people)",
        "episodeRevealed": 546,
        "severity": "MINOR"
      },
      {
        "weakness": "If the user touches something else with that hand, the previous mark is lost",
        "episodeRevealed": 546,
        "severity": "MINOR"
      }
    ],
    "strengths": [
      {
        "strength": "Marked targets can be tracked and hit from any distance",
        "episodeRevealed": 546,
        "description": "Objects thrown at marked targets will chase them relentlessly, making it nearly impossible to escape.",
        "severity": "MAJOR"
      },
      {
        "strength": "The mark persists indefinitely as long as the user doesn't touch something else with that hand",
        "episodeRevealed": 546,
        "description": "Vander Decken keeps his right hand marked on Shirahoshi for ten years, showing the mark's permanence.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "UNCOMMON",
    "powerTier": "MEDIUM"
  }
]
