[
  {
    "id": "hana-hana-no-mi",
    "names": {
      "primary": "Hana Hana no Mi",
      "english": "Flower-Flower Fruit",
      "translated": "Bloom-Bloom Fruit",
      "japanese": "ハナハナの実",
      "romanized": "Hana Hana no Mi"
    },
    "type": "Paramecia",
    "debutEpisode": 67,
    "episodeAppearances": [67],
    "currentUser": {
      "characterId": "nico-robin",
      "startEpisode": 67
    },
    "previousUsers": [],
    "abilities": [
      {
        "name": "Body Part Sprouting",
        "description": "Allows the user to replicate and sprout pieces of their body from the surface of any object or living thing. The user can manipulate these sprouted body parts remotely as if they were extensions of their original limbs.",
        "revealedInEpisode": 67
      },
      {
        "name": "Dos Fleur",
        "description": "A technique that sprouts two arms from a target's body or surface. In this episode, Robin uses it to sprout arms from Sanji and Usopp's bodies to flip them over.",
        "revealedInEpisode": 67
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 67,
        "timestamp": "09:10",
        "eventId": "ep067-event-005",
        "description": "First demonstration of the Hana Hana no Mi in the anime. Miss All Sunday effortlessly flips Sanji and Usopp using sprouted arms, shocking the Straw Hat crew.",
        "significance": "The debut of one of the most unique and versatile Devil Fruit abilities in One Piece. This power will become iconic as Robin develops increasingly powerful and creative techniques."
      }
    ],
    "reveals": [
      {
        "episodeNumber": 67,
        "type": "USER",
        "content": "Miss All Sunday (Nico Robin) is revealed to be the user of the Hana Hana no Mi."
      },
      {
        "episodeNumber": 67,
        "type": "ABILITY",
        "content": "The fruit allows the user to sprout body parts from any surface and manipulate them remotely."
      },
      {
        "episodeNumber": 67,
        "type": "TECHNIQUE",
        "content": "Dos Fleur technique demonstrated - sprouts two arms to manipulate targets."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit Weakness",
        "description": "User cannot swim and is weakened by seawater and Seastone.",
        "revealedInEpisode": 67
      },
      {
        "weakness": "Shared Damage",
        "description": "Any damage inflicted on sprouted body parts is also felt by the user's real body, making the user vulnerable if sprouted parts are attacked.",
        "revealedInEpisode": 67
      }
    ]
  }
]
