[
  {
    "name": {
      "english": "Human-Human Fruit, Model: Buddha",
      "japanese": "ヒトヒトの実 モデル:大仏",
      "romanized": "Hito Hito no Mi, Moderu: Daibutsu"
    },
    "fruitType": "MYTHICAL_ZOAN",
    "debutEpisode": 480,
    "debutChapter": 571,
    "episodeAppearances": [480],
    "description": "A Mythical Zoan-type Devil Fruit that allows the user to transform into a giant golden Buddha (Daibutsu) at will, granting immense size, strength, and the ability to generate powerful shockwaves.",
    "currentUser": {
      "characterId": "sengoku",
      "episodeObtained": null,
      "episodeLost": null,
      "status": "ACTIVE"
    },
    "previousUsers": [],
    "abilities": [
      {
        "abilityName": "Buddha Transformation",
        "description": "The user transforms into a giant golden Buddha figure, significantly increasing their size and physical power.",
        "episodeFirstShown": 480,
        "visualDescription": "Sengoku becomes a massive golden Buddha statue with glowing form."
      },
      {
        "abilityName": "Buddha Shockwave",
        "description": "The user can generate massive shockwave attacks from their palms while in Buddha form, capable of destroying large structures.",
        "episodeFirstShown": 480,
        "visualDescription": "Powerful shockwave emanates from Buddha form's palms, strong enough to destroy the execution platform."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weaknesses",
        "description": "User cannot swim and is weakened by Sea Stone and seawater.",
        "episodeRevealed": 480
      }
    ],
    "awakening": null,
    "keyMoments": [
      {
        "episodeNumber": 480,
        "eventId": "ep480-event-007",
        "momentType": "POWER_REVEAL",
        "title": "First Transformation",
        "description": "Sengoku transforms into his Buddha form for the first time in the series, revealing his Devil Fruit ability to everyone present.",
        "significance": "First reveal of the Fleet Admiral's Devil Fruit power, showing why he holds the highest Marine position.",
        "timestamp": "15:30"
      }
    ],
    "images": [],
    "trivia": [
      "Many Marines claimed they had never seen Sengoku use this power before the Marineford War.",
      "The Daibutsu (Great Buddha) is a common Buddhist statue in Japan, representing enlightenment and wisdom.",
      "This is one of the few Mythical Zoan Devil Fruits shown in the series."
    ]
  }
]
