[
  {
    "id": "theory-ep631-001",
    "title": "Fujitora's Connection to the Revolutionary Army",
    "summary": "A theory that Admiral Fujitora may have connections to Dragon and the Revolutionary Army, which could explain his unique sense of justice and his decision to blind himself.",
    "fullText": "Fans have theorized that Fujitora might be connected to the Revolutionary Army based on his past. Not much is known about his background before becoming an admiral, and his unconventional views on justice align more closely with revolutionary ideals than typical Marine doctrine. The theory suggests that Fujitora may have witnessed atrocities committed by the World Government or Marines, leading him to blind himself and potentially maintain secret ties with Dragon's organization. His willingness to challenge the Warlord system and his sympathy toward oppressed people support this theory.",
    "author": "Fandom Wire",
    "source": {
      "url": "https://fandomwire.com/fujitora-and-dragon-know-each-other-personally-one-piece-theory-might-reveal-why-the-fan-favorite-admiral-blinded-himself-that-ties-him-with-the-revolutionary-army/",
      "title": "Fujitora and Dragon know each other personally: One Piece Theory",
      "platform": "Fandom Wire",
      "accessedAt": "2026-01-15"
    },
    "postedDate": "2023-10-15",
    "episodeRange": [631, 900],
    "minEpisode": 631,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 900
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": ["issho", "dragon"],
    "relatedLocations": ["dressrosa"],
    "relatedEvents": ["ep631-event-001"],
    "tags": ["fujitora", "revolutionary-army", "dragon", "justice", "character-backstory"]
  },
  {
    "id": "theory-ep631-002",
    "title": "Fujitora Blinded Himself After Witnessing Government Atrocities",
    "summary": "The theory that Fujitora deliberately blinded himself after witnessing too many evil acts by the World Government or other powerful entities, choosing not to 'see' the corruption of the world.",
    "fullText": "This widely accepted theory suggests that Fujitora self-inflicted his blindness after seeing too many atrocities in the world. As a military chief of the Aoi Kingdom before it was destroyed by war, he may have witnessed the World Government's darker actions or the horrors of conflict. His statement that he wishes he could see Luffy at the end of Dressrosa suggests he regrets his decision to some degree, but his blindness represents his rejection of a world filled with evil he cannot change through sight alone. Instead, he developed advanced Observation Haki to 'see' people's true nature rather than their appearances.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://wegotthiscovered.com/anime/why-did-fujitora-blind-himself-in-one-piece/",
      "title": "Why Did Fujitora Blind Himself in 'One Piece?'",
      "platform": "We Got This Covered",
      "accessedAt": "2026-01-15"
    },
    "postedDate": "2023-11-10",
    "episodeRange": [631, 750],
    "minEpisode": 631,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 750
    },
    "popularity": {},
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["issho"],
    "relatedLocations": ["dressrosa"],
    "relatedEvents": ["ep631-event-001"],
    "tags": ["fujitora", "backstory", "observation-haki", "character-motivation"]
  },
  {
    "id": "theory-ep631-003",
    "title": "Doflamingo's Mera Mera no Mi Trap to Destroy the Alliance",
    "summary": "The theory that Doflamingo deliberately offered the Mera Mera no Mi as tournament bait to lure Luffy away from Law and destroy their alliance.",
    "fullText": "Fans correctly theorized that Doflamingo's decision to make the Mera Mera no Mi the tournament prize was a calculated trap. By offering Ace's former Devil Fruit, Doflamingo knew Luffy would be emotionally compelled to enter the tournament despite the tactical disadvantages. The goal was to separate Luffy from Law, distract the Straw Hat captain from their original mission to destroy the SMILE factory, and potentially capture or kill him in the Colosseum. The theory also explores why Doflamingo kept the fruit stored away rather than having one of his executives eat it - he was specifically saving it to use against Luffy. Franky recognized it as a trap but encouraged Luffy to go anyway, understanding the emotional significance of Ace's legacy.",
    "author": "One Piece Fan Blog",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/User_blog:AYET/The_Mera_Mera_no_Mi_and_Doflamingo",
      "title": "The Mera Mera no Mi and Doflamingo",
      "platform": "One Piece Wiki - User Blog",
      "accessedAt": "2026-01-15"
    },
    "postedDate": "2014-02-05",
    "episodeRange": [631, 658],
    "minEpisode": 631,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 658
    },
    "popularity": {},
    "status": "CONFIRMED",
    "relatedCharacters": ["doflamingo", "luffy", "law", "diamante"],
    "relatedLocations": ["corrida-colosseum", "dressrosa"],
    "relatedEvents": ["ep631-event-008", "ep631-event-009"],
    "tags": ["doflamingo", "mera-mera-no-mi", "trap", "alliance", "strategy"]
  },
  {
    "id": "theory-ep631-004",
    "title": "Zoro's Closed Eye Inspired by Fujitora",
    "summary": "A theory connecting Zoro's permanently closed left eye to Fujitora's blindness, suggesting Zoro may have intentionally damaged his eye to awaken enhanced Observation Haki.",
    "fullText": "This theory proposes that Zoro's closed eye, which has remained shut since the timeskip, was inspired by or connected to Fujitora's fighting style. Just as Fujitora enhanced his Observation Haki through blindness, Zoro may have intentionally injured or closed his eye to develop similar abilities. The theory gained traction when Zoro first encountered Fujitora in Dressrosa, as fans noted potential parallels in their fighting styles. Some versions suggest Mihawk taught Zoro this technique during their training, while others propose Zoro discovered Fujitora's reputation and attempted to emulate his approach. However, this remains highly speculative with no canonical confirmation.",
    "author": "Fandom Wire",
    "source": {
      "url": "https://fandomwire.com/one-piece-insane-theory-claims-zoro-injured-his-own-eye-to-awaken-an-ability-inspired-by-admiral-fujitora/",
      "title": "One Piece: Insane Theory Claims Zoro Injured His Own Eye to Awaken an Ability Inspired by Admiral Fujitora",
      "platform": "Fandom Wire",
      "accessedAt": "2026-01-15"
    },
    "postedDate": "2023-09-20",
    "episodeRange": [631, 900],
    "minEpisode": 517,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 900
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": ["zoro", "issho", "mihawk"],
    "relatedLocations": ["dressrosa"],
    "relatedEvents": ["ep631-event-001"],
    "tags": ["zoro", "fujitora", "observation-haki", "timeskip-mystery", "eye"]
  }
]
