[
  {
    "name": {
      "english": "Paw-Paw Fruit",
      "japanese": "ニキュニキュの実",
      "romanized": "Nikyu Nikyu no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 376,
    "debutChapter": 484,
    "episodeAppearances": [405],
    "currentUser": "bartholomew-kuma",
    "formerUsers": [],
    "abilities": [
      {
        "abilityName": "Teleportation/Repulsion",
        "episodeFirstShown": 405,
        "description": "When Kuma strikes someone with his paw pads, they are sent flying through the air for three days and three nights to a destination only Kuma knows. The victims travel in a bubble-like sphere during their journey.",
        "limitations": "Only Kuma knows where the victims will land. The journey takes exactly three days.",
        "significance": "This ability is used to scatter the entire Straw Hat crew across the world in episode 405, marking a turning point in the series."
      }
    ],
    "awakening": {
      "isAwakened": false,
      "awakeningEpisode": null,
      "awakeningAbilities": []
    },
    "userProgression": [
      {
        "userName": "bartholomew-kuma",
        "episodeObtained": null,
        "episodeLost": null,
        "status": "CURRENT_USER"
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 405,
        "eventId": "ep405-event-008",
        "momentType": "POWER_REVEAL",
        "title": "Sentomaru Explains Teleportation Mechanics",
        "description": "Sentomaru reveals that when Kuma strikes someone with his paws, they fly for three days to destinations only Kuma knows.",
        "significance": "Provides crucial information about how the Straw Hats were separated and confirms they are alive.",
        "timestamp": "16:45"
      },
      {
        "episodeNumber": 405,
        "eventId": "ep405-event-011",
        "momentType": "LOCATION_DEPARTURE",
        "title": "All Straw Hats Teleported",
        "description": "Kuma uses his Devil Fruit power to send all nine Straw Hat crew members to different locations across the world.",
        "significance": "The most impactful use of the Nikyu Nikyu no Mi in the series, completely changing the story's trajectory.",
        "timestamp": "20:30"
      }
    ],
    "trivia": [
      "The Nikyu Nikyu no Mi's teleportation ability is central to the Sabaody Archipelago Arc's conclusion and sets up the two-year timeskip.",
      "The three-day flight time is a specific detail revealed in this episode.",
      "The bubble-like effect when crew members disappear mirrors the soap bubbles of Sabaody Archipelago."
    ]
  }
]
