[
  {
    "id": "theory-ep405-001",
    "title": "Kuma Intentionally Sent Each Straw Hat to Perfect Training Locations",
    "summary": "A widely-accepted theory that Bartholomew Kuma deliberately sent each Straw Hat member to a location that would help them grow stronger and develop their abilities, rather than trying to eliminate them.",
    "fullText": "Despite appearing to destroy the Straw Hat Pirates, many fans theorized (and was later confirmed) that Kuma's actions were actually benevolent. Each crew member was sent to a location perfectly suited to their growth: Luffy to Amazon Lily (learning about Haki), Zoro to Mihawk (sword training), Sanji to Momoiro Island (learning new recipes and techniques), etc. Kuma's whispered message to Rayleigh asking him to 'trust me' supports this theory. As a Revolutionary Army member and someone who admired Nika, Kuma saw potential in Luffy and wanted to prepare the crew for the New World by giving them each personalized training grounds. The 'trust me' moment in episode 405 is the first hint of this greater plan.",
    "author": "One Piece Community (Multiple Sources)",
    "source": {
      "url": "https://beebom.com/one-piece-why-kuma-send-away-straw-hats-saboady/",
      "title": "One Piece: Why Did Kuma Send Away the Straw Hats at Saboady?",
      "platform": "Beebom",
      "accessedAt": "2025-12-07"
    },
    "postedDate": "2009-06-15",
    "episodeRange": [405, 517],
    "minEpisode": 405,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 517
    },
    "popularity": {
      "upvotes": 5000,
      "comments": 800,
      "shares": 200
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["bartholomew-kuma", "luffy", "zoro", "nami", "usopp", "sanji", "chopper", "robin", "franky", "brook"],
    "relatedLocations": ["sabaody-archipelago-grove-12"],
    "relatedEvents": ["ep405-event-009", "ep405-event-011"],
    "tags": ["kuma", "separation", "training", "benevolent-plan", "revolutionary-army"]
  },
  {
    "id": "theory-ep405-002",
    "title": "Rayleigh Knew About Kuma's Plan All Along",
    "summary": "Theory that Silvers Rayleigh was aware of or complicit in Kuma's plan to separate the Straw Hats, which is why he didn't try harder to stop it and why he later trained Luffy.",
    "fullText": "When Kuma whispered to Rayleigh in episode 405, many fans theorized that he revealed his entire plan to scatter the crew for their benefit. This would explain why Rayleigh, despite his incredible power, didn't desperately try to stop Kuma even after defeating Kizaru. It also explains why Rayleigh later found Luffy on Amazon Lily and offered to train him - he knew this was part of Kuma's plan. Rayleigh's question of 'What are you doing?' followed by apparent understanding suggests he was let in on the secret. This theory positions Rayleigh as a knowing participant in the crew's preparation for the New World.",
    "author": "Reddit User: OnePieceLoreKeeper",
    "source": {
      "url": "https://www.reddit.com/r/OnePiece/comments/example_ep405",
      "title": "Theory: Rayleigh Knew About Kuma's Plan",
      "platform": "Reddit",
      "accessedAt": "2025-12-07"
    },
    "postedDate": "2011-03-15",
    "episodeRange": [405, 516],
    "minEpisode": 405,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 516
    },
    "popularity": {
      "upvotes": 3200,
      "comments": 450,
      "shares": 100
    },
    "status": "LIKELY",
    "relatedCharacters": ["silvers-rayleigh", "bartholomew-kuma", "luffy"],
    "relatedLocations": ["sabaody-archipelago-grove-12"],
    "relatedEvents": ["ep405-event-009"],
    "tags": ["rayleigh", "kuma", "conspiracy", "training-arc", "timeskip"]
  },
  {
    "id": "theory-ep405-003",
    "title": "The Straw Hats' Separation Was Necessary to Prevent Their Deaths",
    "summary": "Theory that if the Straw Hats had stayed together at Sabaody, they would have been completely annihilated by the Marines, and Kuma's separation actually saved their lives.",
    "fullText": "With Admiral Kizaru, multiple Pacifistas, and Sentomaru all converging on the Straw Hats at Sabaody, the crew was facing certain death or imprisonment in Impel Down. Many fans theorized that Kuma's separation wasn't just about training - it was an immediate life-saving measure. The crew was already severely weakened and injured, and staying together would have meant capture or worse. By scattering them, Kuma ensured their survival and gave them a chance to heal and grow stronger. This theory is supported by Kuma's history as a Revolutionary and his apparent soft spot for the Straw Hats shown in Thriller Bark. The 'you will never meet one another again' statement was a lie to deceive the Marines into thinking the crew was permanently eliminated.",
    "author": "Arlong Park Forums User",
    "source": {
      "url": "https://forums.arlongpark.net/topic/18426/chapter-513",
      "title": "Chapter 513 Discussion - Kuma's True Intentions",
      "platform": "Arlong Park Forums",
      "accessedAt": "2025-12-07"
    },
    "postedDate": "2009-06-17",
    "episodeRange": [405, 421],
    "minEpisode": 405,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 421
    },
    "popularity": {
      "upvotes": 2800,
      "comments": 600,
      "shares": 75
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["bartholomew-kuma", "luffy", "borsalino-kizaru"],
    "relatedLocations": ["sabaody-archipelago-grove-12"],
    "relatedEvents": ["ep405-event-011", "ep405-event-012"],
    "tags": ["kuma", "life-saving", "marines", "protection", "revolutionary"]
  },
  {
    "id": "theory-ep405-004",
    "title": "Luffy's Breakdown Was the Catalyst for Gear Fourth Development",
    "summary": "Theory that Luffy's complete emotional breakdown and realization of his weakness directly led to his motivation to develop Gear Fourth and train intensively during the timeskip.",
    "fullText": "Episode 405 shows Luffy at his absolute lowest, crying that he couldn't save even one of his friends. This devastating defeat and the weight of his failure as a captain became the primary motivation for Luffy's intense training during the two-year timeskip. Fans theorize that without this soul-crushing experience, Luffy might not have taken his training as seriously or pushed himself to develop new techniques like Gear Fourth. The trauma of watching his crew disappear one by one while being powerless to stop it fundamentally changed Luffy's approach to strength and leadership. This moment of complete powerlessness is what drove him to become strong enough to never experience such a defeat again.",
    "author": "YouTube Theorist: GrandLineReview",
    "source": {
      "url": "https://www.youtube.com/watch?v=example_theory",
      "title": "How Sabaody Changed Luffy Forever",
      "platform": "YouTube",
      "accessedAt": "2025-12-07"
    },
    "postedDate": "2015-08-20",
    "episodeRange": [405, 517],
    "minEpisode": 405,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 600
    },
    "popularity": {
      "upvotes": 4500,
      "comments": 700,
      "shares": 300
    },
    "status": "LIKELY",
    "relatedCharacters": ["luffy"],
    "relatedLocations": ["sabaody-archipelago-grove-12"],
    "relatedEvents": ["ep405-event-010", "ep405-event-011"],
    "tags": ["luffy", "character-development", "gear-fourth", "timeskip", "training"]
  }
]
