[
  {
    "id": "kuja-arena",
    "name": {
      "english": "Kuja Arena",
      "japanese": "九蛇闘技場",
      "romanized": "Kuja Tōgijō"
    },
    "type": "ARENA",
    "debutEpisode": 413,
    "debutChapter": 519,
    "episodeAppearances": [413],
    "parentLocation": "amazon-lily",
    "description": "A large arena located in Amazon Lily where the Kuja warriors hold combat competitions for public entertainment. The arena has stadium-style seating for spectators and a large open fighting area in the center.",
    "significance": "This is where Luffy battles the Gorgon sisters and unleashes Conqueror's Haki for the first time in front of witnesses. It becomes the site of one of the most important power reveals in the series.",
    "keyEvents": [
      {
        "episodeNumber": 413,
        "eventId": "ep413-event-001",
        "description": "Luffy battles Boa Marigold and Boa Sandersonia in the arena, learning about Haki for the first time.",
        "significance": "Introduction to the arena as a battle location and demonstration of Haki abilities."
      },
      {
        "episodeNumber": 413,
        "eventId": "ep413-event-008",
        "description": "Luffy unleashes Conqueror's Haki in the arena, knocking out many Kuja warriors in the audience.",
        "significance": "The arena becomes the site where Luffy's Supreme King Haki is first officially recognized."
      }
    ],
    "inhabitants": [],
    "controlledBy": "amazon-lily",
    "currentStatus": "ACTIVE",
    "statusHistory": [
      {
        "status": "ACTIVE",
        "episodeStart": 413,
        "episodeEnd": "present",
        "description": "Arena in active use for combat entertainment"
      }
    ],
    "geography": "Located within the mountainous center of Amazon Lily, the arena is surrounded by carved snake statues and situated in a valley within the mountain.",
    "climate": "Calm Belt climate - no wind or storms",
    "culture": "The Kuja use the arena for arranged combat competitions as entertainment, reflecting their warrior culture while maintaining a peaceful coexistence on the island.",
    "notableFeatures": [
      "Stadium seating for large crowds of spectators",
      "Central fighting area large enough for combat",
      "Elevated viewing throne for Boa Hancock",
      "Snake motif architecture consistent with Amazon Lily design"
    ],
    "images": []
  },
  {
    "id": "amazon-lily",
    "name": {
      "english": "Amazon Lily",
      "japanese": "アマゾン・リリー",
      "romanized": "Amazon Rirī"
    },
    "type": "ISLAND",
    "debutEpisode": 408,
    "debutChapter": 514,
    "episodeAppearances": [413],
    "parentLocation": "calm-belt",
    "description": "An island nation located in the Calm Belt, also known as the Island of Women. It is home to the Kuja tribe, a warrior society composed entirely of women. The island features a large mountain carved with snake statues at its center.",
    "significance": "This is where Luffy learns about Haki and unleashes his Conqueror's Haki. It's also where he meets Boa Hancock, who becomes a crucial ally.",
    "keyEvents": [
      {
        "episodeNumber": 413,
        "eventId": "ep413-event-008",
        "description": "Luffy's Conqueror's Haki burst affects the entire arena and shocks the island's inhabitants.",
        "significance": "Amazon Lily becomes the location where Luffy's Supreme King Haki is first recognized and acknowledged."
      }
    ],
    "inhabitants": ["boa-hancock", "boa-sandersonia", "boa-marigold", "marguerite", "sweet-pea", "aphelandra", "kikyo", "nyon"],
    "controlledBy": "kuja-pirates",
    "currentStatus": "ACTIVE",
    "statusHistory": [],
    "geography": "Jungle island in the Calm Belt with a large mountain carved with gigantic snake statues at its center. The village is located in a valley within the mountain.",
    "climate": "Due to location in the Calm Belt, there is no wind or storm ever on Amazon Lily.",
    "culture": "All-female warrior society that has been isolated from men. The Kuja are skilled warriors who can imbue their arrows with Haki. They believe in the Gorgon legend and worship snakes.",
    "notableFeatures": [
      "Located in the Calm Belt, protected by Sea Kings",
      "Giant snake statues carved into the central mountain",
      "Architecture resembling ancient China",
      "Kuja Arena for combat entertainment",
      "No men allowed (until Luffy)"
    ],
    "images": []
  }
]
