[
  {
    "name": {
      "english": "Venom-Venom Fruit",
      "japanese": "ドクドクの実",
      "romanized": "Doku Doku no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 425,
    "debutChapter": 528,
    "description": "Grants the user the ability to generate and control various types of poison, making them a Poison Human. The user can create poison of varying toxicity and lethality.",
    "episodeAppearances": [436],
    "users": [
      {
        "characterId": "magellan",
        "episodeStart": 425,
        "episodeEnd": "present",
        "circumstances": "Magellan is the current user of the Doku Doku no Mi and serves as Warden of Impel Down"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Venom Blowfish (Doku Fugu)",
        "episodeRevealed": 436,
        "description": "Magellan shoots a concentrated poison ball from his mouth as a ranged projectile attack. The poison ball can be dodged but is highly dangerous if it makes contact.",
        "severity": "MAJOR",
        "firstUseContext": "Used against Luffy during their battle on Level 4, forcing him to dodge the deadly projectile."
      },
      {
        "abilityName": "Venom Cloud (Doku Kumo)",
        "episodeRevealed": 436,
        "description": "Magellan breathes out large amounts of poisonous breath, creating a fog-like cover in an area. This poisonous fog not only blurs the sight of any opponent caught within but also slowly weakens them by attacking their nervous system.",
        "severity": "MAJOR",
        "firstUseContext": "Used to disorient and weaken Luffy during their battle, preventing him from fighting effectively."
      },
      {
        "abilityName": "Hydra",
        "episodeRevealed": 436,
        "description": "Magellan creates a massive dragon-like formation of poison with multiple heads that can completely engulf opponents. This is one of his most powerful and devastating techniques.",
        "severity": "MAJOR",
        "firstUseContext": "Summoned against Luffy in Gear Second, completely engulfing him in deadly poison and ultimately defeating him."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 425,
        "severity": "MAJOR"
      },
      {
        "weakness": "User suffers from severe diarrhea due to constant poison exposure, spending significant time in the bathroom",
        "episodeRevealed": 425,
        "severity": "MINOR"
      }
    ],
    "strengths": [
      {
        "strength": "Can create various types of poison with different effects and toxicity levels",
        "episodeRevealed": 436,
        "description": "The versatility of poison creation makes this fruit extremely dangerous in combat.",
        "severity": "MAJOR"
      },
      {
        "strength": "Poison can attack opponents' nervous systems and senses, not just cause physical damage",
        "episodeRevealed": 436,
        "description": "The Venom Cloud technique demonstrates this ability to disorient and disable opponents beyond direct physical harm.",
        "severity": "MAJOR"
      },
      {
        "strength": "Multiple forms of attack - close range, projectile, and area of effect",
        "episodeRevealed": 436,
        "description": "Magellan can adapt his poison abilities for different combat situations with techniques like Hydra, Venom Blowfish, and Venom Cloud.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "VERY_HIGH"
  }
]
