[
  {
    "name": {
      "english": "Tontatta Kingdom",
      "japanese": "トンタッタ王国",
      "romanized": "Tontatta Ōkoku"
    },
    "debutEpisode": 641,
    "debutChapter": 711,
    "episodeAppearances": [641],
    "locationType": "KINGDOM",
    "parentLocation": "Green Bit",
    "geography": "Underground kingdom located beneath the forests of Green Bit, accessible through hidden tunnels and passages. The kingdom features carved chambers, natural cave formations, and dwarf-sized architecture.",
    "climate": "Temperate underground environment, protected from surface weather",
    "population": "Unknown (Tontatta Tribe dwarves)",
    "government": "Monarchy led by a chief",
    "keyEvents": [
      {
        "episodeNumber": 641,
        "eventId": "ep641-event-001",
        "eventType": "LOCATION_ARRIVAL",
        "title": "Robin Awakens in the Tontatta Kingdom",
        "description": "Robin regains consciousness in the underground Tontatta Kingdom after being captured by the dwarves, marking the first appearance of this hidden location.",
        "significance": "First reveal of the Tontatta Kingdom, a secret underground civilization that has existed beneath Green Bit for centuries.",
        "timestamp": "03:15"
      },
      {
        "episodeNumber": 641,
        "eventId": "ep641-event-003",
        "eventType": "CULTURAL_MOMENT",
        "title": "The Tontatta's Legendary Gullibility Revealed",
        "description": "The Tontatta demonstrate their extreme gullibility by immediately trusting Robin's promise not to reveal their kingdom.",
        "significance": "Establishes the Tontatta's defining cultural characteristic and foreshadows how Doflamingo has been exploiting this trait.",
        "timestamp": "06:45"
      }
    ],
    "culturalSignificance": "The Tontatta Kingdom represents an ancient civilization of dwarves who have lived in hiding for generations. Their culture is characterized by extreme trustfulness, superhuman strength despite small size, and deep connection to nature and cultivation.",
    "historicalNotes": "The Tontatta tribe has lived beneath Green Bit for centuries, maintaining their hidden kingdom away from the surface world. They have a tragic history of being exploited due to their gullible nature.",
    "controlledBy": "Tontatta Tribe",
    "status": "ACTIVE",
    "statusHistory": [
      {
        "status": "ACTIVE",
        "episodeStart": 641,
        "episodeEnd": "present",
        "description": "Hidden underground kingdom discovered by Robin and Usopp"
      }
    ],
    "reveals": [
      {
        "infoType": "EXISTENCE",
        "information": "The Tontatta Kingdom exists as a hidden underground civilization beneath Green Bit",
        "episodeRevealed": 641,
        "severity": "MAJOR"
      },
      {
        "infoType": "CULTURE",
        "information": "The Tontatta people are extremely gullible and trusting",
        "episodeRevealed": 641,
        "severity": "MAJOR"
      }
    ]
  }
]
