[
  {
    "id": "gomu-gomu-no-mi",
    "name": "Gomu Gomu no Mi",
    "nameJapanese": "ゴムゴムの実",
    "nameEnglish": "Gum-Gum Fruit",
    "type": "Paramecia",
    "debut": 1,
    "episodeAppearances": [374],
    "currentUser": "luffy",
    "previousUsers": [],
    "keyMoments": [
      {
        "episodeNumber": 374,
        "description": "Luffy uses his rubber body to survive being crushed in Moria's Black Box technique",
        "timestamp": "16:30",
        "significance": "Demonstrates the defensive advantages of being made of rubber against crushing and blunt force attacks"
      },
      {
        "episodeNumber": 374,
        "description": "Luffy combines Gear 2 and Gear 3 for the first time to create Gigant Jet Shell",
        "timestamp": "18:15",
        "significance": "Shows the fruit's versatility and Luffy's innovation in combining different transformations simultaneously"
      }
    ],
    "abilitiesRevealed": [
      {
        "name": "Gomu Gomu no Gigant Jet Shell",
        "description": "A combination technique using both Gear 2's enhanced blood flow for speed and Gear 3's bone inflation for size. Luffy transforms his enlarged torso into a high-velocity projectile attack.",
        "episodeNumber": 374,
        "type": "Combination Technique",
        "limitations": "Extremely taxing on the body, compounding the strain from both Gear 2 and Gear 3. Luffy passes out immediately after using it."
      }
    ],
    "awakening": null
  },
  {
    "id": "kage-kage-no-mi",
    "name": "Kage Kage no Mi",
    "nameJapanese": "カゲカゲの実",
    "nameEnglish": "Shadow-Shadow Fruit",
    "type": "Paramecia",
    "debut": 343,
    "episodeAppearances": [374],
    "currentUser": "gecko-moria",
    "previousUsers": [],
    "keyMoments": [
      {
        "episodeNumber": 374,
        "description": "Moria uses Shadow's Asgard to absorb 1,000 shadows into his body, transforming into a giant",
        "timestamp": "04:30",
        "significance": "Reveals the ultimate technique of the Kage Kage no Mi and its tremendous power potential, though also showing its weakness as the user struggles to maintain control"
      },
      {
        "episodeNumber": 374,
        "description": "Moria creates a Black Box prison using his Brick Bats to trap and crush Luffy",
        "timestamp": "14:50",
        "significance": "Demonstrates another creative application of shadow manipulation beyond just stealing and implanting shadows"
      },
      {
        "episodeNumber": 374,
        "description": "All 1,000 absorbed shadows are released when Moria loses control after being defeated",
        "timestamp": "20:45",
        "significance": "Shows the limitation of Shadow's Asgard - when the user takes significant damage, they cannot maintain control of the shadows"
      }
    ],
    "abilitiesRevealed": [
      {
        "name": "Shadow's Asgard",
        "description": "The ultimate technique of the Kage Kage no Mi. The user absorbs a massive number of shadows into their own body, gaining immense size, strength, and power proportional to the number of shadows absorbed.",
        "episodeNumber": 374,
        "type": "Ultimate Technique",
        "limitations": "The user struggles to maintain consciousness and control with too many shadows. Taking damage causes the shadows to escape. Moria could barely maintain control of 1,000 shadows even before being attacked."
      },
      {
        "name": "Black Box",
        "description": "Moria uses his shadow constructs called Brick Bats to form a box-shaped prison around a target, then crushes it with tremendous force.",
        "episodeNumber": 374,
        "type": "Offensive Technique",
        "limitations": "Ineffective against opponents with special defenses like Luffy's rubber body."
      }
    ],
    "awakening": null
  }
]
