[
  {
    "id": "thriller-bark-god-valley-theory",
    "title": "Thriller Bark is the Former God Valley Island",
    "author": "One Piece Community",
    "source": "https://comicbook.com/anime/news/one-piece-god-valley-thriller-bark-theory/",
    "platform": "ComicBook.com",
    "datePublished": "2024",
    "episodesReferenced": [343, 344, 374, 957],
    "spoilerLevel": "CRITICAL",
    "containsSpoilersBeyondEpisode": 374,
    "theory": "A popular fan theory suggests that Thriller Bark may actually be the former God Valley island. Both locations are said to have come from the West Blue, and the introduction of the General Zombies on Thriller Bark - referred to by Absalom as 'Ancient Warriors' - bear striking similarities to five members of the Rocks Pirates. If Thriller Bark is indeed the former battlefield turned graveyard that is God Valley, this would explain how Moria was able to easily obtain corpses of powerful warriors from the Rocks Pirates era, given that Rocks D. Xebec was defeated at God Valley and several crew members were likely killed in battle there.",
    "evidence": [
      "Both Thriller Bark and God Valley are said to originate from the West Blue",
      "The General Zombies on Thriller Bark resemble members of the Rocks Pirates",
      "Absalom specifically calls the General Zombies 'Ancient Warriors', suggesting historical significance",
      "Moria's ability to obtain such powerful corpses would make sense if Thriller Bark was the site of a major historical battle",
      "God Valley mysteriously disappeared after the battle, and Thriller Bark is a mobile island-ship"
    ],
    "status": "UNCONFIRMED",
    "communitySupport": "HIGH",
    "relatedTheories": ["rocks-pirates-god-valley-incident"],
    "debunked": false
  },
  {
    "id": "moria-new-world-trauma-theory",
    "title": "Moria's New World Warning Stems from Losing His Entire Crew",
    "author": "One Piece Community",
    "source": "https://onepiece.fandom.com/wiki/Gecko_Moria",
    "platform": "One Piece Wiki",
    "datePublished": "2008-2024",
    "episodesReferenced": [374, 481],
    "spoilerLevel": "MAJOR",
    "containsSpoilersBeyondEpisode": 374,
    "theory": "Moria's ominous warning to Luffy about the New World in this episode stems from personal trauma. The theory suggests that Moria once had a living crew that he cared about, but they were all killed in the New World, likely by Kaido. This devastating loss caused Moria to develop his philosophy of using zombie subordinates who cannot truly die, as a way to avoid the pain of losing comrades again. His warning to Luffy carries the weight of personal experience - he knows firsthand what the New World can take from you.",
    "evidence": [
      "Moria's serious and somber tone when warning Luffy about the New World suggests personal experience",
      "His entire strategy revolves around using zombies who cannot truly die, hinting at trauma from losing living crew members",
      "As a former Warlord who operated in the New World, Moria would have encountered powerful enemies",
      "His defeated, almost pitying attitude toward Luffy suggests he sees his younger self in the Straw Hat captain"
    ],
    "status": "PARTIALLY_CONFIRMED",
    "communitySupport": "VERY_HIGH",
    "relatedTheories": ["moria-vs-kaido-battle"],
    "debunked": false
  },
  {
    "id": "gigant-jet-shell-power-cost-theory",
    "title": "Combining Gears Shortens Luffy's Lifespan",
    "author": "One Piece Community",
    "source": "Multiple fan discussions",
    "platform": "Reddit/Forums",
    "datePublished": "2008-2024",
    "episodesReferenced": [374, 385],
    "spoilerLevel": "MAJOR",
    "containsSpoilersBeyondEpisode": 374,
    "theory": "The extreme physical cost of combining Gear 2 and Gear 3 simultaneously, as seen with Gigant Jet Shell, may be shortening Luffy's lifespan. Gear 2 works by accelerating blood flow to dangerous levels, while Gear 3 puts strain on his bones and body structure. Combining them compounds these risks. Some fans theorize that Luffy's repeated use of his Gears, especially in combination, is gradually reducing his natural lifespan, which could become a plot point later in the series. The fact that Luffy immediately passed out after using this technique suggests the toll it takes.",
    "evidence": [
      "Luffy passes out immediately after using Gigant Jet Shell, showing extreme physical cost",
      "Rob Lucci warned that Gear 2 accelerates Luffy's metabolism and could shorten his life",
      "The combination of two techniques that each strain the body differently could compound the damage",
      "Luffy rarely uses the combination again, suggesting he or others recognize the danger",
      "The series has established that shortcuts to power often come with costs (Ivankov's hormones, Luffy's battles in Impel Down)"
    ],
    "status": "UNCONFIRMED",
    "communitySupport": "MODERATE",
    "relatedTheories": ["luffy-lifespan-reduction", "ivankov-hormones-cost"],
    "debunked": false
  }
]
