[
  {
    "name": {
      "english": "Rolling Pirates",
      "japanese": "ローリング海賊団",
      "romanized": "Rōringu Kaizokudan"
    },
    "debutEpisode": 370,
    "debutChapter": 476,
    "episodeAppearances": [370],
    "captainId": "charlotte-lola",
    "members": [
      {
        "characterId": "charlotte-lola",
        "role": "Captain",
        "episodeJoined": 370,
        "episodeLeft": null
      },
      {
        "characterId": "risky-brothers",
        "role": "Member",
        "episodeJoined": 370,
        "episodeLeft": null
      }
    ],
    "formerMembers": [],
    "shipName": "",
    "shipDescription": "",
    "jollyRoger": "",
    "totalBounty": 24000000,
    "status": "ACTIVE",
    "formationEpisode": null,
    "disbandedEpisode": null,
    "keyMoments": [
      {
        "episodeNumber": 370,
        "eventId": "ep370-event-007",
        "momentType": "FIRST_APPEARANCE",
        "title": "Rolling Pirates Debut",
        "description": "The Rolling Pirates, led by Captain Charlotte Lola, encounter Luffy in the forest of Thriller Bark. They reveal they have been trapped on the island for three years after Gecko Moria stole their shadows.",
        "significance": "Introduction of the Rolling Pirates and their desperate situation, setting up their alliance with Luffy.",
        "timestamp": "15:30"
      },
      {
        "episodeNumber": 370,
        "eventId": "ep370-event-008",
        "momentType": "WORLD_LORE",
        "title": "Rolling Pirates Share Shadow Knowledge",
        "description": "The Rolling Pirates explain their discovery that multiple shadows can be implanted into a living body, granting temporary powers. This knowledge came from three years of being trapped and studying Moria's abilities.",
        "significance": "Shows the crew's resourcefulness and intelligence in discovering a counter-strategy to Moria's powers.",
        "timestamp": "16:45"
      },
      {
        "episodeNumber": 370,
        "eventId": "ep370-event-010",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "Rolling Pirates Create Nightmare Luffy",
        "description": "The Rolling Pirates implant all 100 shadows they had collected over three years into Luffy, creating the Nightmare Luffy transformation. They entrust their only hope of defeating Moria to Luffy.",
        "significance": "Demonstrates the crew's desperation and their willingness to place all their faith in Luffy as their champion. This represents three years of shadow collection being used in a single gambit.",
        "timestamp": "18:45"
      }
    ],
    "affiliations": [
      {
        "targetId": "straw-hat-pirates",
        "relationType": "ALLY",
        "episodeEstablished": 370,
        "description": "The Rolling Pirates ally with the Straw Hat Pirates through Luffy, empowering him to defeat Gecko Moria and reclaim all stolen shadows."
      }
    ],
    "goals": [
      "Defeat Gecko Moria and reclaim their stolen shadows",
      "Escape from Thriller Bark",
      "Return to sailing under the sun"
    ],
    "description": "A pirate crew led by Charlotte Lola that became trapped on Thriller Bark after Gecko Moria stole their shadows. They spent three years hiding in the island's forest, unable to venture into sunlight, while collecting shadows to survive and studying Moria's shadow powers.",
    "trivia": [
      {
        "fact": "The Rolling Pirates collected 100 shadows over their three years trapped on Thriller Bark, all of which they gave to Luffy to create Nightmare Luffy.",
        "category": "STORY"
      },
      {
        "fact": "Charlotte Lola, the captain, is later revealed to be the 23rd daughter of Charlotte Linlin (Big Mom) and plays an important role in the Whole Cake Island arc.",
        "category": "STORY"
      }
    ]
  }
]
