[
  {
    "name": {
      "english": "Shadow-Shadow Fruit",
      "japanese": "カゲカゲの実",
      "romanized": "Kage Kage no Mi",
      "official": "Kage Kage no Mi"
    },
    "debutEpisode": null,
    "debutChapter": null,
    "episodeAppearances": [370],
    "type": "Paramecia",
    "currentUser": "gecko-moria",
    "formerUsers": [],
    "awakened": false,
    "abilitiesRevealed": [
      {
        "abilityName": "Shadow Implantation",
        "episodeRevealed": 370,
        "description": "Multiple shadows can be implanted into a living body, granting the recipient the combined skills and abilities of all the shadows' original owners. The effect lasts for approximately ten minutes before the shadows naturally leave the body.",
        "firstUse": {
          "episodeNumber": 370,
          "context": "The Rolling Pirates explain and demonstrate this ability by implanting shadows into Luffy, ultimately creating Nightmare Luffy with 100 shadows.",
          "timestamp": "16:45"
        }
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 370,
        "eventId": "ep370-event-005",
        "momentType": "POWER_REVEAL",
        "title": "Shadows Transfer Devil Fruit Abilities",
        "description": "It is revealed that when Moria implants a shadow into a zombie, the zombie gains not just the personality but also the Devil Fruit abilities of the shadow's owner. This is demonstrated when Oars uses Luffy's Gomu Gomu no Mi stretching powers.",
        "significance": "Shows the full extent of the Kage Kage no Mi's power to transfer abilities, making it one of the most versatile Devil Fruits.",
        "timestamp": "13:15"
      },
      {
        "episodeNumber": 370,
        "eventId": "ep370-event-008",
        "momentType": "WORLD_LORE",
        "title": "Rolling Pirates Explain Shadow Mechanics",
        "description": "The Rolling Pirates reveal their discovery that the Kage Kage no Mi's powers can be used in reverse - multiple shadows can be placed into a living person to temporarily empower them with multiple skill sets.",
        "significance": "This revelation shows that the Kage Kage no Mi's abilities are not limited to creating zombies, but can also be used to enhance living beings.",
        "timestamp": "16:45"
      },
      {
        "episodeNumber": 370,
        "eventId": "ep370-event-010",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "100 Shadow Enhancement",
        "description": "Using shadows collected from Moria's victims, the Rolling Pirates implant 100 shadows into Luffy, creating an unprecedented enhancement that transforms him into Nightmare Luffy.",
        "significance": "Demonstrates the maximum potential of shadow implantation and reveals that the number of shadows that can be absorbed depends on the recipient's willpower.",
        "timestamp": "18:45"
      }
    ],
    "weaknesses": [
      "Shadows implanted into living beings only last for approximately 10 minutes",
      "The number of shadows a person can absorb depends on their willpower - most people cannot handle many shadows at once"
    ],
    "trivia": [
      {
        "fact": "The revelation that shadows can transfer Devil Fruit abilities makes the Kage Kage no Mi one of the most powerful fruits in the series, as it allows the user to give zombies the powers of any Devil Fruit user whose shadow they've stolen.",
        "category": "ABILITY"
      }
    ]
  },
  {
    "name": {
      "english": "Gum-Gum Fruit",
      "japanese": "ゴムゴムの実",
      "romanized": "Gomu Gomu no Mi",
      "official": "Gomu Gomu no Mi"
    },
    "debutEpisode": null,
    "debutChapter": null,
    "episodeAppearances": [370],
    "type": "Paramecia",
    "currentUser": "luffy",
    "formerUsers": [],
    "awakened": false,
    "abilitiesRevealed": [],
    "keyMoments": [
      {
        "episodeNumber": 370,
        "eventId": "ep370-event-005",
        "momentType": "POWER_REVEAL",
        "title": "Oars Uses Gomu Gomu Powers",
        "description": "Because Oars has Luffy's shadow implanted in him, he can use the Gomu Gomu no Mi's stretching abilities, including techniques like Gomu Gomu no Pistol. This makes Oars even more dangerous by combining giant strength with rubber powers.",
        "significance": "Demonstrates that Moria's shadow powers can transfer Devil Fruit abilities to zombies, creating uniquely powerful combinations.",
        "timestamp": "13:15"
      }
    ],
    "weaknesses": [],
    "trivia": []
  }
]
