[
  {
    "name": {
      "english": "Hollow-Hollow Fruit",
      "japanese": "ホロホロの実",
      "romanized": "Horo Horo no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 343,
    "debutChapter": 449,
    "episodeAppearances": [357],
    "currentUser": {
      "characterId": "perona",
      "episodeConsumed": null,
      "status": "ACTIVE"
    },
    "previousUsers": [],
    "abilities": [
      {
        "abilityName": "Negative Hollow",
        "description": "Creates ghost-like entities that pass through targets and cause extreme depression and negativity, making victims lose the will to fight or live.",
        "episodeFirstUsed": 343,
        "limitations": "Ineffective against people who are already extremely negative, as demonstrated by Usopp."
      },
      {
        "abilityName": "Quadruple Negative Attack",
        "description": "An enhanced version of Negative Hollow where Perona summons four ghosts simultaneously to attack a target with intensified depression-inducing power.",
        "episodeFirstUsed": 357,
        "limitations": "Still ineffective against naturally negative individuals like Usopp."
      }
    ],
    "awakening": {
      "isAwakened": false,
      "awakeningEpisode": null,
      "awakeningAbilities": []
    },
    "keyMoments": [
      {
        "episodeNumber": 357,
        "eventId": "ep357-event-002",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "Quadruple Negative Attack Debut",
        "description": "Perona debuts her enhanced Quadruple Negative Attack, summoning four Negative Hollows simultaneously against Usopp.",
        "significance": "First appearance of Perona's enhanced technique, though it proves ineffective against Usopp's natural negativity.",
        "timestamp": "05:30"
      },
      {
        "episodeNumber": 357,
        "eventId": "ep357-event-003",
        "momentType": "POWER_REVEAL",
        "title": "Weakness Discovered",
        "description": "The Horo Horo no Mi's Negative Hollows are revealed to be completely ineffective against people who are already extremely negative, with Usopp's pessimism actually affecting the ghosts themselves.",
        "significance": "Establishes a critical weakness of the fruit's primary ability and shows that every Devil Fruit power has limitations.",
        "timestamp": "06:15"
      }
    ],
    "weaknesses": [
      "Standard Devil Fruit weakness to seawater and Seastone",
      "Negative Hollows are ineffective against naturally pessimistic individuals",
      "Users with extreme negativity can actually affect the ghosts themselves"
    ],
    "trivia": [
      "The Horo Horo no Mi is one of the few Devil Fruits shown to have a direct counter based on personality traits rather than physical abilities or other powers."
    ]
  }
]
