[
  {
    "name": {
      "english": "Swamp-Swamp Fruit",
      "japanese": "ヌマヌマの実",
      "romanized": "Numa Numa no Mi"
    },
    "type": "LOGIA",
    "debutEpisode": 521,
    "debutChapter": 600,
    "description": "A Logia-type Devil Fruit that allows the user to create, control, and transform into mud/swamp at will, making the user a Swamp Human. The user can create bottomless swamps that are impossible to escape from and has infinite storage space within their body.",
    "episodeAppearances": [521],
    "users": [
      {
        "characterId": "caribou",
        "episodeStart": 521,
        "episodeEnd": "present",
        "circumstances": "Caribou had already eaten the fruit before his debut in Episode 521"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Logia Intangibility",
        "episodeRevealed": 521,
        "description": "Like most Logia users, Caribou cannot be hit or sliced as his mud element is intangible. Attacks pass through his swamp body harmlessly.",
        "severity": "MAJOR",
        "firstUseContext": "A Marine attempts to attack Caribou with a sword but the blade passes through his swamp body."
      },
      {
        "abilityName": "Swamp Creation",
        "episodeRevealed": 521,
        "description": "Caribou can create bottomless swamps that trap and smother opponents. Those caught in the swamp will sink deeper if they struggle.",
        "severity": "MAJOR",
        "firstUseContext": "Caribou uses his swamp powers to smother a Marine before shooting him."
      },
      {
        "abilityName": "Infinite Storage",
        "episodeRevealed": 521,
        "description": "The fruit grants the user infinite space within their body, allowing Caribou to store weapons, objects, and even people inside himself.",
        "severity": "MAJOR",
        "firstUseContext": "Implied by the nature of his powers demonstrated in this episode, though fully shown in later episodes."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim and weakness to seawater",
        "episodeRevealed": 521,
        "severity": "MAJOR"
      },
      {
        "weakness": "User cannot transform back to normal form if confined in a space that their normal body cannot fit in",
        "episodeRevealed": null,
        "severity": "MAJOR"
      },
      {
        "weakness": "Limited offensive capabilities beyond drowning opponents",
        "episodeRevealed": 521,
        "severity": "MINOR"
      },
      {
        "weakness": "Vulnerable to water manipulators who can exploit the swamp nature",
        "episodeRevealed": null,
        "severity": "MINOR"
      }
    ],
    "strengths": [
      {
        "strength": "As a Logia, provides near-invulnerability against non-Haki attacks",
        "episodeRevealed": 521,
        "description": "The user's swamp body cannot be harmed by conventional weapons.",
        "severity": "MAJOR"
      },
      {
        "strength": "Infinite storage capacity within the user's body",
        "episodeRevealed": 521,
        "description": "Can store unlimited weapons, treasures, and even captured people.",
        "severity": "MAJOR"
      },
      {
        "strength": "Swamps are inescapable traps that drown opponents",
        "episodeRevealed": 521,
        "description": "Opponents sink deeper when they struggle, making escape nearly impossible.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "HIGH"
  }
]
