[
  {
    "theoryTitle": "The White Berets' Redemption Foreshadowing",
    "theoryText": "McKinley's introduction shows him as a dutiful but not cruel officer, suggesting that unlike the Priests, the White Berets will eventually turn against Enel when they realize his true plans. His willingness to explain the law and follow procedure hints at an underlying sense of justice that conflicts with Enel's tyranny.",
    "theorist": "One Piece Fandom Community",
    "source": "General fan observation",
    "platform": "Various Forums",
    "publishDate": "Unknown",
    "episodeSpan": [156, 195],
    "containsSpoilers": true,
    "spoilerSeverity": "MAJOR",
    "spoilerScope": "Later in the Skypiea arc, McKinley and the White Berets do turn against Enel and help evacuate citizens",
    "supportingEvidence": [
      "McKinley explains laws rather than immediately attacking",
      "The White Berets are shown as soldiers following orders, not fanatics",
      "McKinley's concern about proper procedure suggests he values justice over blind obedience"
    ],
    "counterEvidence": [
      "McKinley does attack the Straw Hats without hesitation when ordered",
      "The White Berets enforce unjust laws without question initially"
    ],
    "currentStatus": "CONFIRMED",
    "communityReception": "WIDELY_ACCEPTED",
    "tags": ["character development", "skypiea", "white berets", "redemption"]
  },
  {
    "theoryTitle": "Skypiea's Legal System as Critique of Authoritarianism",
    "theoryText": "The crime classification system in Skypiea, where innocent actions like riding a waver or hitting a sea creature become crimes, represents Oda's commentary on authoritarian regimes that criminalize normal behavior to maintain control. The escalating crime levels mirror how oppressive systems use legal frameworks to justify tyranny.",
    "theorist": "One Piece Analysis Community",
    "source": "Thematic Analysis",
    "platform": "Various Analysis Sites",
    "publishDate": "Unknown",
    "episodeSpan": [156, 195],
    "containsSpoilers": false,
    "spoilerSeverity": "MINOR",
    "spoilerScope": "None - thematic interpretation",
    "supportingEvidence": [
      "The absurdity of charging for actions the Straw Hats couldn't have known were illegal",
      "The system benefits those in power (Enel) while oppressing citizens",
      "The Ordeals serve as both punishment and entertainment for the ruling class",
      "Citizens like Conis and Pagaya live in constant fear of the system"
    ],
    "counterEvidence": [],
    "currentStatus": "UNCONFIRMED_INTERPRETATION",
    "communityReception": "POPULAR",
    "tags": ["themes", "worldbuilding", "political commentary", "skypiea"]
  },
  {
    "theoryTitle": "Gomu Gomu no Hanabi as Combat Evolution",
    "theoryText": "The debut of Gomu Gomu no Hanabi in episode 156 represents Luffy's growing combat sophistication. Rather than fighting opponents one-on-one, he's developing techniques to handle multiple enemies simultaneously, foreshadowing the larger-scale battles he'll face later in the series.",
    "theorist": "Power Scaling Analysts",
    "source": "Combat Analysis",
    "platform": "One Piece Forums",
    "publishDate": "Unknown",
    "episodeSpan": [156],
    "containsSpoilers": false,
    "spoilerSeverity": "NONE",
    "spoilerScope": "None",
    "supportingEvidence": [
      "This is one of Luffy's first multi-target techniques",
      "Shows strategic thinking in combat",
      "Demonstrates mastery of his Devil Fruit abilities"
    ],
    "counterEvidence": [
      "Luffy already used crowd control techniques in earlier arcs",
      "The technique is relatively simple compared to later developments"
    ],
    "currentStatus": "OBSERVATION",
    "communityReception": "NICHE_DISCUSSION",
    "tags": ["combat", "abilities", "luffy", "development"]
  },
  {
    "theoryTitle": "The Straw Hats' Criminal Status as Narrative Parallel",
    "theoryText": "The Straw Hats being labeled as criminals in Skypiea parallels their status in the Blue Sea as pirates. However, in Skypiea they're criminals for defending their freedom and rejecting unjust authority, reinforcing the series' theme that 'pirate' and 'criminal' labels don't determine morality.",
    "theorist": "Thematic Analysis Community",
    "source": "Narrative Analysis",
    "platform": "One Piece Discussion Forums",
    "publishDate": "Unknown",
    "episodeSpan": [156, 195],
    "containsSpoilers": false,
    "spoilerSeverity": "MINOR",
    "spoilerScope": "None - thematic observation",
    "supportingEvidence": [
      "The Straw Hats are labeled criminals in both the Blue Sea and Sky Island",
      "In both cases, they're fighting against corrupt authority",
      "The citizens of Skypiea come to view the 'criminals' as heroes",
      "Reinforces One Piece's moral relativism regarding law and justice"
    ],
    "counterEvidence": [],
    "currentStatus": "THEMATIC_INTERPRETATION",
    "communityReception": "WIDELY_ACCEPTED",
    "tags": ["themes", "narrative", "pirates", "justice", "skypiea"]
  }
]
