[
  {
    "name": {
      "english": "Tremor-Tremor Fruit",
      "japanese": "グラグラの実",
      "romanized": "Gura Gura no Mi"
    },
    "type": "Paramecia",
    "debutEpisode": 462,
    "debutChapter": 552,
    "episodeAppearances": [488],
    "currentUser": "blackbeard",
    "formerUsers": [
      {
        "characterId": "whitebeard",
        "episodeStart": 462,
        "episodeEnd": 485,
        "notes": "Original user, died and fruit was stolen by Blackbeard"
      }
    ],
    "abilitiesRevealed": [
      {
        "abilityName": "Shima Yurashi",
        "description": "The user grabs the sky and swings their hands down, tilting entire islands and creating massive earthquakes and tsunamis. This attack can affect areas hundreds of miles away.",
        "episodeRevealed": 488,
        "userAtTime": "blackbeard"
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 488,
        "eventId": "ep488-event-001",
        "momentType": "POWER_REVEAL",
        "title": "Blackbeard Tilts Marineford",
        "description": "Blackbeard uses the Gura Gura no Mi to perform 'Shima Yurashi', tilting the entire island of Marineford and creating earthquakes so powerful they generate tsunamis that reach Sabaody Archipelago.",
        "significance": "Demonstrates Blackbeard's growing mastery of the stolen power and establishes the global threat he poses. Despite being inexperienced, he can already perform devastating attacks.",
        "timestamp": "03:30"
      },
      {
        "episodeNumber": 488,
        "eventId": "ep488-event-002",
        "momentType": "WORLD_LORE",
        "title": "Global Impact of Earthquake Power",
        "description": "The effects of Blackbeard's earthquake reach Sabaody Archipelago, causing tsunamis and chaos across multiple islands.",
        "significance": "Shows the terrifying range and world-shaking potential of the Gura Gura no Mi when used by someone with Blackbeard's ambition.",
        "timestamp": "05:15"
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 462
      }
    ],
    "trivia": [
      "Blackbeard admits his inexperience with the power during this episode, despite already being able to perform devastating attacks like Shima Yurashi."
    ]
  }
]
