[
  {
    "name": {
      "english": "Marineford",
      "japanese": "マリンフォード",
      "romanized": "Marinfōdo"
    },
    "type": "Island/Marine Base",
    "debutEpisode": 151,
    "debutChapter": 234,
    "episodeAppearances": [488],
    "region": "Paradise",
    "keyEvents": [
      {
        "episodeNumber": 488,
        "eventId": "ep488-event-001",
        "title": "Blackbeard Tilts Marineford",
        "description": "Blackbeard uses the Gura Gura no Mi to tilt the entire island of Marineford with his Shima Yurashi attack, causing massive destruction and chaos.",
        "significance": "Demonstrates the physical damage Marineford sustained during the war and the terrifying power of the earthquake fruit.",
        "timestamp": "03:30"
      },
      {
        "episodeNumber": 488,
        "eventId": "ep488-event-007",
        "title": "Koby's Desperate Plea",
        "description": "In the middle of the Marineford battlefield, Koby makes his courageous stand to stop the war.",
        "significance": "The battlefield becomes the stage for one of the most morally significant moments in the series.",
        "timestamp": "16:45"
      },
      {
        "episodeNumber": 488,
        "eventId": "ep488-event-009",
        "title": "Shanks Arrives at Marineford",
        "description": "Red-Haired Shanks and his crew arrive at Marineford, marking the first time a Yonko intervenes to end the war.",
        "significance": "Marineford becomes the meeting point of the world's greatest powers and the site where the war finally ends.",
        "timestamp": "19:15"
      }
    ],
    "controlledBy": "World Government/Marines",
    "statusChanges": [
      {
        "status": "Heavily damaged by Whitebeard and Blackbeard's earthquake powers",
        "episodeChanged": 488,
        "description": "The island was tilted and suffered massive structural damage from Blackbeard's Shima Yurashi attack."
      }
    ],
    "description": "The Marine Headquarters, a fortress island that served as the battleground for the Summit War. The location where the fate of the world was decided.",
    "significance": "The central location of the Marineford Arc, where Ace's execution, Whitebeard's death, and the clash of the world's greatest powers took place."
  },
  {
    "name": {
      "english": "Sabaody Archipelago",
      "japanese": "シャボンディ諸島",
      "romanized": "Shabondi Shotō"
    },
    "type": "Archipelago",
    "debutEpisode": 385,
    "debutChapter": 490,
    "episodeAppearances": [488],
    "region": "Paradise",
    "keyEvents": [
      {
        "episodeNumber": 488,
        "eventId": "ep488-event-002",
        "title": "Tsunami from Marineford Reaches Sabaody",
        "description": "The effects of Blackbeard's earthquake powers create tsunamis that reach as far as Sabaody Archipelago. Sirens wail as the waves approach, and the tsunami paradoxically saves the Heart Pirates' submarine from naval bombardment.",
        "significance": "Demonstrates the global impact of the Marineford War and the terrifying range of the Gura Gura no Mi. Shows that the war's effects are felt across multiple islands.",
        "timestamp": "05:15"
      }
    ],
    "controlledBy": "World Government",
    "description": "An archipelago of islands connected by massive mangrove trees, located near the Red Line. The last stop before the New World.",
    "significance": "Shows the far-reaching consequences of the Marineford War, with even distant islands affected by the battle."
  }
]
