[
  {
    "title": "Zoro's Promise to Kuina Sets Up His Entire Character Arc",
    "theoryText": "The Three Sword Style that Zoro debuts in Episode 3 is more than just a fighting technique - it represents his promise to Kuina to become the world's greatest swordsman. By wielding her sword (Wado Ichimonji) in his mouth along with his two other swords, Zoro is symbolically fighting for both of them, carrying her dream forward alongside his own. This debut establishes that Zoro's journey is about honoring the dead while pursuing greatness.",
    "author": "Various One Piece fans",
    "source": "General fan discussion",
    "sourceUrl": null,
    "publishDate": null,
    "popularity": "HIGH",
    "episodeSpan": [2, 3],
    "spoilerStatus": "SAFE",
    "relatedCharacters": ["zoro"],
    "relatedEvents": ["ep003-event-002"],
    "status": "CONFIRMED",
    "confirmationEpisode": null,
    "tags": ["character-analysis", "backstory", "symbolism"]
  },
  {
    "title": "Koby and Luffy's Farewell Foreshadows Their Future Meeting",
    "theoryText": "The emotional farewell between Luffy and Koby in Episode 3, where they part ways as pirate and Marine, sets up a recurring theme in One Piece: friends on opposite sides of the law. Many fans theorize that Koby joining the Marines will lead to future confrontations where he must choose between his duty and his friendship with Luffy. The scene where they say goodbye hints that their paths will cross again, possibly in a major conflict.",
    "author": "Early One Piece community",
    "source": "Fan forums and discussions",
    "sourceUrl": null,
    "publishDate": null,
    "popularity": "MEDIUM",
    "episodeSpan": [1, 2, 3],
    "spoilerStatus": "SAFE",
    "relatedCharacters": ["luffy", "koby"],
    "relatedEvents": ["ep003-event-016"],
    "status": "CONFIRMED",
    "confirmationEpisode": null,
    "tags": ["foreshadowing", "relationships", "future-conflicts"]
  },
  {
    "title": "Morgan's Tyranny Introduces the Theme of Corrupt Authority",
    "theoryText": "Episode 3's portrayal of Morgan as a corrupt Marine captain who abuses his power establishes one of One Piece's central themes: authority figures are not always righteous, and justice doesn't always align with the law. This theme will repeat throughout the series as Luffy encounters both honorable and corrupt members of the World Government and Marines. Morgan's defeat by his own subordinates shows that true justice can come from within corrupted systems.",
    "author": "One Piece analysts",
    "source": "Various review articles and forums",
    "sourceUrl": null,
    "publishDate": null,
    "popularity": "HIGH",
    "episodeSpan": [2, 3],
    "spoilerStatus": "SAFE",
    "relatedCharacters": ["morgan"],
    "relatedEvents": ["ep003-event-009"],
    "status": "THEMATIC_PATTERN",
    "confirmationEpisode": null,
    "tags": ["themes", "world-building", "government-corruption"]
  }
]
