[
  {
    "name": {
      "english": "Flower-Flower Fruit",
      "japanese": "ハナハナの実",
      "romanized": "Hana Hana no Mi"
    },
    "type": "PARAMECIA",
    "episodeAppearances": [174],
    "description": "Allows the user to sprout duplicates of their body parts on any surface within range. The user can create limbs on their own body or on other surfaces, including on other people. The sprouted body parts feel pain and damage as if they were the original.",
    "users": [
      {
        "characterId": "robin",
        "episodeStart": 67,
        "episodeEnd": "present",
        "circumstances": "Robin has been using this fruit since childhood. Episode 174 showcases advanced techniques."
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Veinte Fleur: Calendula",
        "episodeRevealed": 174,
        "description": "Robin sprouts twenty arms that spread outward to create a defensive shield capable of blocking attacks and protecting objects or locations.",
        "severity": "MAJOR",
        "firstUseContext": "Used to protect ancient monuments from Yama's destructive attacks in the ruins."
      },
      {
        "abilityName": "Treinta Fleur: Hang",
        "episodeRevealed": 174,
        "description": "Robin sprouts thirty arms from high positions to catch opponents mid-air and slam them against surfaces.",
        "severity": "MAJOR",
        "firstUseContext": "Used against Yama when he attacked with Drop Mountain, catching him mid-air and slamming him down."
      },
      {
        "abilityName": "Cien Fleur: Delphinium",
        "episodeRevealed": 174,
        "description": "Robin sprouts one hundred arms that create a coordinated path to systematically roll and manipulate opponents, often finished with a Clutch move.",
        "severity": "MAJOR",
        "firstUseContext": "Used to defeat Yama by rolling him off a cliff, combined with Clutch to completely incapacitate him."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim and weakness in seawater",
        "episodeRevealed": 67,
        "severity": "MAJOR"
      },
      {
        "weakness": "Sprouted limbs feel pain and can be damaged",
        "episodeRevealed": 174,
        "severity": "MAJOR"
      }
    ],
    "strengths": [
      {
        "strength": "Can create limbs on any surface within range",
        "episodeRevealed": 67,
        "description": "Allows for versatile combat and utility applications, from reconnaissance to restraining enemies.",
        "severity": "MAJOR"
      },
      {
        "strength": "Can create large numbers of limbs for powerful attacks",
        "episodeRevealed": 174,
        "description": "As shown with Cien Fleur techniques, Robin can sprout up to 100 or more limbs for devastating combination attacks.",
        "severity": "MAJOR"
      },
      {
        "strength": "Defensive and offensive versatility",
        "episodeRevealed": 174,
        "description": "Can be used both defensively (Calendula shield) and offensively (Delphinium attacks).",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "HIGH"
  }
]
