[
  {
    "id": "theory-ep520-001",
    "title": "Brook's Global Fame Will Be Important Later",
    "summary": "Fan theory that Brook's worldwide recognition as Soul King will play a crucial role in future arcs, potentially helping the Straw Hats gain allies or access to restricted areas.",
    "fullText": "During the two-year timeskip, Brook became a globally recognized superstar as 'Soul King'. Some fans theorize that this fame and influence will be strategically important for the Straw Hats in later arcs. Brook's celebrity status could provide the crew with legitimate cover, help them gain audience with world leaders, or even influence public opinion about pirates. The fact that Oda spent time establishing Brook's fame suggests it's not just a throwaway detail but will have payoff later in the story.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Brook",
      "title": "Brook - One Piece Wiki - Discussion",
      "platform": "Fandom",
      "accessedAt": "2025-12-17"
    },
    "postedDate": "2011-10-23",
    "episodeRange": [520, 1000],
    "minEpisode": 520,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 520
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": ["brook"],
    "relatedLocations": ["sabaody-archipelago"],
    "relatedEvents": ["ep520-event-001", "ep520-event-002"],
    "tags": ["brook", "soul-king", "timeskip", "fame"]
  },
  {
    "id": "theory-ep520-002",
    "title": "The Fake Straw Hats Show How Legendary the Crew Has Become",
    "summary": "The existence of the Fake Straw Hat Crew demonstrates how much the real crew's reputation has grown, suggesting they've reached a point where their name alone carries immense power.",
    "fullText": "The fact that Demaro Black and others would risk impersonating the Straw Hat Pirates shows just how powerful the crew's reputation has become after the events at Marineford and the Summit War. Fans noted that this is a turning point where the Straw Hats are no longer just another rookie crew but have become legendary figures whose very names inspire fear and respect. The fake crew's ability to recruit 100 pirates, including high bounty individuals like Caribou and Coribou, purely on the Straw Hat name demonstrates the real crew's influence has reached unprecedented levels.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Fake_Straw_Hat_Crew",
      "title": "Fake Straw Hat Crew - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-17"
    },
    "postedDate": "2011-10-23",
    "episodeRange": [520, 522],
    "minEpisode": 520,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 522
    },
    "popularity": {},
    "status": "CONFIRMED",
    "relatedCharacters": ["demaro-black", "luffy"],
    "relatedLocations": ["sabaody-archipelago"],
    "relatedEvents": ["ep520-event-009", "ep520-event-011"],
    "tags": ["fake-straw-hats", "reputation", "influence", "timeskip"]
  }
]
