[
  {
    "id": "tower-of-justice-bathroom",
    "name": "Tower of Justice - Kalifa's Bathroom",
    "type": "INTERIOR",
    "episodeAppearances": [296],
    "keyEvents": [
      {
        "episodeNumber": 296,
        "eventId": "ep296-event-001",
        "description": "Nami uses Mirage Tempo: Fata Morgana to create five illusions in the bathroom",
        "timestamp": "05:30"
      },
      {
        "episodeNumber": 296,
        "eventId": "ep296-event-002",
        "description": "Kalifa unleashes Hitsuji Gumo Tidal Wave, filling the bathroom with power-draining bubbles",
        "timestamp": "08:45"
      },
      {
        "episodeNumber": 296,
        "eventId": "ep296-event-003",
        "description": "Nami defeats Kalifa with Thunder Lance Tempo",
        "timestamp": "11:20"
      },
      {
        "episodeNumber": 296,
        "eventId": "ep296-event-004",
        "description": "Battle between Nami and Kalifa concludes with Kalifa's defeat",
        "timestamp": "12:30"
      }
    ],
    "description": "A bathroom within the Tower of Justice at Enies Lobby where Nami's battle with CP9 agent Kalifa takes place. The room features typical bathroom fixtures and becomes the site of Nami's first major solo victory.",
    "significance": "The confined space of the bathroom makes Kalifa's bubble attacks more dangerous but also allows Nami's illusion techniques to be more effective. This location witnesses a pivotal moment in Nami's development as a fighter."
  },
  {
    "id": "tower-of-justice",
    "name": "Tower of Justice",
    "type": "BUILDING",
    "episodeAppearances": [296],
    "keyEvents": [
      {
        "episodeNumber": 296,
        "eventId": "ep296-event-005",
        "description": "Franky encounters Monster Point Chopper rampaging through the tower",
        "timestamp": "14:00"
      },
      {
        "episodeNumber": 296,
        "eventId": "ep296-event-006",
        "description": "Franky uses Coup de Vent to blast Chopper through the tower wall",
        "timestamp": "15:45"
      },
      {
        "episodeNumber": 296,
        "eventId": "ep296-event-009",
        "description": "Nami retrieves Kalifa's key after defeating her",
        "timestamp": "19:15"
      },
      {
        "episodeNumber": 296,
        "eventId": "ep296-event-010",
        "description": "Zoro and Sogeking are freed from their handcuffs by Nami",
        "timestamp": "20:45"
      }
    ],
    "description": "The central tower of Enies Lobby, a massive government facility housing the offices and chambers of CP9 and other World Government officials. Multiple battles between the Straw Hats and CP9 take place throughout this structure.",
    "significance": "The Tower of Justice is the primary battleground for the Enies Lobby arc, where the Straw Hats fight to rescue Robin from the World Government."
  },
  {
    "id": "enies-lobby-waterfall",
    "name": "Enies Lobby Waterfall",
    "type": "NATURAL_FEATURE",
    "episodeAppearances": [296],
    "keyEvents": [
      {
        "episodeNumber": 296,
        "eventId": "ep296-event-007",
        "description": "Franky dives from the Tower of Justice into the sea to rescue Chopper",
        "timestamp": "17:00"
      },
      {
        "episodeNumber": 296,
        "eventId": "ep296-event-008",
        "description": "Chopper returns to normal form upon hitting the seawater",
        "timestamp": "18:30"
      }
    ],
    "description": "The massive waterfall and surrounding waters at Enies Lobby. The seawater proves crucial in neutralizing Chopper's Monster Point transformation and saving his life.",
    "significance": "Demonstrates the strategic use of environmental features and Devil Fruit weaknesses in combat situations."
  }
]
