[
  {
    "name": {
      "english": "Hormone-Hormone Fruit",
      "japanese": "ホルホルの実",
      "romanized": "Horu Horu no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 439,
    "debutChapter": 537,
    "description": "Grants the ability to create and control special hormones that can alter the recipient's body in various ways, including gender, temperature, healing, and energy levels.",
    "episodeAppearances": [477],
    "users": [
      {
        "characterId": "ivankov",
        "episodeStart": 439,
        "episodeEnd": "present",
        "circumstances": "Emporio Ivankov ate the fruit sometime after the God Valley Incident"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Emporio Tension Hormone - Second Dose",
        "episodeRevealed": 477,
        "description": "Ivankov injects Luffy with a second dose of adrenaline-affecting hormones that relieve tension and restore energy for an entire day. However, there is a severe limit - a second dose is the absolute maximum and the recipient will not be able to get up again afterward.",
        "severity": "CRITICAL",
        "firstUseContext": "Luffy desperately requests another dose to continue fighting to save Ace, despite knowing it will severely shorten his lifespan and have dangerous aftereffects."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Tension Hormones have severe aftereffects including nausea and tiredness",
        "episodeRevealed": 477,
        "severity": "MAJOR"
      },
      {
        "weakness": "There is a hard limit on how many doses can be given - a second dose is the absolute maximum",
        "episodeRevealed": 477,
        "severity": "CRITICAL"
      },
      {
        "weakness": "Repeated use may shorten the recipient's lifespan",
        "episodeRevealed": 477,
        "severity": "CRITICAL"
      }
    ],
    "strengths": [
      {
        "strength": "Can provide emergency energy restoration to exhausted individuals",
        "episodeRevealed": 477,
        "description": "Allows someone at the brink of collapse to regain strength for continued combat.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "HIGH"
  },
  {
    "name": {
      "english": "Mag-Mag Fruit",
      "japanese": "マグマグの実",
      "romanized": "Magu Magu no Mi"
    },
    "type": "LOGIA",
    "debutEpisode": 461,
    "debutChapter": 554,
    "description": "Allows the user to create, control, and transform into magma, making them a Magma Human. The magma is hot enough to burn even fire.",
    "episodeAppearances": [477],
    "users": [
      {
        "characterId": "akainu",
        "episodeStart": 461,
        "episodeEnd": "present",
        "circumstances": "Akainu ate the fruit at an unknown time before becoming an Admiral"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Inugami Guren (Hound Blaze)",
        "episodeRevealed": 477,
        "description": "Akainu transforms his arm into a magma hound shape and launches it as a devastating ranged attack. The magma blast is powerful enough to cause massive destruction.",
        "severity": "MAJOR",
        "firstUseContext": "Akainu uses this attack against Whitebeard during their intense battle, though Whitebeard deflects it causing further destruction to Marineford plaza."
      }
    ],
    "weaknesses": [],
    "strengths": [
      {
        "strength": "Magma is superior to fire in temperature and destructive power",
        "episodeRevealed": 477,
        "description": "The extreme heat and destructive capacity makes it one of the most offensive Devil Fruits.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "VERY_HIGH"
  },
  {
    "name": {
      "english": "Glint-Glint Fruit",
      "japanese": "ピカピカの実",
      "romanized": "Pika Pika no Mi"
    },
    "type": "LOGIA",
    "debutEpisode": 398,
    "debutChapter": 507,
    "description": "Allows the user to create, control, and transform into light, making them a Light Human. The user can move at the speed of light and fire devastating laser beams.",
    "episodeAppearances": [477],
    "users": [
      {
        "characterId": "kizaru",
        "episodeStart": 398,
        "episodeEnd": "present",
        "circumstances": "Kizaru ate the fruit at an unknown time before becoming an Admiral"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Coordinated Laser Beam Attack on Marco",
        "episodeRevealed": 477,
        "description": "Kizaru fires two precise laser beams that pierce through Marco's body when the Phoenix commander is distracted, demonstrating the strategic use of his light-speed attacks.",
        "severity": "MAJOR",
        "firstUseContext": "Used to exploit Marco's momentary distraction when he was worried about Whitebeard, successfully wounding one of the strongest Whitebeard Pirates commanders."
      }
    ],
    "weaknesses": [],
    "strengths": [
      {
        "strength": "Can exploit momentary distractions with precision light-speed attacks",
        "episodeRevealed": 477,
        "description": "The speed and precision of light-based attacks makes them deadly when opponents are not fully focused.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "VERY_HIGH"
  },
  {
    "name": {
      "english": "Ice-Ice Fruit",
      "japanese": "ヒエヒエの実",
      "romanized": "Hie Hie no Mi"
    },
    "type": "LOGIA",
    "debutEpisode": 227,
    "debutChapter": 319,
    "description": "Allows the user to create, control, and transform into ice, making them an Ice Human. The user can freeze anything they touch and create massive ice structures.",
    "episodeAppearances": [477],
    "users": [
      {
        "characterId": "aokiji",
        "episodeStart": 227,
        "episodeEnd": "present",
        "circumstances": "Aokiji ate the fruit at an unknown time before becoming an Admiral"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Instant Freeze on Diamond Jozu",
        "episodeRevealed": 477,
        "description": "Aokiji demonstrates the ability to freeze even a diamond-bodied opponent solid when they are caught off-guard, showing that his ice can overcome even the hardest natural defenses.",
        "severity": "CRITICAL",
        "firstUseContext": "Used to freeze Jozu completely when he was distracted by Marco being wounded, removing another powerful Whitebeard commander from battle."
      }
    ],
    "weaknesses": [],
    "strengths": [
      {
        "strength": "Can freeze opponents with diamond-hard bodies when they are vulnerable",
        "episodeRevealed": 477,
        "description": "The ice powers can overcome even the strongest physical defenses if the opponent is not actively defending.",
        "severity": "CRITICAL"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "VERY_HIGH"
  }
]
