[
  {
    "theoryTitle": "Jailer Beasts Are Failed Awakening Experiments",
    "theoryText": "The Jailer Beasts of Impel Down, including the Minotaurus introduced in Episode 422, are the result of failed Zoan Devil Fruit awakening attempts. The theory suggests that the World Government or Impel Down authorities attempted to forcibly awaken Zoan users to create powerful guards, but the process failed, causing the users to lose their humanity and become mindless beasts. This would explain their monstrous appearance, incredible durability, and lack of complex thought.",
    "author": "Various One Piece Fan Communities",
    "platform": "Worstgen Forum / Reddit / One Piece Forums",
    "dateProposed": null,
    "episodesReferenced": [422, 423, 424, 425, 426],
    "supportingEvidence": [
      "Crocodile later explains that the Jailer Beasts are awakened Zoan users",
      "Their degraded personalities suggest unsuccessful awakening",
      "They demonstrate incredible durability and recovery, traits of awakened Zoans",
      "Oda confirmed in SBS that Zoan awakening carries significant risks",
      "The beasts show no sign of human intelligence despite being former humans"
    ],
    "counterEvidence": [
      "Not explicitly confirmed whether the awakening was intentional or accidental",
      "No direct statement that these were experimental subjects",
      "Could be naturally awakened Zoans who lost themselves to the animal nature"
    ],
    "spoilerLevel": "MAJOR",
    "theoryStatus": "PARTIALLY_CONFIRMED",
    "popularity": "HIGH",
    "tags": ["jailer beasts", "awakening", "devil fruit", "impel down"],
    "relatedTheories": [
      "CP9 members who disappeared may have been subjected to forced awakening attempts",
      "Level 6 prisoners could have been used as awakening test subjects"
    ],
    "sourceUrls": [
      {
        "url": "https://worstgen.alwaysdata.net/forum/threads/theory-on-zoan-awakenings-the-risk-the-failure-and-the-true-form.35268/",
        "title": "Theory on Zoan Awakenings, the risk, the failure and the true form",
        "accessedAt": "2025-12-08"
      },
      {
        "url": "https://worstgen.alwaysdata.net/forum/threads/cipher-pol-can-trigger-awakenings-in-zoan-users-jabras-failed-and-he-became-an-impel-down-beast-guard.36991/",
        "title": "Cipher Pol can trigger Awakenings in Zoan users",
        "accessedAt": "2025-12-08"
      }
    ]
  },
  {
    "theoryTitle": "Garp's Inaction Was Strategic",
    "theoryText": "Some fans theorize that Garp's apparent passivity during Ace's imprisonment at Impel Down was actually strategic. Rather than being cowardly, Garp may have been playing a careful political game, knowing that any overt action to save Ace would compromise the Marines and potentially start a larger war prematurely. By visiting Ace and having emotionally charged conversations, Garp was actually gathering intelligence and assessing the situation while maintaining his position of trust within the Marines.",
    "author": "One Piece Fan Communities",
    "platform": "Reddit / FandomWire / Discussion Forums",
    "dateProposed": null,
    "episodesReferenced": [422, 459, 460, 461, 472, 473, 474],
    "supportingEvidence": [
      "Garp's position allowed him to visit Ace when others couldn't",
      "His emotional conversation with Ace revealed important information about Ace's parentage",
      "Garp's internal conflict is well-documented throughout the series",
      "He remained in position to potentially influence events at Marineford"
    ],
    "counterEvidence": [
      "Garp took no direct action to save Ace",
      "His inaction ultimately contributed to Ace's death",
      "Multiple opportunities to act were not taken",
      "Garp himself expressed deep regret over his choices"
    ],
    "spoilerLevel": "CRITICAL",
    "theoryStatus": "DEBUNKED",
    "popularity": "MEDIUM",
    "tags": ["garp", "ace", "marineford", "strategy"],
    "relatedTheories": [
      "Garp intentionally let Luffy through during Marineford",
      "Garp's ties to Roger influenced his handling of Ace's situation"
    ],
    "sourceUrls": [
      {
        "url": "https://fandomwire.com/garp-is-a-coward-heated-debate-erupts-among-one-piece-fans-over-monkey-d-garps-questionable-choices-with-ace/",
        "title": "Garp is a coward: Heated Debate Erupts Among One Piece Fans",
        "accessedAt": "2025-12-08"
      }
    ]
  },
  {
    "theoryTitle": "Impel Down Level 6 Contains Rocks Pirates Members",
    "theoryText": "A popular theory suggests that Level 6 of Impel Down, the deepest and most secret level, contains imprisoned members of the legendary Rocks Pirates crew. This would explain why Level 6 is kept so secret and why the World Government is so protective of its prisoners. The theory gained traction following hints about the God Valley incident and the Rocks Pirates' defeat.",
    "author": "One Piece Theory Communities",
    "platform": "Reddit / YouTube / Theory Forums",
    "dateProposed": null,
    "episodesReferenced": [422, 425, 438, 440],
    "supportingEvidence": [
      "Level 6 prisoners are kept extremely secret",
      "The World Government erases existence records of some Level 6 inmates",
      "God Valley incident was covered up by the World Government",
      "Timing of Rocks Pirates defeat aligns with Impel Down's importance",
      "Level 6's existence wasn't publicly known until the Impel Down arc"
    ],
    "counterEvidence": [
      "No direct evidence of Rocks Pirates members in Impel Down",
      "Most powerful pirates from that era may have been executed",
      "The secrecy could be for other reasons",
      "Later revelations show most Level 6 inmates are more recent prisoners"
    ],
    "spoilerLevel": "MAJOR",
    "theoryStatus": "UNCONFIRMED",
    "popularity": "HIGH",
    "tags": ["level 6", "rocks pirates", "god valley", "world government"],
    "relatedTheories": [
      "Rocks D. Xebec himself might be imprisoned rather than dead",
      "Level 6 contains prisoners who know too much about the Void Century"
    ],
    "sourceUrls": []
  },
  {
    "theoryTitle": "Impel Down Will Have a Second Infiltration",
    "theoryText": "Fans theorize that before One Piece ends, there will be another infiltration of Impel Down, potentially to rescue someone or to free dangerous allies. This theory suggests that the detailed worldbuilding of Impel Down in episodes like 422 is setup for a future return to the location, possibly in the final saga.",
    "author": "One Piece Theory Communities",
    "platform": "Reddit / YouTube / Discussion Forums",
    "dateProposed": null,
    "episodesReferenced": [422, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455, 456],
    "supportingEvidence": [
      "Oda rarely creates detailed locations without revisiting them",
      "Multiple important characters are now imprisoned in Impel Down post-timeskip",
      "The prison's security has been upgraded after Luffy's infiltration",
      "Some revolutionaries and allies have been captured and imprisoned there",
      "The World Government's secrets in Level 6 remain largely unexplored"
    ],
    "counterEvidence": [
      "The series is approaching its end with limited time for new arcs",
      "Luffy's infiltration already served its narrative purpose",
      "Returning to Impel Down might feel repetitive",
      "Most strategic prisoners have already escaped or been executed"
    ],
    "spoilerLevel": "MINOR",
    "theoryStatus": "UNCONFIRMED",
    "popularity": "MEDIUM",
    "tags": ["impel down", "future arc", "infiltration", "final saga"],
    "relatedTheories": [
      "Sabo might be imprisoned in Impel Down after recent events",
      "A massive prison break could occur during the final war"
    ],
    "sourceUrls": [
      {
        "url": "https://gamerant.com/one-piece-impel-down-part-2/",
        "title": "One Piece: Will There Be An Impel Down Part 2?",
        "accessedAt": "2025-12-08"
      }
    ]
  }
]
