[
  {
    "id": "theory-ep270-001",
    "title": "Enies Lobby's Hole Connected to Imu's Ancient Weapon",
    "summary": "A fan theory suggesting that the mysterious hole at Enies Lobby was created by Imu using an ancient weapon, similar to what happened to Lulusia Kingdom.",
    "fullText": "After the reveal of what happened to Lulusia Kingdom, many fans have theorized that Imu destroyed an island that once stood where Enies Lobby was eventually built. The perpetual daylight and the massive waterfall hole at Enies Lobby could be the result of an ancient weapon attack, possibly the same one used on Lulusia. This would explain why Enies Lobby has such an unusual geography and why the World Government chose to build one of their most important judicial facilities on this specific location - to hide evidence of their past crimes.",
    "author": "One Piece Community",
    "source": {
      "url": "https://www.cbr.com/one-piece-1089-enies-lobby-secret-details/",
      "title": "Did One Piece Just Reveal the Secret of Enies Lobby?",
      "platform": "CBR",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2023-08-01",
    "episodeRange": [270, 1089],
    "minEpisode": 264,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1089
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["imu"],
    "relatedLocations": ["enies-lobby"],
    "relatedEvents": ["ep270-event-007"],
    "tags": ["enies-lobby", "ancient-weapons", "world-government", "imu", "void-century"]
  },
  {
    "id": "theory-ep270-002",
    "title": "Gear Second's Long-term Effects on Luffy's Lifespan",
    "summary": "A theory that Luffy's use of Gear Second (debuting in episode 272) is gradually shortening his lifespan due to the strain on his body.",
    "fullText": "When Luffy first uses Gear Second against Blueno, Rob Lucci later confirms that the technique is shortening Luffy's lifespan. Fans have theorized that each use of Gear Second, Third, and Fourth acts like doping - temporarily boosting physical stats at the cost of long-term health. The theory suggests Luffy has already significantly reduced his natural lifespan through constant use of these techniques, which may become a major plot point later in the series. Some fans connect this to Luffy's extensive recovery sessions and the accumulated damage from Ivankov's healing hormones at Impel Down.",
    "author": "Various One Piece Community Members",
    "source": {
      "url": "https://anime.stackexchange.com/questions/50592/is-gear-second-still-damaging-luffy",
      "title": "Is Gear Second still damaging Luffy?",
      "platform": "Anime & Manga Stack Exchange",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2018-01-01",
    "episodeRange": [272, 1100],
    "minEpisode": 272,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["luffy", "rob-lucci"],
    "relatedLocations": ["enies-lobby"],
    "relatedEvents": [],
    "tags": ["gear-second", "luffy", "lifespan", "power-up", "consequences"]
  },
  {
    "id": "theory-ep270-003",
    "title": "World Government's Systematic Deception of Giant Warriors",
    "summary": "A theory that the World Government has a pattern of deceiving and manipulating giants to serve their purposes, as evidenced by Oimo and Kashii's 50-year servitude.",
    "fullText": "The revelation that Oimo and Kashii were deceived for 50 years suggests the World Government has a systematic approach to controlling giants. Fans theorize that the World Government specifically targets giants because of their immense strength and long lifespans, using lies and manipulation to turn them into loyal servants. This could explain why there are so few giants in the Marines despite their obvious military value - most giants from Elbaf have a strong honor code that the World Government exploits through deception. The theory extends to suggest that the World Government may have similar operations targeting other powerful races like the Three-Eye Tribe, Lunarians, and Minks.",
    "author": "One Piece Reddit Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Oimo",
      "title": "Oimo - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2006-07-02",
    "episodeRange": [270, 900],
    "minEpisode": 270,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 900
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["oimo", "kashii", "dorry", "brogy"],
    "relatedLocations": ["enies-lobby", "elbaf"],
    "relatedEvents": ["ep270-event-007", "ep270-event-009"],
    "tags": ["world-government", "giants", "deception", "elbaf", "manipulation"]
  }
]
