[
  {
    "theoryTitle": "Usopp's Love Manifested the Klabautermann",
    "theoryText": "While the entire crew loved the Going Merry, it was Usopp's special dedication and care for the ship that specifically manifested the Klabautermann. Usopp took personal responsibility for maintaining the ship, and he was the first to see the spirit in Skypiea. The theory suggests that his deep emotional connection to the ship (which came from Kaya, someone precious to him) was the primary catalyst for the ship developing a conscious spirit.",
    "author": "CBR Analysis",
    "sourceUrl": "https://www.cbr.com/one-piece-usopp-love-fixed-going-merry-ship-klabautermann/",
    "platform": "ARTICLE",
    "publishDate": null,
    "relatedEpisodes": [167, 168, 312],
    "relatedCharacters": ["usopp", "going-merry"],
    "spoilerStatus": "CONTAINS_SPOILERS",
    "spoilerEpisodeRange": [1, 312],
    "popularity": {
      "upvotes": null,
      "views": null,
      "comments": null
    },
    "status": "SUPPORTED_BY_CANON",
    "evidence": [
      "Usopp was the first to see the Klabautermann in Skypiea (Episode 167)",
      "Usopp was the crew member most dedicated to ship maintenance",
      "The Going Merry was a gift from Kaya, making it personally significant to Usopp",
      "Usopp fought hardest against abandoning the ship in Water 7"
    ]
  },
  {
    "theoryTitle": "The Klabautermann Will Appear on the Thousand Sunny",
    "theoryText": "After the Going Merry's farewell, fans theorized that the Thousand Sunny, the Straw Hats' new ship, would eventually develop its own Klabautermann due to the crew's love and care. Some fans reported seeing brief appearances of what might be the Sunny's spirit in later episodes and in the special 'Episode of Merry', where the Going Merry's Klabautermann briefly appeared on the Sunny.",
    "author": "One Piece Fan Community",
    "sourceUrl": "https://onepiece.fandom.com/wiki/Episode_of_Merry",
    "platform": "COMMUNITY_DISCUSSION",
    "publishDate": null,
    "relatedEpisodes": [312, 320],
    "relatedCharacters": ["luffy", "franky"],
    "spoilerStatus": "CONTAINS_SPOILERS",
    "spoilerEpisodeRange": [312, 1000],
    "popularity": {
      "upvotes": null,
      "views": null,
      "comments": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "evidence": [
      "The Thousand Sunny was built with even more love and care than the Merry",
      "Franky built the Sunny to last and sail to the ends of the world",
      "In 'Episode of Merry' special, the Going Merry's spirit briefly appeared on the Thousand Sunny",
      "The conditions for a Klabautermann (love and care) are met"
    ]
  },
  {
    "theoryTitle": "Imu Connection to Ancient Kingdom Klabautermann",
    "theoryText": "A more speculative theory suggests that Imu, the mysterious ruler of the World Government, may have been a Klabautermann of an Ancient Kingdom ship. This theory attempts to explain Imu's longevity and connection to the Void Century by linking them to ship spirit mythology.",
    "author": "Reddit Theory (r/OnePiece)",
    "sourceUrl": "https://gamerant.com/one-piece-theory-klabautermann-relevant-final-saga/",
    "platform": "REDDIT",
    "publishDate": null,
    "relatedEpisodes": [312],
    "relatedCharacters": ["imu"],
    "spoilerStatus": "MAJOR_SPOILERS",
    "spoilerEpisodeRange": [312, 1100],
    "popularity": {
      "upvotes": null,
      "views": null,
      "comments": null
    },
    "status": "SPECULATIVE",
    "evidence": [
      "The Klabautermann concept establishes that ships can develop spirits",
      "Imu's mysterious nature and longevity need explanation",
      "The Ancient Kingdom likely had significant ships",
      "Would connect late-series mysteries to earlier world-building"
    ]
  },
  {
    "theoryTitle": "Dr. Hiriluk's Philosophy Applies to the Going Merry",
    "theoryText": "Fans connect Dr. Hiriluk's famous quote 'A man never dies until he is forgotten' to the Going Merry's legacy. The theory suggests that as long as the Straw Hats remember and honor the Going Merry, the ship's spirit lives on in their memories and in the Thousand Sunny, which carries on Merry's will.",
    "author": "One Piece Analysis Community",
    "sourceUrl": "https://neverwatchedonepiece.tumblr.com/post/126689455894/312-thank-you-merry-snow-falls-over-the",
    "platform": "BLOG",
    "publishDate": null,
    "relatedEpisodes": [90, 312],
    "relatedCharacters": ["going-merry", "luffy", "dr-hiriluk"],
    "spoilerStatus": "CONTAINS_SPOILERS",
    "spoilerEpisodeRange": [1, 312],
    "popularity": {
      "upvotes": null,
      "views": null,
      "comments": null
    },
    "status": "THEMATIC_INTERPRETATION",
    "evidence": [
      "The narrator explicitly connects this philosophy to the Going Merry's farewell",
      "The crew's memories keep the Merry 'alive' spiritually",
      "Thematic parallel between Hiriluk's death and Merry's death",
      "Both deaths emphasize legacy and memory over physical existence"
    ]
  }
]
