[
  {
    "name": {
      "english": "Going Merry",
      "japanese": "ゴーイング・メリー号",
      "romanized": "Gōingu Merī-gō"
    },
    "locationType": "SHIP",
    "seaRegion": "GRAND_LINE",
    "islandName": null,
    "debutEpisode": 17,
    "debutChapter": 41,
    "description": "The Straw Hat Pirates' first ship, a caravel gifted by Kaya and designed by Merry. The ship developed a Klabautermann (ship spirit) due to the crew's love and care, and made one final journey to rescue the crew from Enies Lobby before her keel broke irreparably.",
    "episodeAppearances": [312],
    "keyEvents": [
      {
        "episodeNumber": 312,
        "eventId": "ep312-event-003",
        "eventType": "WORLD_LORE",
        "title": "Iceburg Reveals Hearing Merry's Voice",
        "description": "Iceburg explains that he heard the Going Merry's voice on Scrap Island asking to sail one more time, prompting him to repair the ship for its final voyage to Enies Lobby.",
        "significance": "Confirms the supernatural nature of the ship's final journey and validates the existence of the Klabautermann.",
        "timestamp": "06:45"
      },
      {
        "episodeNumber": 312,
        "eventId": "ep312-event-005",
        "eventType": "DEATH",
        "title": "Going Merry's Keel Snaps",
        "description": "The Going Merry's keel breaks completely, causing the ship to split down the middle. The damage is confirmed to be irreparable.",
        "significance": "Marks the point of no return for the ship and forces the crew to accept the inevitable farewell.",
        "timestamp": "11:00"
      },
      {
        "episodeNumber": 312,
        "eventId": "ep312-event-009",
        "eventType": "CULTURAL_MOMENT",
        "title": "Going Merry's Final Words",
        "description": "The Going Merry's Klabautermann speaks to the crew one final time, apologizing for not being able to carry them further and thanking them for their love and care.",
        "significance": "The emotional climax of the episode and one of the most beloved moments in One Piece history. The ship's final words provide closure and confirm its status as a true crew member.",
        "timestamp": "19:00"
      },
      {
        "episodeNumber": 312,
        "eventId": "ep312-event-010",
        "eventType": "DEATH",
        "title": "Going Merry Burns and Sinks",
        "description": "The Going Merry is given a Viking funeral, burning and sinking beneath the waves as the crew watches in tears.",
        "significance": "The final moments of the Going Merry mark the end of an era for the Straw Hat Pirates. Voted the most beloved moment in One Piece in the anime's 25th anniversary poll.",
        "timestamp": "20:30"
      }
    ],
    "status": "DESTROYED",
    "statusHistory": [
      {
        "status": "DESTROYED",
        "episodeStart": 312,
        "episodeEnd": "present",
        "reason": "Ship's keel broke irreparably; given a Viking funeral by the Straw Hat Pirates"
      }
    ],
    "parentLocation": null,
    "childLocations": [],
    "relatedCharacters": ["luffy", "zoro", "nami", "usopp", "sanji", "chopper", "robin", "iceburg", "franky"],
    "relatedCrews": ["straw-hat-pirates"],
    "relatedArcs": ["Enies Lobby"],
    "images": []
  }
]
