[
  {
    "name": {
      "english": "Dance Powder",
      "japanese": "ダンスパウダー",
      "romanized": "Dansu Paudā",
      "aliases": []
    },
    "debutEpisode": 96,
    "debutChapter": 160,
    "episodeAppearances": [96],
    "itemType": "SUBSTANCE",
    "description": "A green powder that creates artificial rain by accelerating ice particle formation in sub-freezing clouds. Cannot create new water, only redistributes existing rainfall from one area to another, causing droughts in neighboring regions.",
    "keyMoments": [
      {
        "episodeNumber": 96,
        "eventId": "ep096-event-010",
        "momentType": "WORLD_LORE",
        "title": "Dance Powder Explained in Detail",
        "description": "Vivi and Nami provide comprehensive explanation of Dance Powder's mechanics, history, and role in Arabasta's crisis.",
        "significance": "Central plot device of the Arabasta Arc, key to understanding Crocodile's scheme",
        "timestamp": "18:30"
      },
      {
        "episodeNumber": 96,
        "eventId": "ep096-event-011",
        "momentType": "WORLD_LORE",
        "title": "Dance Powder and the King's Miracle",
        "description": "Revelation that Dance Powder was allegedly used in Alubarna to create the 'King's Miracle' while other regions suffered drought.",
        "significance": "Explains how Crocodile manipulated public opinion against King Cobra",
        "timestamp": "19:45"
      },
      {
        "episodeNumber": 96,
        "eventId": "ep096-event-012",
        "momentType": "WORLD_LORE",
        "title": "Dance Powder's Origin and World Government Ban",
        "description": "Explanation of how Dance Powder was created by a rain-deprived nation but caused war due to induced droughts, leading to a World Government ban punishable by death.",
        "significance": "Provides historical context and shows the severity of using Dance Powder",
        "timestamp": "21:00"
      }
    ],
    "properties": {
      "appearance": "Green powder",
      "effect": "Creates artificial rainfall by accelerating ice particle formation in clouds",
      "limitation": "Cannot create new water; only redistributes existing rainfall, causing droughts in other areas",
      "rawMaterial": "Silver (silver iodide)",
      "method": "Burned to create vapor that is released into the air"
    },
    "legalStatus": {
      "status": "BANNED",
      "authority": "World Government",
      "penalty": "Death",
      "reason": "Caused devastating war between nations due to induced droughts"
    },
    "historicalSignificance": "Originally created by a rain-deprived nation to bring joy through rainfall. Named for the happiness ('dance with joy') it would bring. However, its use caused droughts in neighboring regions, sparking a war with massive casualties.",
    "currentUse": {
      "episodeNumber": 96,
      "user": "Baroque Works (allegedly King Cobra)",
      "purpose": "Crocodile's organization secretly used Dance Powder to frame King Cobra, making it appear he was favoring Alubarna with rain while other regions suffered drought",
      "location": "Arabasta Kingdom (specifically Alubarna)"
    },
    "culturalReferences": "Based on real-world cloud seeding technology using silver iodide",
    "reveals": [
      {
        "infoType": "MECHANISM",
        "information": "Dance Powder works by accelerating ice particle creation in sub-freezing clouds to produce rapid heavy rainfall",
        "episodeRevealed": 96,
        "severity": "MAJOR"
      },
      {
        "infoType": "LIMITATION",
        "information": "Cannot create new water, only redistributes rainfall from one area to another",
        "episodeRevealed": 96,
        "severity": "MAJOR"
      },
      {
        "infoType": "LEGAL_STATUS",
        "information": "Banned by the World Government under penalty of death due to wars it caused",
        "episodeRevealed": 96,
        "severity": "MAJOR"
      },
      {
        "infoType": "POLITICAL_USE",
        "information": "Allegedly used by King Cobra to favor Alubarna with rain (actually part of Crocodile's frame-up)",
        "episodeRevealed": 96,
        "severity": "CRITICAL"
      }
    ]
  }
]
