[
  {
    "id": "g-8-base",
    "names": {
      "primary": "G-8 Marine Base",
      "aliases": ["Navarone", "Navarone Fortress"],
      "japanese": "海軍G-8支部",
      "romanized": "Kaigun G-8 Shibu"
    },
    "type": "MARINE_BASE",
    "debutEpisode": 196,
    "episodeAppearances": [204],
    "keyEvents": [
      {
        "episodeNumber": 204,
        "description": "The Straw Hats execute Usopp's plan to split into teams and retrieve their confiscated gold and waver",
        "timestamp": "03:15",
        "significance": "Central location for the episode's main conflict and strategic maneuvering"
      },
      {
        "episodeNumber": 204,
        "description": "Vice Admiral Jonathan sets up an ambush at the vault to trap the gold retrieval team",
        "timestamp": "14:15",
        "significance": "Demonstrates the fortress's security and Jonathan's control over the base"
      }
    ],
    "geography": {
      "region": "Paradise",
      "sea": "Grand Line",
      "climate": "Temperate",
      "terrain": "A massive fortified marine base built into and around a mountain, surrounded by water with defensive rock cliffs"
    },
    "description": "G-8 is a heavily fortified Marine base commanded by Vice Admiral Jonathan. It is one of the largest Marine installations in Paradise, featuring extensive facilities including a vault, medical wing, docks, and various administrative buildings. The base is enclosed by defensive walls and cliffs, making entry and exit extremely difficult."
  },
  {
    "id": "vault",
    "names": {
      "primary": "G-8 Vault",
      "aliases": ["Treasury", "Gold Storage"],
      "japanese": "金庫",
      "romanized": "Kinko"
    },
    "type": "BUILDING",
    "debutEpisode": 204,
    "episodeAppearances": [204],
    "keyEvents": [
      {
        "episodeNumber": 204,
        "description": "Usopp successfully picks the complex lock mechanism on the vault door",
        "timestamp": "12:30",
        "significance": "Demonstrates Usopp's technical skills and sets up the trap discovery"
      },
      {
        "episodeNumber": 204,
        "description": "The gold retrieval team discovers the vault is empty - Jonathan had moved the gold to his quarters",
        "timestamp": "16:45",
        "significance": "Reveals Jonathan's tactical foresight and adds a twist to the heist attempt"
      },
      {
        "episodeNumber": 204,
        "description": "Marines spring Jonathan's trap, surrounding the gold retrieval team",
        "timestamp": "14:15",
        "significance": "Creates immediate danger for Luffy, Zoro, Usopp, and Robin"
      }
    ],
    "geography": {
      "region": "Paradise",
      "sea": "Grand Line",
      "climate": "Indoor",
      "terrain": "Heavily secured vault room within G-8 Marine Base"
    },
    "description": "The vault is a high-security storage facility within the G-8 Marine Base, protected by a complex locking mechanism. It was expected to house the Straw Hats' confiscated Skypiea gold, but Vice Admiral Jonathan anticipated the theft attempt and moved the treasure elsewhere, using the vault as bait for an ambush."
  }
]
