[
  {
    "id": "theory-ep634-001",
    "theoryTitle": "Kyros is Rebecca's Father",
    "theoryText": "When Rebecca explains the legend of Kyros to Luffy, she speaks about him with deep reverence and knowledge. The fact that she knows so much about a gladiator who disappeared 20 years ago suggests a personal connection. Many fans theorize that Rebecca is Kyros's daughter, and that something terrible happened to him that caused everyone to forget their relationship. This would explain why Rebecca fights in the Colosseum and why she seems to carry on his legacy.",
    "author": "r/OnePiece Community",
    "platform": "Reddit",
    "episodesSpanned": [634, 703],
    "dateProposed": "2014-02-23",
    "spoilerStatus": {
      "isSpoiler": true,
      "spoilsEpisode": 703,
      "severity": "CRITICAL"
    },
    "theoryStatus": "CONFIRMED",
    "popularity": {
      "upvotes": 2500,
      "confidence": "HIGH"
    },
    "tags": ["rebecca", "kyros", "family-connection", "dressrosa-mystery"]
  },
  {
    "id": "theory-ep634-002",
    "theoryTitle": "Kyros Was Turned Into a Toy by Doflamingo",
    "theoryText": "The mysterious disappearance of Kyros 20 years ago coincides with Doflamingo's takeover of Dressrosa. Given that we've seen living toys walking around Dressrosa, some fans theorize that Kyros didn't truly disappear - he was transformed into a toy by one of Doflamingo's crew members with a Devil Fruit power. This would explain why everyone has a statue to remember him but no one seems to actually remember the man himself. The toy curse might erase people's memories of the person while leaving physical evidence behind.",
    "author": "One Piece Theory Crafters",
    "platform": "Various Forums",
    "episodesSpanned": [634, 678],
    "dateProposed": "2014-02-24",
    "spoilerStatus": {
      "isSpoiler": true,
      "spoilsEpisode": 678,
      "severity": "ULTRA_SECRET"
    },
    "theoryStatus": "CONFIRMED",
    "popularity": {
      "upvotes": 5000,
      "confidence": "VERY_HIGH"
    },
    "tags": ["kyros", "doflamingo", "toy-curse", "sugar", "dressrosa-conspiracy"]
  },
  {
    "id": "theory-ep634-003",
    "theoryTitle": "Blackbeard Plans to Give Mera Mera no Mi to a Crew Member",
    "theoryText": "Jesus Burgess's participation in the tournament reveals that the Blackbeard Pirates are interested in obtaining Ace's former Devil Fruit. Since Blackbeard already has two Devil Fruit powers (which should be impossible), fans theorize that he's collecting powerful Devil Fruits to distribute among his crew members to create the most powerful pirate crew in history. Burgess might be trying to win the Mera Mera no Mi for himself, or perhaps for another crew member. This could be Blackbeard's strategy to compete with the other Emperors.",
    "author": "GrandLineReview Community",
    "platform": "YouTube Comments",
    "episodesSpanned": [634, 745],
    "dateProposed": "2014-02-25",
    "spoilerStatus": {
      "isSpoiler": true,
      "spoilsEpisode": 745,
      "severity": "MAJOR"
    },
    "theoryStatus": "PARTIALLY_CONFIRMED",
    "popularity": {
      "views": 150000,
      "confidence": "MEDIUM"
    },
    "tags": ["blackbeard-pirates", "jesus-burgess", "mera-mera-no-mi", "devil-fruit-collection"]
  },
  {
    "id": "theory-ep634-004",
    "theoryTitle": "Cavendish Has a Split Personality",
    "theoryText": "Cavendish's obsessive behavior and the way he speaks about his fame being stolen suggests something deeper about his character. Some fans noticed unusual hints in his mannerisms and theorize that he might have a split personality or some kind of curse. His epithet 'of the White Horse' might be significant - perhaps he has an alter ego that is the opposite of his beautiful, vain persona. This could be revealed later in the arc as a major plot point.",
    "author": "Arlong Park Forums",
    "platform": "Forum",
    "episodesSpanned": [634, 644],
    "dateProposed": "2014-02-26",
    "spoilerStatus": {
      "isSpoiler": true,
      "spoilsEpisode": 644,
      "severity": "CRITICAL"
    },
    "theoryStatus": "CONFIRMED",
    "popularity": {
      "posts": 450,
      "confidence": "MEDIUM"
    },
    "tags": ["cavendish", "hakuba", "split-personality", "character-mystery"]
  },
  {
    "id": "theory-ep634-005",
    "theoryTitle": "Bellamy Will Betray Doflamingo",
    "theoryText": "Bellamy's character development is significant - he went from mocking dreams to pursuing Sky Island himself, proving Luffy right. However, he still desperately seeks Doflamingo's approval. Fans theorize that Bellamy's arc will culminate in him realizing that Doflamingo doesn't truly value him, leading to Bellamy switching sides and helping Luffy against Doflamingo. His statement about 'no bad blood' with Luffy suggests he's already changing his perspective.",
    "author": "One Piece Discussion Forum",
    "platform": "Reddit",
    "episodesSpanned": [634, 723],
    "dateProposed": "2014-02-27",
    "spoilerStatus": {
      "isSpoiler": true,
      "spoilsEpisode": 723,
      "severity": "MAJOR"
    },
    "theoryStatus": "PARTIALLY_CONFIRMED",
    "popularity": {
      "upvotes": 1800,
      "confidence": "MEDIUM"
    },
    "tags": ["bellamy", "doflamingo", "character-development", "redemption"]
  }
]
