[
  {
    "name": {
      "english": "Corrida Colosseum",
      "japanese": "コリーダコロシアム",
      "romanized": "Korīda Koroshiamu",
      "aliases": []
    },
    "debutEpisode": 631,
    "debutChapter": 702,
    "episodeAppearances": [634],
    "locationType": "ARENA",
    "islandOrRegion": "Dressrosa",
    "description": "A massive gladiatorial arena in Dressrosa where fighters compete in tournament battles. The Colosseum features a large bronze statue of the legendary gladiator Kyros and hosts monthly tournaments for prizes.",
    "keyEvents": [
      {
        "episodeNumber": 634,
        "eventId": "ep634-event-001",
        "title": "Cavendish's Grand Entrance",
        "description": "Cavendish makes his first appearance at the Colosseum, encountering Luffy in the waiting area.",
        "significance": "The Colosseum serves as the gathering place for major fighters competing for the Mera Mera no Mi.",
        "timestamp": "04:30"
      },
      {
        "episodeNumber": 634,
        "eventId": "ep634-event-004",
        "title": "The Legend of Kyros",
        "description": "Rebecca tells Luffy about the legendary gladiator Kyros and his statue at the Colosseum.",
        "significance": "Reveals the Colosseum's historical significance and introduces one of Dressrosa's greatest mysteries.",
        "timestamp": "10:20"
      },
      {
        "episodeNumber": 634,
        "eventId": "ep634-event-008",
        "title": "Jesus Burgess Wins Block A",
        "description": "The first block of the tournament concludes with Jesus Burgess revealed as the dominant winner.",
        "significance": "Demonstrates the high level of competition and the dangerous fighters gathered at the Colosseum.",
        "timestamp": "18:30"
      }
    ],
    "notableFeatures": [
      {
        "feature": "Bronze Statue of Kyros",
        "description": "A massive bronze statue commemorating Kyros the Undefeated, who won 3,000 consecutive matches without a single loss.",
        "episodeIntroduced": 634
      },
      {
        "feature": "Tournament Blocks",
        "description": "The tournament is organized into multiple blocks (A, B, C, D) with 137-139 fighters per block competing in battle royales.",
        "episodeIntroduced": 634
      },
      {
        "feature": "Waiting Area",
        "description": "A backstage area where gladiators prepare before their matches and interact with each other.",
        "episodeIntroduced": 634
      }
    ],
    "currentStatus": "ACTIVE",
    "statusHistory": [
      {
        "status": "ACTIVE",
        "episodeStart": 631,
        "episodeEnd": "present",
        "description": "Hosting a major tournament with the Mera Mera no Mi as the grand prize."
      }
    ],
    "politicalAffiliation": "Dressrosa Kingdom / Donquixote Family",
    "culturalSignificance": "The Corrida Colosseum is a major entertainment venue in Dressrosa and a symbol of the kingdom's gladiatorial tradition. It attracts fighters from around the world and serves as a gathering place for pirates, revolutionaries, and Marines alike.",
    "images": []
  }
]
