[
  {
    "name": {
      "english": "Mark-Mark Fruit",
      "japanese": "マトマトの実",
      "romanized": "Mato Mato no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 526,
    "debutChapter": 607,
    "description": "A Paramecia-type Devil Fruit that allows the user to mark targets by touching them with their bare hands. Any object thrown from the same hand will lock onto the target and chase it until the target is hit or the object is stopped by an obstacle. The user can memorize as many targets as they have hands.",
    "episodeAppearances": [526],
    "users": [
      {
        "characterId": "vander-decken-ix",
        "episodeStart": null,
        "episodeEnd": "present",
        "circumstances": "Vander Decken IX ate the fruit at an unknown time in the past"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Target Marking",
        "episodeRevealed": 526,
        "description": "The user can mark someone as a target by touching them with their bare hand. Anything thrown from that hand will lock onto and chase the target.",
        "severity": "MAJOR",
        "firstUseContext": "Vander Decken IX is shown commanding his forces from the Flying Dutchman, with his Mark-Mark Fruit abilities implied through his reputation."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 526,
        "severity": "CRITICAL"
      },
      {
        "weakness": "Abilities are nullified if the user falls unconscious or dies",
        "episodeRevealed": null,
        "severity": "MAJOR"
      },
      {
        "weakness": "The thrown object must physically travel to the target and can be blocked by obstacles",
        "episodeRevealed": null,
        "severity": "MINOR"
      }
    ],
    "strengths": [
      {
        "strength": "Perfect accuracy on marked targets regardless of distance",
        "episodeRevealed": null,
        "description": "Any object thrown will pursue the target relentlessly.",
        "severity": "MAJOR"
      },
      {
        "strength": "Can mark multiple targets simultaneously",
        "episodeRevealed": null,
        "description": "The user can mark as many targets as they have hands (typically two).",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "UNCOMMON",
    "powerTier": "MEDIUM"
  }
]
