[
  {
    "id": "theory-ep526-001",
    "title": "Vander Decken's Mark-Mark Fruit Has Ancient Connections",
    "summary": "Some fans theorize that Vander Decken IX's Mato Mato no Mi (Mark-Mark Fruit) may have connections to ancient weapons or the Void Century, given the Decken family's long history and the fruit's unique targeting abilities.",
    "fullText": "The Mato Mato no Mi's ability to mark and track targets indefinitely has led some fans to speculate about potential connections to ancient technology or weapons. The Decken family's multi-generational pursuit of mermaids and their possession of this specific fruit raises questions about whether there's a deeper historical significance. Some theorize the fruit could have been used in the Void Century for tracking purposes or that it might relate to the ancient weapons' targeting systems.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Mato_Mato_no_Mi",
      "title": "Mato Mato no Mi - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-19"
    },
    "postedDate": null,
    "episodeRange": [526, 573],
    "minEpisode": 526,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 573
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["vander-decken-ix"],
    "relatedLocations": ["fish-man-island"],
    "relatedEvents": ["ep526-event-001"],
    "tags": ["devil-fruit", "vander-decken", "ancient-history", "void-century"]
  },
  {
    "id": "theory-ep526-002",
    "title": "Fish-Man Island's Inevitable Destruction",
    "summary": "With the introduction of multiple threats (New Fish-Man Pirates, Vander Decken IX, and the volatile deep-sea environment), fans theorized early in the arc that Fish-Man Island might face catastrophic destruction, potentially fulfilling earlier prophecies.",
    "fullText": "Episode 526's introduction of both the New Fish-Man Pirates and Vander Decken IX, combined with the dangerous deep-sea environment (volcanic activity, structural vulnerabilities), led fans to theorize that Fish-Man Island might be destroyed during or after the arc. This theory gained traction given the thematic elements about the fish-men and merfolk needing to come to the surface, as well as Madame Shirley's prophecy about Luffy destroying the island. The convergence of multiple threats in this episode seemed to foreshadow a major catastrophe.",
    "author": "One Piece Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Fish-Man_Island_Arc",
      "title": "Fish-Man Island Arc - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-19"
    },
    "postedDate": null,
    "episodeRange": [526, 574],
    "minEpisode": 526,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 574
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["luffy", "shirahoshi", "hody-jones", "vander-decken-ix"],
    "relatedLocations": ["fish-man-island"],
    "relatedEvents": ["ep526-event-009"],
    "tags": ["prophecy", "fish-man-island", "destruction", "foreshadowing"]
  },
  {
    "id": "theory-ep526-003",
    "title": "The New Fish-Man Pirates' Knowledge Suggests Larger Network",
    "summary": "Hammond's immediate recognition of the Straw Hats and detailed knowledge of their actions (defeating Arlong, protecting Hatchan, punching a Celestial Dragon) suggests the New Fish-Man Pirates have an intelligence network or connections to the surface world.",
    "fullText": "In episode 526, Hammond demonstrates surprising knowledge about the Straw Hats' specific actions, including events at Arlong Park and Sabaody Archipelago. This led fans to theorize that the New Fish-Man Pirates, despite being on an island 10,000 meters underwater, have established information networks or connections to surface-world pirates and criminals. Some theorized connections to the underground brokers, while others suggested they might have spies or informants in various locations. This theory raised questions about how isolated Fish-Man Island really is from surface-world events.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Hammond",
      "title": "Hammond - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-19"
    },
    "postedDate": null,
    "episodeRange": [526, 560],
    "minEpisode": 526,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 560
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["hammond", "hody-jones", "luffy"],
    "relatedLocations": ["fish-man-island"],
    "relatedEvents": ["ep526-event-011"],
    "tags": ["new-fish-man-pirates", "intelligence", "information-network"]
  }
]
