[
  {
    "id": "shusui",
    "name": {
      "english": "Shusui",
      "japanese": "秋水",
      "romanized": "Shūsui"
    },
    "itemType": "WEAPON",
    "subType": "MEITO_SWORD",
    "grade": "O_WAZAMONO",
    "debutEpisode": 362,
    "debutChapter": 467,
    "description": "A legendary black blade and one of the 21 Great Grade swords (大業物 Ō Wazamono). It was once wielded by the legendary samurai Shimotsuki Ryuma and is considered a national treasure of Wano Country. The blade was turned black through countless battles, a testament to Ryuma's mastery.",
    "currentOwner": "zoro",
    "previousOwners": ["ryuma", "ryuma-zombie"],
    "episodeAppearances": [362],
    "keyMoments": [
      {
        "episodeNumber": 362,
        "eventId": "ep362-event-007",
        "title": "Passed to Zoro",
        "description": "After being defeated, Ryuma sheathes Shusui and throws it to Zoro, recognizing him as a worthy successor to wield the legendary blade.",
        "significance": "Zoro acquires one of the most powerful swords in the One Piece world, replacing his broken Yubashiri.",
        "timestamp": "18:10"
      }
    ],
    "properties": {
      "isBlackBlade": true,
      "specialAbilities": [
        "Increased cutting power due to black blade status",
        "Enhanced durability - cannot be bent or damaged easily",
        "Heavier than normal katana, adding force to strikes"
      ],
      "weight": "Heavy",
      "appearance": "A curved katana with a black blade, a cross-shaped tsuba (guard), and a distinctive handle wrap"
    },
    "historicalSignificance": "Wielded by Shimotsuki Ryuma, the legendary 'Sword God' who protected Wano Country and slayed a dragon over the Flower Capital. The sword was stolen from Ryuma's grave by Gecko Moria 23 years before the current timeline and placed in his zombie body.",
    "culturalContext": "National treasure of Wano Country, representing the pinnacle of swordsmithing and the legacy of one of Wano's greatest heroes.",
    "relatedCharacters": ["zoro", "ryuma", "ryuma-zombie"],
    "relatedLocations": ["wano", "thriller-bark"],
    "trivia": [
      {
        "fact": "Shusui is one of the very few black blades in the One Piece world, turned black through Ryuma's countless battles and mastery of Haki.",
        "sources": [
          {
            "url": "https://onepiece.fandom.com/wiki/Shusui",
            "title": "Shusui - One Piece Wiki",
            "platform": "Fandom",
            "accessedAt": "2025-11-25"
          }
        ]
      },
      {
        "fact": "Zoro would later return Shusui to Wano Country in exchange for Enma during the Wano Arc, honoring the sword's cultural significance to the people of Wano.",
        "sources": [
          {
            "url": "https://www.coolkatana.com/blogs/news/why-did-zoro-part-with-shusui-the-significance-of-his-choice",
            "title": "Why Did Zoro Part with Shusui? The Significance of His Choice",
            "platform": "COOLKATANA",
            "accessedAt": "2025-11-25"
          }
        ]
      },
      {
        "fact": "The sword's name 'Shusui' (秋水) literally means 'Autumn Water' in Japanese.",
        "sources": []
      }
    ]
  }
]
