[
  {
    "abilityName": "Parasite",
    "japaneseName": "寄生糸 (パラサイト)",
    "romanizedName": "Parasaito",
    "abilityType": "DEVIL_FRUIT",
    "debutEpisode": 207,
    "debutChapter": 303,
    "episodeAppearances": [207],
    "userId": "doflamingo",
    "devilFruitId": "ito-ito-no-mi",
    "description": "A technique where Doflamingo attaches nearly invisible strings to his target's body, allowing him to puppeteer their movements like a marionette. The victims are unable to resist and can be forced to perform any action, including fighting and killing their allies. He can control multiple people simultaneously with apparent ease.",
    "firstUse": {
      "episodeNumber": 207,
      "eventId": "ep207-event-001",
      "context": "Doflamingo uses Parasite to control Bellamy and Sarquiss, forcing them to fight each other as punishment for losing to Luffy.",
      "timestamp": "02:15",
      "target": ["bellamy", "sarquiss"]
    },
    "mechanics": [
      "Attaches thin, nearly invisible strings to target's body",
      "Allows complete control over target's physical movements",
      "Can control multiple targets simultaneously",
      "Victims are conscious but unable to resist control",
      "Controlled movements match the user's finger motions"
    ],
    "strengths": [
      "Complete control over victims' bodies",
      "Can force allies to fight each other",
      "Strings are nearly invisible",
      "Can control multiple people at once",
      "Victims remain conscious, adding psychological torment"
    ],
    "weaknesses": [
      "Requires line of sight or proximity to target",
      "User must maintain control through finger movements"
    ],
    "variations": [],
    "combatApplications": [
      "Forcing enemies to fight each other",
      "Using controlled victims as shields or weapons",
      "Psychological warfare through forced actions",
      "Crowd control in large battles"
    ],
    "trainingRequired": "Unknown - appears to be an advanced application of the Ito Ito no Mi",
    "energyCost": "Unknown",
    "range": "Medium to long range",
    "damageType": "CONTROL",
    "element": null,
    "category": "DEVIL_FRUIT_TECHNIQUE",
    "powerLevel": "EXTREMELY_POWERFUL",
    "significance": "This is the first major demonstration of Doflamingo's devil fruit abilities in the series, establishing him as a formidable Warlord with terrifying control powers. The technique showcases the Ito Ito no Mi's potential for psychological and physical manipulation.",
    "culturalNotes": [
      "Named after parasitic organisms that control their hosts",
      "Reflects the puppeteer/marionette theme of the Ito Ito no Mi"
    ],
    "sources": [
      {
        "url": "https://onepiece.fandom.com/wiki/Ito_Ito_no_Mi",
        "title": "Ito Ito no Mi - One Piece Wiki",
        "platform": "Fandom",
        "accessedAt": "2025-11-18"
      }
    ]
  }
]
