[
  {
    "id": "dance-powder",
    "name": {
      "english": "Dance Powder",
      "japanese": "ダンスパウダー",
      "romanized": "Dansu Paudā"
    },
    "debutEpisode": 93,
    "debutChapter": 160,
    "episodeAppearances": [97],
    "itemType": "CHEMICAL_SUBSTANCE",
    "rarity": "FORBIDDEN",
    "description": "Dance Powder is a green powder that can create artificial rain by accelerating the formation of ice particles in sub-freezing temperature clouds. When burned, it creates vapor that rises into the atmosphere and causes immediate heavy rainfall. However, it cannot create new water—it only redirects existing rainfall from one area to another, causing severe droughts in surrounding regions.",
    "properties": {
      "color": "Green",
      "form": "Powder",
      "primaryIngredient": "Silver (silver iodide)",
      "activation": "Must be burned to create vapor",
      "effect": "Artificial rainfall creation through cloud seeding"
    },
    "keyMoments": [
      {
        "episodeNumber": 97,
        "eventId": "ep097-event-001",
        "title": "Dance Powder Explanation",
        "description": "Vivi and Nami explain the mechanism and consequences of Dance Powder to the crew during their desert journey. They detail how it was used to frame King Cobra and create civil unrest in Arabasta.",
        "significance": "Reveals the scientific and political mechanism behind Arabasta's drought and rebellion, showing how Crocodile manipulated the kingdom.",
        "timestamp": "03:15"
      }
    ],
    "historicalSignificance": "Dance Powder's use historically caused wars between nations due to its environmental consequences. The devastation was so severe that the World Government prohibited its manufacturing, possession, and use worldwide, with violation punishable by death.",
    "legalStatus": "BANNED_WORLDWIDE",
    "banDetails": {
      "bannedBy": "World Government",
      "reason": "Caused wars due to environmental manipulation and drought creation",
      "penalty": "Death",
      "episodeRevealed": 97
    },
    "usage": [
      {
        "user": "Baroque Works (framing King Cobra)",
        "purpose": "Create artificial drought and frame Arabasta's king",
        "episodeUsed": 93,
        "outcome": "Successfully destabilized Arabasta and turned citizens against King Cobra"
      }
    ],
    "reveals": [
      {
        "infoType": "MECHANISM",
        "information": "Dance Powder accelerates ice particle formation in clouds but cannot create new water, only redirect existing rainfall",
        "episodeRevealed": 97,
        "severity": "MAJOR"
      },
      {
        "infoType": "CONSEQUENCE",
        "information": "Using Dance Powder in one location causes droughts in surrounding areas, leading to conflicts and wars",
        "episodeRevealed": 97,
        "severity": "MAJOR"
      },
      {
        "infoType": "LEGAL_STATUS",
        "information": "The World Government banned Dance Powder worldwide with death as the penalty for its use",
        "episodeRevealed": 97,
        "severity": "MAJOR"
      }
    ],
    "realWorldInspiration": "Dance Powder is based on the real-world practice of cloud seeding using silver iodide, which can promote precipitation by providing nucleation sites for ice crystal formation in clouds.",
    "culturalImpact": "Dance Powder represents the dangers of environmental manipulation and serves as a plot device showing how Baroque Works engineered Arabasta's civil war through artificial drought creation."
  }
]
