[
  {
    "id": "sandora-desert",
    "name": {
      "english": "Sandora Desert",
      "japanese": "サンドラ砂漠",
      "romanized": "Sandora Sabaku"
    },
    "debutEpisode": 96,
    "debutChapter": 161,
    "episodeAppearances": [97],
    "locationType": "DESERT",
    "region": "Arabasta Kingdom",
    "island": "Arabasta",
    "keyEvents": [
      {
        "episodeNumber": 97,
        "eventId": "ep097-event-001",
        "title": "Dance Powder Explanation",
        "description": "While traversing the Sandora Desert, Vivi explains the environmental impact of Dance Powder and how it has been used to manipulate Arabasta's climate.",
        "timestamp": "03:15",
        "significance": "Reveals crucial information about the conspiracy affecting Arabasta while the crew experiences the harsh desert conditions firsthand."
      },
      {
        "episodeNumber": 97,
        "eventId": "ep097-event-005",
        "title": "Warusagi Birds Steal Supplies",
        "description": "The crew's supplies are stolen by Warusagi birds, demonstrating one of the desert's unique dangers beyond heat and thirst.",
        "timestamp": "12:40",
        "significance": "Shows the variety of survival challenges in the Sandora Desert ecosystem."
      },
      {
        "episodeNumber": 97,
        "eventId": "ep097-event-008",
        "title": "Luffy Rescues Matsuge",
        "description": "Luffy rescues Matsuge the camel from carnivorous plants in the desert, gaining a new ally and transportation.",
        "timestamp": "16:45",
        "significance": "Introduction of Matsuge, who becomes essential for desert travel."
      },
      {
        "episodeNumber": 97,
        "eventId": "ep097-event-010",
        "title": "Ace Defeats Sandora Lizard",
        "description": "Ace is swallowed by a giant Sandora Lizard but defeats it from within using his fire powers, providing food for the crew.",
        "timestamp": "19:45",
        "significance": "Demonstrates both the dangers of the desert's megafauna and Ace's combat abilities."
      }
    ],
    "description": "The Sandora Desert is a vast, scorching desert that covers much of Arabasta. It is home to dangerous wildlife including Sandora Lizards (giant carnivorous lizards), Warusagi birds (thieving birds that pretend to be dead), poisonous scorpions, and carnivorous plants that hide beneath the sand. The extreme heat and limited water make it treacherous to cross.",
    "climate": "Extremely hot and arid with intense daytime heat and cold nights. Occasional sandstorms.",
    "notableFeatures": [
      "Home to giant Sandora Lizards that hunt from beneath the sand",
      "Warusagi birds that steal from travelers by playing dead",
      "Carnivorous plants hidden under the sand",
      "Extremely poisonous scorpions",
      "Limited water sources",
      "Intense heat during the day"
    ],
    "wildlife": [
      {
        "species": "Sandora Lizard",
        "description": "Giant purple lizards that hide underground and ambush prey. They are massive enough to swallow humans whole and hunt in the desert.",
        "dangerLevel": "HIGH"
      },
      {
        "species": "Warusagi Birds",
        "description": "Crane-like birds that pretend to be dead to trick travelers, then steal their belongings. Known as 'thief birds' or 'bandit birds.' The name is a wordplay on 'waru' (bad) and 'sagi' (heron/swindler).",
        "dangerLevel": "MEDIUM"
      },
      {
        "species": "Carnivorous Plants",
        "description": "Man-eating plants that hide beneath the sand and emerge to capture prey. Strong enough to capture and consume humans.",
        "dangerLevel": "HIGH"
      },
      {
        "species": "Poisonous Scorpions",
        "description": "Extremely venomous scorpions whose sting can be fatal. Luffy mistakes one for a shrimp.",
        "dangerLevel": "HIGH"
      },
      {
        "species": "Camels",
        "description": "Desert-dwelling camels adapted to the harsh environment. Matsuge is an example of this species.",
        "dangerLevel": "NONE"
      }
    ],
    "currentStatus": "ACTIVE",
    "statusHistory": [
      {
        "status": "ACTIVE",
        "episodeStart": 96,
        "episodeEnd": "present",
        "description": "The Sandora Desert remains a dangerous but traversable region of Arabasta"
      }
    ],
    "culturalSignificance": "The Sandora Desert is a major geographical barrier in Arabasta, separating different regions of the kingdom. Its harsh conditions make it a significant challenge for travelers heading to locations like Yuba.",
    "politicalControl": "Arabasta Kingdom",
    "reveals": [
      {
        "infoType": "WILDLIFE",
        "information": "The desert is home to Warusagi birds that steal from travelers",
        "episodeRevealed": 97,
        "severity": "MINOR"
      },
      {
        "infoType": "WILDLIFE",
        "information": "Carnivorous plants hide beneath the sand waiting to ambush prey",
        "episodeRevealed": 97,
        "severity": "MINOR"
      },
      {
        "infoType": "WILDLIFE",
        "information": "Giant Sandora Lizards hunt from beneath the sand",
        "episodeRevealed": 97,
        "severity": "MINOR"
      }
    ]
  }
]
