[
  {
    "name": {
      "english": "Rumble-Rumble Fruit",
      "japanese": "ゴロゴロの実",
      "romanized": "Goro Goro no Mi"
    },
    "type": "LOGIA",
    "debutEpisode": 167,
    "episodeAppearances": [191],
    "currentUser": "enel",
    "previousUsers": [],
    "abilities": [
      {
        "abilityName": "Lightning Attack",
        "episodeFirstUsed": 167,
        "description": "User can generate and control massive amounts of electricity and lightning.",
        "limitations": "Ineffective against rubber, which is a natural insulator."
      },
      {
        "abilityName": "Raigou",
        "episodeFirstUsed": 190,
        "description": "Enel's ultimate technique where he condenses massive thunderclouds into a spherical mass of lightning that can destroy entire islands.",
        "limitations": "Requires significant preparation and the creation of thunderclouds."
      },
      {
        "abilityName": "Intangibility",
        "episodeFirstUsed": 167,
        "description": "As a Logia-type Devil Fruit, the user can transform into lightning and become intangible to most physical attacks.",
        "limitations": "Negated by Seastone and ineffective against insulators like rubber."
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 191,
        "eventId": "ep191-event-006",
        "title": "Lightning Attacks on Giant Jack",
        "description": "Enel uses his Goro Goro no Mi powers to launch devastating lightning attacks on Zoro and the others attempting to cut down Giant Jack.",
        "significance": "Demonstrates Enel's long-range offensive capabilities and his awareness of the crew's plans."
      },
      {
        "episodeNumber": 191,
        "eventId": "ep191-event-009",
        "title": "Attacks Luffy and Nami",
        "description": "Enel launches lightning attacks at Luffy and Nami as they ride up the falling beanstalk toward the Ark Maxim.",
        "significance": "Shows Enel's attempt to stop Luffy from reaching him, though the attacks prove ineffective against Luffy's rubber body."
      },
      {
        "episodeNumber": 191,
        "eventId": "ep191-event-010",
        "title": "Raigou Preparation",
        "description": "Enel prepares his ultimate Raigou technique by condensing massive thunderclouds to destroy all of Skypiea.",
        "significance": "Establishes the full destructive potential of the Goro Goro no Mi and the stakes of the final battle."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Rubber",
        "description": "Rubber is a natural insulator and completely negates the electrical powers of the Goro Goro no Mi.",
        "episodeRevealed": 182
      },
      {
        "weakness": "Seastone",
        "description": "Like all Devil Fruit users, Enel is vulnerable to Seastone, which nullifies his powers.",
        "episodeRevealed": 182
      }
    ]
  }
]
