[
  {
    "name": {
      "english": "Giant Jack",
      "japanese": "ジャイアントジャック",
      "romanized": "Jaianto Jakku"
    },
    "locationType": "LANDMARK",
    "debutEpisode": 176,
    "episodeAppearances": [191],
    "keyEvents": [
      {
        "episodeNumber": 191,
        "eventId": "ep191-event-005",
        "title": "Zoro Cuts Giant Jack",
        "description": "Roronoa Zoro delivers a powerful slash that cuts halfway through the massive trunk of Giant Jack.",
        "significance": "First major attempt to topple the enormous beanstalk.",
        "timestamp": "13:50"
      },
      {
        "episodeNumber": 191,
        "eventId": "ep191-event-008",
        "title": "Wyper Fells Giant Jack with Reject Dial",
        "description": "Wyper uses his Reject Dial to deliver the final blow that causes Giant Jack to begin falling westward.",
        "significance": "The successful toppling of Giant Jack enables Luffy and Nami to reach Enel.",
        "timestamp": "18:45"
      },
      {
        "episodeNumber": 191,
        "eventId": "ep191-event-009",
        "title": "Luffy and Nami Ride the Falling Beanstalk",
        "description": "Luffy and Nami ride the waver at full speed up the falling Giant Jack toward Enel's Ark Maxim.",
        "significance": "The falling beanstalk becomes the path to the final confrontation with Enel.",
        "timestamp": "20:15"
      }
    ],
    "description": "Giant Jack is a colossal beanstalk that towers through the center of Upper Yard and extends high into the sky of Skypiea. It passes through the ancient ruins of Shandora and serves as the route to reach the Golden Belfry at its peak. The Straw Hats devise a plan to cut it down to use it as a path to Enel.",
    "parentLocation": "Upper Yard",
    "isDestroyed": true,
    "destructionEpisode": 191
  },
  {
    "name": {
      "english": "Upper Yard",
      "japanese": "アッパーヤード",
      "romanized": "Appā Yādo"
    },
    "locationType": "REGION",
    "debutEpisode": 153,
    "episodeAppearances": [191],
    "keyEvents": [
      {
        "episodeNumber": 191,
        "eventId": "ep191-event-001",
        "title": "Robin Reveals Noland's Connection to Cricket",
        "description": "Robin explains to Wyper that Mont Blanc Noland has a descendant searching for the Gold City.",
        "significance": "This conversation takes place in Upper Yard and creates understanding between the Shandia and Straw Hats.",
        "timestamp": "03:15"
      }
    ],
    "description": "Upper Yard is the sacred land of the Shandia people, originally part of the island of Jaya before it was knocked up into the sky 400 years ago. It contains the ancient ruins of Shandora, including the Golden Belfry and the Golden Bell. The area serves as the main battleground for the conflict between Enel, the Shandia, and the Straw Hats.",
    "parentLocation": "Skypiea",
    "isDestroyed": false
  },
  {
    "name": {
      "english": "Ark Maxim",
      "japanese": "方舟マクシム",
      "romanized": "Hakobune Makushimu"
    },
    "locationType": "SHIP",
    "debutEpisode": 182,
    "episodeAppearances": [191],
    "keyEvents": [
      {
        "episodeNumber": 191,
        "eventId": "ep191-event-009",
        "title": "Luffy and Nami Approach Ark Maxim",
        "description": "Luffy and Nami ride the falling Giant Jack toward the Ark Maxim where Enel awaits.",
        "significance": "The Ark Maxim becomes the destination for the final confrontation.",
        "timestamp": "20:15"
      }
    ],
    "description": "Ark Maxim is a massive flying ship built by Enel using Skypiean technology, Shandorian gold, and the electrical power of his Goro Goro no Mi. Enel intends to use it to travel to Fairy Vearth (the moon) after destroying Skypiea with his Raigou attack. The ship is powered by Enel's lightning and represents his ultimate plan for godhood.",
    "parentLocation": "Skypiea",
    "isDestroyed": false
  },
  {
    "name": {
      "english": "Golden Belfry",
      "japanese": "黄金の大鐘楼",
      "romanized": "Ōgon no Dai Shōrō"
    },
    "locationType": "LANDMARK",
    "debutEpisode": 187,
    "episodeAppearances": [191],
    "keyEvents": [
      {
        "episodeNumber": 191,
        "eventId": "ep191-event-003",
        "title": "Enel Discovers the Golden Bell",
        "description": "Enel reaches the great Belfry and discovers the magnificent Golden Bell, the first person to reach it in 400 years.",
        "significance": "The discovery of the Golden Bell by Enel sets up the final confrontation at the symbolic heart of the Shandia-Noland story.",
        "timestamp": "08:45"
      }
    ],
    "description": "The Golden Belfry is the structure at the peak of Giant Jack that houses the legendary Golden Bell of Shandora. This bell was rung by Kalgara every day to signal to Mont Blanc Noland, and its sound can be heard from far below. The belfry is covered in vines and tilted from centuries of neglect, but remains a powerful symbol of the promise between Kalgara and Noland.",
    "parentLocation": "Upper Yard",
    "isDestroyed": false
  },
  {
    "name": {
      "english": "Shandora",
      "japanese": "シャンドラ",
      "romanized": "Shandora"
    },
    "locationType": "CITY",
    "debutEpisode": 187,
    "episodeAppearances": [191],
    "keyEvents": [
      {
        "episodeNumber": 191,
        "eventId": "ep191-event-007",
        "title": "Nola's Flashback to Ancient Shandora",
        "description": "Nola remembers 400 years ago when Kalgara and Seto would ring the Golden Bell in ancient Shandora.",
        "significance": "The flashback provides emotional connection to the ancient city and its lost civilization.",
        "timestamp": "17:30"
      }
    ],
    "description": "Shandora is the ancient city of gold that was once located on Jaya before being knocked up into the sky 400 years ago. Known as the Golden City, it was home to the Shandia people and contained incredible treasures including the Golden Bell. The city fell into ruins after being sent to Skypiea and has been fought over ever since. In flashbacks, it appears as a thriving civilization with strong warriors like Kalgara.",
    "parentLocation": "Upper Yard",
    "isDestroyed": false
  }
]
