[
  {
    "name": {
      "english": "Pet-Pet Fruit",
      "japanese": "ペトペトの実",
      "romanized": "Peto Peto no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 626,
    "debutChapter": null,
    "description": "Allows the user to control any living creature by producing green gel-like collars from their hands. Once placed on a victim's neck, the collar solidifies and forces them to obey all verbal commands from the user.",
    "episodeAppearances": [627],
    "users": [
      {
        "characterId": "breed",
        "episodeStart": 626,
        "episodeEnd": 628,
        "circumstances": "Breed ate the fruit at an unknown time before the events of the Caesar Retrieval Arc"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Dual Collar Control",
        "episodeRevealed": 627,
        "description": "User can control multiple powerful individuals simultaneously, including Devil Fruit users like Luffy and Law.",
        "severity": "MAJOR",
        "firstUseContext": "Breed places collars on both Luffy and Law and forces them to fight each other in his arena."
      },
      {
        "abilityName": "Voice Command Activation",
        "episodeRevealed": 627,
        "description": "The control requires the victim to hear and comprehend the user's verbal commands.",
        "severity": "MAJOR",
        "firstUseContext": "Breed issues commands to Luffy and Law to fight to the death."
      },
      {
        "abilityName": "Potential Maximization",
        "episodeRevealed": 626,
        "description": "User can command victims to bring out their full potential and maximum strength.",
        "severity": "MAJOR",
        "firstUseContext": "Breed can enhance the abilities of controlled subjects by commanding them to be at their strongest."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Commands must be heard and comprehended",
        "episodeRevealed": 627,
        "severity": "CRITICAL",
        "description": "If the victim cannot hear the command (such as when wearing earplugs), the control does not take effect. This weakness was discovered and exploited by Trafalgar Law."
      },
      {
        "weakness": "Cannot control consciousness",
        "episodeRevealed": 627,
        "severity": "MAJOR",
        "description": "While the user can control the victim's body movements, they cannot control their thoughts, consciousness, or senses, allowing victims to plan escapes mentally."
      },
      {
        "weakness": "Collar disappears if user is knocked out",
        "episodeRevealed": 628,
        "severity": "CRITICAL",
        "description": "If the devil fruit user loses consciousness, all collars shatter and disappear, freeing all controlled victims."
      },
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 626,
        "severity": "MAJOR",
        "description": "User is affected by the standard Devil Fruit curse of being unable to swim."
      }
    ],
    "strengths": [
      {
        "strength": "Works on any living creature",
        "episodeRevealed": 626,
        "description": "Can control animals, humans, and even Devil Fruit users regardless of their strength.",
        "severity": "MAJOR"
      },
      {
        "strength": "Multiple simultaneous targets",
        "episodeRevealed": 627,
        "description": "User can maintain control over multiple victims at once.",
        "severity": "MAJOR"
      },
      {
        "strength": "Self-enhancement possible",
        "episodeRevealed": 626,
        "description": "User can place a collar on themselves and issue self-commands to bring out their own full potential.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "MEDIUM",
    "canonStatus": "NON_CANON"
  }
]
