[
  {
    "id": "theory-ep627-001",
    "title": "Breed's Connection to SMILE Distribution Network",
    "summary": "A theory that Breed's possession of a SMILE fruit suggests he has connections to the underground network between Doflamingo and Kaido, potentially being a minor player in the artificial devil fruit trade.",
    "fullText": "Breed is shown to possess a SMILE artificial devil fruit in episode 627, which he wants Caesar to mass-produce for his world domination plan. Since SMILE fruits are highly controlled by Doflamingo's underground network and primarily sold to Kaido, Breed must have connections to this network. Some fans theorize that if this arc were canon, it would suggest there are more players in the SMILE trade than just Doflamingo and Kaido, with various underworld figures obtaining these fruits for their own schemes. The fact that Breed specifically targets Caesar (the only person who can make SMILE fruits besides Vegapunk) shows he understands the rarity and value of Caesar's knowledge.",
    "author": "One Piece Fandom Discussion",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Breed",
      "title": "Breed - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2026-01-10"
    },
    "postedDate": "2014-01-05",
    "episodeRange": [626, 628],
    "minEpisode": 626,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 628
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "NON_CANON_SPECULATION",
    "relatedCharacters": ["breed", "caesar-clown", "doflamingo", "kaido"],
    "relatedLocations": [],
    "relatedEvents": ["ep627-event-006"],
    "tags": ["smile", "artificial-devil-fruit", "underworld", "filler-arc"]
  },
  {
    "id": "theory-ep627-002",
    "title": "Kung-Fu Dugong's Haki Training Origin",
    "summary": "Fan speculation about how the Kung-Fu Dugong from Alabasta learned Armament Haki during the timeskip and managed to reach the New World.",
    "fullText": "The Kung-Fu Dugong's appearance in episode 627 with Armament Haki abilities raises questions about how a creature from East Blue (the weakest sea) managed to not only survive the Grand Line but also learn advanced Haki techniques and reach the New World. Fans have speculated that the Dugong may have trained with powerful martial artists or even encountered Haki users who taught him the technique. Some theories suggest he may have met members of the Revolutionary Army or trained in a kingdom known for martial arts. The fact that he formed the Sea Animal Pirates and successfully recruited other sea creatures suggests significant character growth and leadership development during the two-year timeskip. This demonstrates that Luffy's influence inspired even minor characters to pursue their dreams seriously.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Sea_Animal_Pirates",
      "title": "Sea Animal Pirates - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2026-01-10"
    },
    "postedDate": "2014-01-05",
    "episodeRange": [92, 627],
    "minEpisode": 627,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 627
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "NON_CANON_SPECULATION",
    "relatedCharacters": ["kung-fu-dugong", "luffy"],
    "relatedLocations": [],
    "relatedEvents": ["ep627-event-004", "ep627-event-005"],
    "tags": ["kung-fu-dugong", "haki", "timeskip", "character-growth", "filler"]
  },
  {
    "id": "theory-ep627-003",
    "title": "Peto Peto no Mi's Potential Against Yonko",
    "summary": "Discussion about whether Breed's Peto Peto no Mi could theoretically control even Yonko-level characters if he managed to collar them.",
    "fullText": "Breed's ability to control both Luffy and Law simultaneously in episode 627 raises an interesting question: what are the limits of the Peto Peto no Mi's control? Since the fruit works by forcing victims to obey verbal commands as long as they can hear them, fans have debated whether someone with extremely powerful Haki or willpower could resist the collar's effects. In the episode, we see that while the fruit controls the body, it doesn't control consciousness, allowing victims to think freely and plan escapes. Some fans theorize that Conqueror's Haki users or characters with exceptionally strong willpower (like Yonko) might be able to resist or break the collars through sheer force of will. However, the episode establishes that the weakness is purely mechanical (not being able to hear commands) rather than being overcome by willpower alone. This makes Breed's power theoretically dangerous even against top-tier opponents, though his relatively weak physical abilities would make it difficult for him to actually collar such powerful individuals.",
    "author": "One Piece Power Scaling Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Peto_Peto_no_Mi",
      "title": "Peto Peto no Mi - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2026-01-10"
    },
    "postedDate": "2014-01-06",
    "episodeRange": [626, 628],
    "minEpisode": 626,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 628
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "NON_CANON_SPECULATION",
    "relatedCharacters": ["breed", "luffy", "trafalgar-law"],
    "relatedLocations": [],
    "relatedEvents": ["ep627-event-002", "ep627-event-007"],
    "tags": ["devil-fruit", "power-scaling", "haki", "willpower", "filler"]
  }
]
