[
  {
    "name": {
      "english": "Sickle-Sickle Fruit",
      "japanese": "カマカマの実",
      "romanized": "Kama Kama no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 54,
    "debutChapter": null,
    "description": "An anime-only Paramecia-type Devil Fruit that permanently lengthens and sharpens the user's fingernails, allowing them to create razor-sharp wind slashes capable of cleaving through hard materials like bedrock. The abilities functionally resemble the Rankyaku technique used by Rokushiki practitioners.",
    "episodeAppearances": [58],
    "users": [
      {
        "characterId": "eric",
        "episodeStart": 54,
        "episodeEnd": 61,
        "circumstances": "Eric ate the fruit at some point before the Warship Island arc and uses it as his primary fighting style."
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Kama Kama no Kamaitachi",
        "episodeRevealed": 58,
        "description": "Eric releases a single small but powerful air blade from his sharpened nails. Despite its size, it is powerful enough to slice through solid rock.",
        "severity": "MAJOR",
        "firstUseContext": "Eric uses this technique during his battle with Zoro in the underground ruins of Lost Island."
      },
      {
        "abilityName": "Kama Kama no Tsumujikaze",
        "episodeRevealed": 58,
        "description": "Eric releases a powerful air blade that slashes the enemy multiple times upon contact. The technique is strong enough to cut through rock and creates a whirlwind effect.",
        "severity": "MAJOR",
        "firstUseContext": "Revealed during Eric's combat demonstration against Zoro in the ruins."
      },
      {
        "abilityName": "Kama Kama no Kamaitachi Midareuchi",
        "episodeRevealed": 58,
        "description": "Eric's ultimate technique and a stronger version of Kama Kama no Kamaitachi. He slashes many times in rapid succession, releasing multiple air blades toward the enemy before unleashing a powerful whirlwind of razor air that can effortlessly slice through solid rock.",
        "severity": "MAJOR",
        "firstUseContext": "Eric's most powerful attack, demonstrated during his fight with Zoro to showcase the full extent of his Devil Fruit abilities."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 54,
        "severity": "MAJOR"
      },
      {
        "weakness": "The user must maintain their sharp nails to use the wind-cutting abilities effectively",
        "episodeRevealed": 58,
        "severity": "MINOR"
      }
    ],
    "strengths": [
      {
        "strength": "Ranged attacks that can cut through extremely hard materials",
        "episodeRevealed": 58,
        "description": "The wind slashes can slice through solid rock and other tough substances, making it effective for both offense and terrain manipulation.",
        "severity": "MAJOR"
      },
      {
        "strength": "Multiple simultaneous attacks",
        "episodeRevealed": 58,
        "description": "Eric can release numerous air blades at once with techniques like Kamaitachi Midareuchi, overwhelming opponents with quantity and destructive power.",
        "severity": "MAJOR"
      },
      {
        "strength": "Long-range combat capability",
        "episodeRevealed": 58,
        "description": "The air blades can travel significant distances, allowing Eric to fight from range and control the battlefield.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "UNCOMMON",
    "powerTier": "MEDIUM",
    "notes": "The Kama Kama no Mi is an anime-only Devil Fruit that never appears in the One Piece manga. It was created specifically for Eric's character in the Warship Island filler arc. The fruit's abilities are similar to the CP9's Rankyaku technique, which creates cutting air blades through kicks."
  },
  {
    "name": {
      "english": "Whisper-Whisper Fruit",
      "japanese": "ヒソヒソの実",
      "romanized": "Hiso Hiso no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 54,
    "debutChapter": null,
    "description": "An anime-only Paramecia-type Devil Fruit that allows the user to telepathically communicate with animals and understand their thoughts and feelings. The user can also gather information from animals about environmental conditions.",
    "episodeAppearances": [58],
    "users": [
      {
        "characterId": "apis",
        "episodeStart": 54,
        "episodeEnd": 61,
        "circumstances": "Apis ate the fruit at some point before the Warship Island arc, which allows her to communicate with Ryu the dragon."
      }
    ],
    "abilityReveals": [],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 54,
        "severity": "MAJOR"
      }
    ],
    "strengths": [
      {
        "strength": "Communication with animals",
        "episodeRevealed": 54,
        "description": "Apis can understand and speak with any animal, allowing her to befriend creatures and gather intelligence.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "UNCOMMON",
    "powerTier": "LOW",
    "notes": "The Hiso Hiso no Mi is an anime-only Devil Fruit created for the Warship Island arc. While no new abilities are revealed in episode 58 specifically, Apis continues to use it to communicate with Ryu throughout the episode."
  }
]
