[
  {
    "name": {
      "english": "Gum-Gum Fruit",
      "japanese": "ゴムゴムの実",
      "romanized": "Gomu Gomu no Mi"
    },
    "type": "Paramecia",
    "debutEpisode": 1,
    "debutChapter": 1,
    "episodeAppearances": [183],
    "currentUser": "luffy",
    "previousUsers": [],
    "abilities": [
      {
        "abilityName": "Gomu Gomu no Tako",
        "episodeFirstShown": 183,
        "description": "The user transforms their arms and legs into tentacle-like appendages, allowing for rapid multi-directional attacks.",
        "firstUseContext": "Luffy uses this technique against Enel, punching rapidly at the walls of the Ark Maxim's throne room."
      },
      {
        "abilityName": "Gomu Gomu no Tako Hanabi",
        "episodeFirstShown": 183,
        "description": "An extension of Tako where the user bounces their tentacle punches off walls in unpredictable ricochet patterns.",
        "firstUseContext": "Luffy discovers this ricochet strategy can bypass Enel's Mantra because the attacks come from natural physics rather than conscious thought."
      },
      {
        "abilityName": "Gomu Gomu no Rifle",
        "episodeFirstShown": 183,
        "description": "An enhanced version of Pistol where the user twists their arm while stretching it back, adding rotational force to increase impact.",
        "firstUseContext": "Luffy uses this improved punch technique against Enel during their battle on the Ark Maxim."
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 183,
        "eventId": "ep183-event-001",
        "momentType": "POWER_REVEAL",
        "title": "Rubber Immunity to Lightning",
        "description": "The Gomu Gomu no Mi's rubber properties are confirmed to make the user completely immune to electrical attacks, as rubber is a natural insulator.",
        "significance": "This establishes the Gomu Gomu no Mi as the perfect counter to the Goro Goro no Mi, showing that type advantages can trump raw power in One Piece.",
        "timestamp": "02:30"
      },
      {
        "episodeNumber": 183,
        "eventId": "ep183-event-004",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "Gomu Gomu no Tako Debut",
        "description": "First use of the octopus transformation technique.",
        "significance": "Showcases the user's creativity and versatility with rubber powers.",
        "timestamp": "09:00"
      },
      {
        "episodeNumber": 183,
        "eventId": "ep183-event-005",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "Gomu Gomu no Tako Hanabi Debut",
        "description": "First use of the ricochet octopus technique.",
        "significance": "Demonstrates that the Gomu Gomu no Mi can be used strategically to counter precognitive abilities.",
        "timestamp": "10:30"
      },
      {
        "episodeNumber": 183,
        "eventId": "ep183-event-006",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "Gomu Gomu no Rifle Debut",
        "description": "First use of the twisted punch technique.",
        "significance": "Introduces an enhanced version of the signature Pistol attack.",
        "timestamp": "11:45"
      }
    ],
    "reveals": [
      {
        "infoType": "PROPERTY",
        "information": "The Gomu Gomu no Mi grants complete immunity to electrical attacks due to rubber's insulating properties",
        "episodeRevealed": 183,
        "severity": "MAJOR"
      },
      {
        "infoType": "TECHNIQUE",
        "information": "The fruit's rubber properties can be used to create tentacle-like transformations for creative combat applications",
        "episodeRevealed": 183,
        "severity": "MAJOR"
      },
      {
        "infoType": "TECHNIQUE",
        "information": "Ricochet attacks using the rubber body can bypass precognitive abilities like Mantra",
        "episodeRevealed": 183,
        "severity": "MAJOR"
      }
    ]
  },
  {
    "name": {
      "english": "Rumble-Rumble Fruit",
      "japanese": "ゴロゴロの実",
      "romanized": "Goro Goro no Mi"
    },
    "type": "Logia",
    "debutEpisode": 167,
    "debutChapter": 254,
    "episodeAppearances": [183],
    "currentUser": "enel",
    "previousUsers": [],
    "abilities": [
      {
        "abilityName": "Gloam Paddling",
        "episodeFirstShown": 183,
        "description": "The user propels themselves at high speeds using electrical discharge for enhanced mobility and combat positioning.",
        "firstUseContext": "Enel uses this technique to move quickly while wielding his golden staff against Luffy."
      },
      {
        "abilityName": "MAX 200,000,000 Volt Vari",
        "episodeFirstShown": 183,
        "description": "One of the user's most powerful electrical attacks, releasing 200 million volts of electricity in a devastating discharge.",
        "firstUseContext": "Enel unleashes this attack against Luffy, but it has no effect due to Luffy's rubber body."
      },
      {
        "abilityName": "Deathpiea",
        "episodeFirstShown": 183,
        "description": "A catastrophic system where the user channels their electrical power through the Ark Maxim to generate massive thunderclouds that can destroy an entire island. The lightning from these clouds is ten times more powerful than the user's normal attacks.",
        "firstUseContext": "Enel activates this system to begin destroying Skypiea, causing citizens to evacuate in panic."
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 183,
        "eventId": "ep183-event-001",
        "momentType": "POWER_REVEAL",
        "title": "Lightning Ineffective Against Rubber",
        "description": "The Goro Goro no Mi's lightning attacks are revealed to be completely useless against rubber, as it's a natural insulator.",
        "significance": "This discovery shatters Enel's invincibility and introduces the concept of natural enemy matchups in devil fruit battles.",
        "timestamp": "02:30"
      },
      {
        "episodeNumber": 183,
        "eventId": "ep183-event-008",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "Gloam Paddling Debut",
        "description": "First use of the high-speed movement technique.",
        "significance": "Shows the fruit can be used for mobility enhancement even when offensive electricity is ineffective.",
        "timestamp": "14:00"
      },
      {
        "episodeNumber": 183,
        "eventId": "ep183-event-009",
        "momentType": "POWER_REVEAL",
        "title": "Deathpiea System Activation",
        "description": "The full destructive potential of the Goro Goro no Mi is revealed when combined with the Ark Maxim to create island-destroying thunderclouds.",
        "significance": "Demonstrates the true scale of destruction this devil fruit is capable of when combined with technology.",
        "timestamp": "16:15"
      },
      {
        "episodeNumber": 183,
        "eventId": "ep183-event-010",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "MAX 200,000,000 Volt Vari Debut",
        "description": "First use of this ultra-high voltage attack.",
        "significance": "Shows the upper limits of the fruit's electrical power output.",
        "timestamp": "17:30"
      }
    ],
    "reveals": [
      {
        "infoType": "WEAKNESS",
        "information": "The Goro Goro no Mi's electrical attacks are completely ineffective against rubber, which acts as a natural insulator",
        "episodeRevealed": 183,
        "severity": "CRITICAL"
      },
      {
        "infoType": "ABILITY",
        "information": "When combined with the Ark Maxim, the fruit can generate thunderclouds capable of destroying entire islands with lightning ten times more powerful than normal",
        "episodeRevealed": 183,
        "severity": "CRITICAL"
      },
      {
        "infoType": "ABILITY",
        "information": "The fruit can output at least 200 million volts of electricity in a single attack",
        "episodeRevealed": 183,
        "severity": "MAJOR"
      }
    ]
  }
]
