[
  {
    "name": {
      "english": "Ark Maxim",
      "japanese": "方舟マクシム",
      "romanized": "Hakobune Makushimu"
    },
    "type": "Ship",
    "debutEpisode": 173,
    "debutChapter": 260,
    "episodeAppearances": [183],
    "keyEvents": [
      {
        "episodeNumber": 183,
        "eventId": "ep183-event-003",
        "eventType": "BATTLE_START",
        "title": "Luffy vs Enel Continues",
        "description": "The battle between Luffy and Enel continues in the throne room of the Ark Maxim as Enel adapts to using his golden staff.",
        "significance": "The Ark Maxim serves as the arena for one of the most important battles in the Skypiea Arc.",
        "timestamp": "06:15"
      },
      {
        "episodeNumber": 183,
        "eventId": "ep183-event-009",
        "eventType": "POWER_REVEAL",
        "title": "Deathpiea System Activated",
        "description": "The Ark Maxim's ultimate weapon system, Deathpiea, is activated to generate massive thunderclouds capable of destroying Skypiea.",
        "significance": "Reveals the true purpose of the Ark Maxim as a weapon of mass destruction.",
        "timestamp": "16:15"
      },
      {
        "episodeNumber": 183,
        "eventId": "ep183-event-013",
        "eventType": "WORLD_LORE",
        "title": "Thunder Cloud Generation System",
        "description": "The Ark Maxim uses Enel's electrical power to condense intense air currents and create artificial thunderclouds that store massive electrical charges.",
        "significance": "Explains the technical workings of the ship's devastating weapon system.",
        "timestamp": "21:00"
      }
    ],
    "description": "A massive flying ship built by Gan Fall's men under Enel's command. The Ark Maxim is powered by Enel's Goro Goro no Mi abilities and features the Deathpiea system, which can generate thunderclouds capable of destroying entire islands. The ship represents Enel's means of reaching the Fairy Vearth (the moon) while destroying Skypiea behind him.",
    "region": "Sky Island",
    "isDestroyed": false,
    "reveals": [
      {
        "infoType": "FUNCTION",
        "information": "The Ark Maxim can activate Deathpiea, a system that generates island-destroying thunderclouds",
        "episodeRevealed": 183,
        "severity": "CRITICAL"
      },
      {
        "infoType": "TECHNOLOGY",
        "information": "The ship uses Enel's electrical power to condense air currents and create artificial thunderclouds",
        "episodeRevealed": 183,
        "severity": "MAJOR"
      }
    ]
  },
  {
    "name": {
      "english": "Skypiea",
      "japanese": "スカイピア",
      "romanized": "Sukaipia"
    },
    "type": "Island",
    "debutEpisode": 153,
    "debutChapter": 238,
    "episodeAppearances": [183],
    "keyEvents": [
      {
        "episodeNumber": 183,
        "eventId": "ep183-event-009",
        "eventType": "POWER_REVEAL",
        "title": "Threatened by Deathpiea",
        "description": "Massive thunderclouds generated by the Ark Maxim spread across the sky above Skypiea, threatening to destroy the entire island.",
        "significance": "The entire population of Skypiea faces imminent destruction, raising the stakes of the battle.",
        "timestamp": "16:15"
      },
      {
        "episodeNumber": 183,
        "eventId": "ep183-event-011",
        "eventType": "CULTURAL_MOMENT",
        "title": "Mass Evacuation",
        "description": "The citizens of Skypiea panic and begin evacuating as the Deathpiea thunderclouds spread overhead.",
        "significance": "Shows the immediate danger to innocent civilians and the urgency of stopping Enel.",
        "timestamp": "18:45"
      }
    ],
    "description": "A sky island located 10,000 meters above the Blue Sea, home to both the native Skypieans and the displaced Shandians. In this episode, Skypiea faces complete destruction from Enel's Deathpiea system.",
    "region": "Sky Island",
    "isDestroyed": false,
    "reveals": []
  },
  {
    "name": {
      "english": "Angel Island",
      "japanese": "エンジェル島",
      "romanized": "Enjeru-tō"
    },
    "type": "Island",
    "debutEpisode": 153,
    "debutChapter": 238,
    "episodeAppearances": [183],
    "keyEvents": [
      {
        "episodeNumber": 183,
        "eventId": "ep183-event-011",
        "eventType": "CULTURAL_MOMENT",
        "title": "Demonstration Lightning Strike",
        "description": "A massive lightning bolt from the Deathpiea system strikes Angel Island, demonstrating the destructive power of Enel's plan. The lightning is much larger and more powerful than normal, capable of burning down an entire village.",
        "significance": "Provides a terrifying demonstration of what will happen to all of Skypiea if Enel isn't stopped.",
        "timestamp": "18:45"
      }
    ],
    "description": "The main inhabited area of Skypiea and home to most of its citizens. Angel Island receives a devastating demonstration strike from the Deathpiea system.",
    "region": "Sky Island - Skypiea",
    "isDestroyed": false,
    "reveals": []
  }
]
