[
  {
    "theoryTitle": "Noah and Joy Boy's Promise Will Be Fulfilled by Luffy",
    "theoryText": "The Noah ship appearing in this episode is connected to Joy Boy's ancient promise to bring the fish-men and merfolk to the surface. The theory suggests that Luffy, as the next 'Joy Boy,' will eventually fulfill this promise. When Luffy finds the One Piece and the final war breaks out, he will guide Shirahoshi (Poseidon) to use her power to control the Sea Kings, who will lift Noah and transport all fish-men and merfolk to the surface world, finally completing Joy Boy's 800-year-old promise.",
    "author": "Multiple One Piece theorists",
    "sourceUrl": "https://onepiece.fandom.com/wiki/Fish-Man_Island_Arc",
    "platform": "One Piece Wiki / Fan Communities",
    "publishDate": null,
    "episodeSpan": [557, 563, 967, 968],
    "spoilerStatus": "FUTURE_SPOILERS",
    "supportingEvidence": [
      "Madam Shyarly's prophecy about someone with a straw hat destroying Fish-Man Island",
      "Joy Boy's apology on the Poneglyph for breaking his promise",
      "Shirahoshi's identity as the ancient weapon Poseidon with power to command Sea Kings",
      "Noah's massive size being able to carry the entire population of Fish-Man Island",
      "The theory about the Red Line being destroyed would make Fish-Man Island uninhabitable"
    ],
    "popularityMetrics": {
      "upvotes": null,
      "discussions": null,
      "views": null
    },
    "status": "WIDELY_ACCEPTED",
    "tags": ["Joy Boy", "Noah", "Poseidon", "Shirahoshi", "prophecy", "endgame"]
  },
  {
    "theoryTitle": "Fish-Man Island's Destruction and the Red Line",
    "theoryText": "The appearance of Noah on a collision course with Fish-Man Island in this episode connects to the larger theory about the destruction of Fish-Man Island. The theory posits that when the Red Line is eventually destroyed (likely during the final war), Fish-Man Island, which sits directly beneath it, will also be destroyed. This would fulfill Madam Shyarly's prophecy about Luffy destroying the island. However, this won't be a tragedy because Luffy will have already used Noah to evacuate all inhabitants to the surface, finally achieving the integration of fish-men and humans that has been denied for centuries.",
    "author": "Various r/OnePiece theorists",
    "sourceUrl": "https://gamerant.com/one-piece-why-fishman-island-is-far-more-important-than-you-think/",
    "platform": "Reddit / Game Rant",
    "publishDate": null,
    "episodeSpan": [557, 610, 968],
    "spoilerStatus": "SERIES_ENDGAME",
    "supportingEvidence": [
      "Fish-Man Island's location directly under the Red Line",
      "Madam Shyarly's prophecy about Luffy destroying the island",
      "The recurring theme of breaking down barriers between races",
      "Noah's purpose as a ship to transport fish-men to the surface",
      "Joy Boy's connection to both the ancient weapons and the Final War"
    ],
    "popularityMetrics": {
      "upvotes": null,
      "discussions": null,
      "views": null
    },
    "status": "POPULAR",
    "tags": ["Red Line", "prophecy", "endgame", "Fish-Man Island destruction", "integration"]
  },
  {
    "theoryTitle": "General Franky as Precursor to Ancient Kingdom Technology",
    "theoryText": "The debut of General Franky in this episode represents Franky's assimilation of Dr. Vegapunk's technology. Some theorists suggest that this technology has roots in the Ancient Kingdom's advanced civilization. Franky's ability to create such sophisticated machinery from Vegapunk's blueprints hints that the Ancient Kingdom may have had similar or even more advanced mecha and weapons. This could tie into the ancient weapons (Pluton, Poseidon, Uranus) and suggest that advanced technology played a role in the Void Century war.",
    "author": "One Piece technology theorists",
    "sourceUrl": "https://onepiece.fandom.com/wiki/Battle_Frankies/General_Franky",
    "platform": "Various forums",
    "publishDate": null,
    "episodeSpan": [557],
    "spoilerStatus": "SPECULATIVE",
    "supportingEvidence": [
      "Franky studied Vegapunk's research for two years",
      "Vegapunk's technology is repeatedly shown to be far ahead of the current era",
      "The ancient weapon Pluton is also a ship/weapon design",
      "Wapometal (used in General Franky) is a special alloy with unique properties",
      "The Ancient Kingdom was known for advanced technology"
    ],
    "popularityMetrics": {
      "upvotes": null,
      "discussions": null,
      "views": null
    },
    "status": "SPECULATIVE",
    "tags": ["Ancient Kingdom", "Vegapunk", "technology", "General Franky", "Pluton"]
  }
]
