[
  {
    "name": {
      "english": "Gyoncorde Plaza",
      "japanese": "ギョンコルド広場",
      "romanized": "Gyonkorudo Hiroba"
    },
    "locationType": "PLAZA",
    "debutEpisode": 554,
    "debutChapter": 634,
    "episodeAppearances": [557],
    "parentLocation": "Fish-Man Island",
    "geography": "A large public plaza in Fish-Man Island where major events and gatherings take place",
    "keyEvents": [
      {
        "episodeNumber": 557,
        "eventId": "ep557-event-001",
        "title": "Ground Collapse from Daruma's Attack",
        "description": "Daruma uses his Cookie Cutter ability to create underground tunnels, then collapses the ground with Daruma Drop, creating large pitfalls in the plaza.",
        "significance": "The collapsing ground forces Franky to reveal his ultimate weapon, General Franky.",
        "timestamp": "05:30"
      },
      {
        "episodeNumber": 557,
        "eventId": "ep557-event-002",
        "title": "General Franky Debut",
        "description": "Franky debuts his giant battle mecha General Franky in the plaza during the battle against the New Fishman Pirates.",
        "significance": "First appearance of one of Franky's most iconic post-timeskip abilities in this location.",
        "timestamp": "08:45"
      },
      {
        "episodeNumber": 557,
        "eventId": "ep557-event-009",
        "title": "Luffy vs Hody Confrontation Begins",
        "description": "Luffy reaches Hody Jones in the plaza, setting up their direct confrontation.",
        "significance": "The plaza serves as the battleground for the climactic conflict of the Fish-Man Island arc.",
        "timestamp": "19:30"
      }
    ],
    "culturalSignificance": "Central location for the battle between the Straw Hat Pirates and the New Fishman Pirates",
    "historicalEvents": [],
    "images": [],
    "status": "ACTIVE"
  },
  {
    "name": {
      "english": "Noah",
      "japanese": "ノア",
      "romanized": "Noa"
    },
    "locationType": "SHIP",
    "debutEpisode": 528,
    "debutChapter": 626,
    "episodeAppearances": [557],
    "parentLocation": "Fish-Man Island",
    "geography": "A massive ancient ship, roughly half the size of Fish-Man Island itself, located in the Sea Forest",
    "keyEvents": [
      {
        "episodeNumber": 557,
        "eventId": "ep557-event-010",
        "title": "Noah Appears on Collision Course",
        "description": "The massive ship Noah suddenly appears descending toward Fish-Man Island on a direct collision course, threatening to destroy the entire island.",
        "significance": "Escalates the crisis beyond just defeating Hody Jones, introducing an existential threat to Fish-Man Island tied to ancient history and Joy Boy's promise.",
        "timestamp": "21:00"
      }
    ],
    "culturalSignificance": "An ancient ship connected to Joy Boy's promise to the people of Fish-Man Island. Known as the 'Ship of Promise' meant to one day bring the fish-men and merfolk to the surface. A Poneglyph in the Sea Forest contains Joy Boy's apology for breaking his promise regarding this ship.",
    "historicalEvents": [
      {
        "event": "Joy Boy's Promise",
        "description": "Joy Boy made a promise to use Noah to bring the people of Fish-Man Island to the surface, but failed to fulfill it, leaving an apology on a Poneglyph.",
        "episodeRevealed": 528
      }
    ],
    "images": [],
    "status": "ACTIVE"
  },
  {
    "name": {
      "english": "Fish-Man Island",
      "japanese": "魚人島",
      "romanized": "Gyojin-tō"
    },
    "locationType": "ISLAND",
    "debutEpisode": 523,
    "debutChapter": 603,
    "episodeAppearances": [557],
    "parentLocation": "Undersea",
    "geography": "An underwater island located 10,000 meters below sea level, beneath the Red Line. Home to fish-men and merfolk, protected by a giant bubble.",
    "keyEvents": [
      {
        "episodeNumber": 557,
        "eventId": "ep557-event-010",
        "title": "Noah Threatens the Island",
        "description": "Noah appears on a collision course with Fish-Man Island, threatening complete destruction of the island and all its inhabitants.",
        "significance": "The entire island faces an existential threat that could fulfill Madam Shyarly's prophecy about the island's destruction.",
        "timestamp": "21:00"
      }
    ],
    "culturalSignificance": "Homeland of fish-men and merfolk, connected to ancient prophecies and Joy Boy's promise",
    "historicalEvents": [],
    "images": [],
    "status": "ACTIVE"
  }
]
