[
  {
    "name": {
      "english": "SMILE",
      "japanese": "スマイル",
      "romanized": "Sumairu"
    },
    "type": "ARTIFICIAL_ZOAN",
    "debutEpisode": 615,
    "debutChapter": 689,
    "description": "SMILE is an artificial Zoan-type Devil Fruit created using a chemical substance called SAD. These fruits are mass-produced by Caesar Clown for Donquixote Doflamingo and sold to Kaido to create an army of Zoan users. Unlike natural Devil Fruits, SMILE fruits have a significantly lower success rate, with only 10% of consumers gaining powers while 90% lose their ability to express negative emotions.",
    "episodeAppearances": [615],
    "users": [],
    "abilityReveals": [
      {
        "abilityName": "Artificial Zoan Transformation",
        "episodeRevealed": 615,
        "description": "SMILE fruits grant the consumer the ability to transform into an animal or hybrid form, similar to natural Zoan Devil Fruits. However, the transformations are often incomplete or distorted.",
        "severity": "CRITICAL",
        "firstUseContext": "Caesar reveals SMILE as artificial Zoan Devil Fruits being produced for an Emperor."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Only 10% success rate - 90% of consumers gain no powers",
        "episodeRevealed": 615,
        "severity": "CRITICAL"
      },
      {
        "weakness": "Failed consumers permanently lose ability to express negative emotions (cursed with eternal smiles)",
        "episodeRevealed": 615,
        "severity": "CRITICAL"
      },
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 615,
        "severity": "MAJOR"
      },
      {
        "weakness": "Transformations are often incomplete or distorted compared to natural Zoans",
        "episodeRevealed": 615,
        "severity": "MAJOR"
      }
    ],
    "strengths": [
      {
        "strength": "Can be mass-produced unlike natural Devil Fruits",
        "episodeRevealed": 615,
        "description": "Caesar can manufacture SMILE fruits in large quantities for building armies.",
        "severity": "CRITICAL"
      },
      {
        "strength": "Grants Zoan-type transformation abilities",
        "episodeRevealed": 615,
        "description": "Successful consumers gain animal transformation powers similar to natural Zoan fruits.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "MANUFACTURED",
    "powerTier": "VARIABLE",
    "additionalInfo": {
      "creator": "Caesar Clown",
      "productionMethod": "Created using SAD (a chemical substance)",
      "primaryCustomer": "Kaido of the Four Emperors",
      "distributor": "Donquixote Doflamingo",
      "purpose": "Building an army of artificial Zoan users for Kaido",
      "productionLocation": "Punk Hazard (SAD production) and Dressrosa (SMILE factory)"
    }
  }
]
