[
  {
    "id": "theory-ep615-001",
    "title": "SMILE Fruits Are For Building Kaido's Zoan Army",
    "summary": "After the reveal that SMILE produces artificial Zoan Devil Fruits for an Emperor, fans theorized that Kaido is building an army entirely composed of Zoan users.",
    "fullText": "When Caesar revealed that SMILE artificial Devil Fruits are being produced for an Emperor, many fans immediately speculated that the Emperor in question is Kaido. The theory suggests that instead of having a traditional pirate crew, Kaido is building a massive army of artificial Zoan Devil Fruit users through Doflamingo's SMILE production. This would give him an unprecedented military force with hundreds of Devil Fruit users under his command. The theory gained traction because it would explain why Kaido is referred to as the 'King of Beasts' and why he would need such a large-scale Devil Fruit production operation.",
    "author": "One Piece Community (Multiple Contributors)",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/User_blog:Phoenixs23/Kaido_of_the_100_Beast_Theory",
      "title": "Kaido of the 100 Beast Theory",
      "platform": "One Piece Wiki",
      "accessedAt": "2026-01-08"
    },
    "postedDate": "2012-11-21",
    "episodeRange": [615, 900],
    "minEpisode": 615,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 900
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["kaido", "doflamingo", "caesar-clown"],
    "relatedLocations": ["punk-hazard", "dressrosa"],
    "relatedEvents": ["ep615-event-012", "ep615-event-013", "ep615-event-014"],
    "tags": ["smile", "kaido", "zoan-army", "doflamingo", "artificial-devil-fruits"]
  },
  {
    "id": "theory-ep615-002",
    "title": "Punk Hazard Cover-Up Involves World Government Conspiracy",
    "summary": "The revelation that Vergo covers up information about Punk Hazard led fans to theorize about a larger World Government conspiracy involving illegal weapons research.",
    "fullText": "When it was revealed that Punk Hazard 'doesn't exist' and Vergo actively covers up information about the island, fans theorized that the World Government is complicit in or aware of Caesar's illegal activities. Some speculated that the World Government might even be secretly funding or supporting the research, or that high-ranking officials are involved in the conspiracy. The theory suggests that Punk Hazard represents a shadow network of illegal operations that the government either tolerates or actively participates in for military advantage. The involvement of a Marine Vice Admiral (Vergo) in the cover-up suggests corruption at the highest levels of the Marines.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Punk_Hazard_Arc",
      "title": "Punk Hazard Arc Discussion",
      "platform": "One Piece Wiki",
      "accessedAt": "2026-01-08"
    },
    "postedDate": "2013-10-06",
    "episodeRange": [615, 700],
    "minEpisode": 615,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 700
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["vergo", "caesar-clown", "doflamingo"],
    "relatedLocations": ["punk-hazard"],
    "relatedEvents": ["ep615-event-010", "ep615-event-011"],
    "tags": ["punk-hazard", "world-government", "conspiracy", "vergo", "marine-corruption"]
  },
  {
    "id": "theory-ep615-003",
    "title": "SAD Is Made From Special Lineage Factor Research",
    "summary": "Fans theorized that SAD, the substance used to create SMILE, is derived from advanced genetic research into Devil Fruit lineage factors.",
    "fullText": "After learning that SAD produces SMILE artificial Devil Fruits, fans began theorizing about what SAD actually is and how it works. Many speculated that SAD must be a substance derived from studying the 'lineage factor' of Devil Fruits - essentially the genetic code that gives Devil Fruits their powers. The theory suggests that Caesar discovered how to extract or synthesize this lineage factor and use it to create artificial versions of Zoan Devil Fruits. This would explain why only Zoan types can be artificially created (they might be the simplest type to replicate) and why the success rate is so low (the artificial version is imperfect compared to natural Devil Fruits). This theory later gained more credibility when Vegapunk's research into Devil Fruit lineage factors was revealed.",
    "author": "One Piece Science Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/SMILE",
      "title": "SMILE - One Piece Wiki",
      "platform": "One Piece Wiki",
      "accessedAt": "2026-01-08"
    },
    "postedDate": "2013-10-15",
    "episodeRange": [615, 1100],
    "minEpisode": 615,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["caesar-clown", "vegapunk"],
    "relatedLocations": ["punk-hazard"],
    "relatedEvents": ["ep615-event-012", "ep615-event-013"],
    "tags": ["smile", "sad", "lineage-factor", "devil-fruit-science", "caesar-clown"]
  },
  {
    "id": "theory-ep615-004",
    "title": "Doflamingo Is Playing Both Sides",
    "summary": "Fans theorized that Doflamingo is manipulating both the World Government and the underworld for his own purposes.",
    "fullText": "The revelation that Doflamingo runs SAD production while simultaneously holding the position of Shichibukai (Warlord) led fans to theorize that he is playing multiple sides for maximum profit and power. As a Warlord, he has World Government protection and authority. As an underworld broker, he supplies weapons and artificial Devil Fruits to pirates and criminals, including Emperors like Kaido. The theory suggests that Doflamingo is exploiting his dual position to profit from chaos while remaining protected by his Warlord status. Some fans speculated that his ultimate goal is to create a war or conflict that he can profit from while staying safely in the middle. This theory proved accurate as more of Doflamingo's operations were revealed in the Dressrosa arc.",
    "author": "Doflamingo Theory Crafters",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Donquixote_Doflamingo",
      "title": "Donquixote Doflamingo - One Piece Wiki",
      "platform": "One Piece Wiki",
      "accessedAt": "2026-01-08"
    },
    "postedDate": "2013-10-20",
    "episodeRange": [615, 750],
    "minEpisode": 615,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 750
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["doflamingo", "caesar-clown", "vergo", "kaido"],
    "relatedLocations": ["punk-hazard", "dressrosa"],
    "relatedEvents": ["ep615-event-012", "ep615-event-014"],
    "tags": ["doflamingo", "warlord", "underworld-broker", "manipulation", "dual-identity"]
  }
]
