[
  {
    "id": "smoke-star",
    "name": {
      "english": "Smoke Star",
      "japanese": "煙星",
      "romanized": "Kemuri Boshi"
    },
    "type": "WEAPON_TECHNIQUE",
    "user": "sogeking",
    "debutEpisode": 262,
    "debutChapter": 373,
    "description": "A tactical ammunition for Sogeking's Kabuto slingshot that releases a dense smokescreen upon impact, creating confusion and covering escapes.",
    "firstUse": {
      "episodeNumber": 262,
      "eventId": "ep262-event-006",
      "context": "Sogeking uses Smoke Star to blind CP9 agents, creating an opportunity to grab Robin and escape to a detached train car",
      "timestamp": "09:30"
    },
    "effectiveness": "Successfully created confusion among elite CP9 agents, allowing for a temporary escape. Demonstrates Sogeking's tactical thinking and resourcefulness.",
    "limitations": "While effective for creating diversions, it doesn't prevent enemies from recovering and countering once the smoke clears."
  },
  {
    "id": "ocho-fleur-clutch",
    "name": {
      "english": "Eight Fleur Clutch",
      "japanese": "オーチョ・フルール・クラッチ",
      "romanized": "Ōcho Furūru Kuratchi"
    },
    "type": "DEVIL_FRUIT_TECHNIQUE",
    "user": "robin",
    "devilFruit": "hana-hana-no-mi",
    "debutEpisode": 262,
    "debutChapter": 374,
    "description": "A Hana Hana no Mi technique where Robin sprouts eight arms from a target's body to grab and clutch them, typically restraining or knocking them unconscious.",
    "firstUse": {
      "episodeNumber": 262,
      "eventId": "ep262-event-014",
      "context": "Robin uses this technique to knock out Sogeking, preventing him from rescuing her and demonstrating her resolve to sacrifice herself",
      "timestamp": "18:00"
    },
    "effectiveness": "Successfully incapacitated Sogeking instantly, showing the technique's reliability for subduing opponents.",
    "limitations": "Requires the target to be within range and can be resisted by particularly strong opponents."
  },
  {
    "id": "air-door",
    "name": {
      "english": "Air Door",
      "japanese": "エア・ドア",
      "romanized": "Ea Doa"
    },
    "type": "DEVIL_FRUIT_TECHNIQUE",
    "user": "blueno",
    "devilFruit": "doa-doa-no-mi",
    "debutEpisode": 262,
    "debutChapter": 374,
    "description": "An advanced application of the Doa Doa no Mi that allows Blueno to create a door in mid-air itself, leading to a pocket dimension from which he can emerge anywhere.",
    "firstUse": {
      "episodeNumber": 262,
      "eventId": "ep262-event-010",
      "context": "Blueno demonstrates this ability by appearing behind Sanji through a door created in thin air, bypassing the physical separation between train cars",
      "timestamp": "14:30"
    },
    "effectiveness": "Extremely versatile, allowing instant transportation and making escape from Blueno nearly impossible. Demonstrates that the Doa Doa no Mi can affect even intangible surfaces.",
    "limitations": "Requires Blueno to know where he wants to emerge or have a clear destination in mind."
  }
]
