[
  {
    "theoryTitle": "Sabo Survived and Was Rescued by Dragon",
    "theoryText": "Many fans theorized that Sabo didn't actually die when his ship was destroyed by Saint Jalmack. The key evidence was that Sabo's body was never shown, only his hat floating in the water. Fans believed that Dragon, the Revolutionary Army leader, witnessed the attack and rescued Sabo from the water. This theory was supported by a scene in Chapter 589 where Dragon boards his ship at night and is greeted by Ivankov, who looks down and questions 'What is that?' before calling for a doctor, suggesting Dragon had rescued someone critically injured.",
    "author": "One Piece Wiki community and various Reddit users",
    "platform": "One Piece Wiki, Reddit r/OnePiece",
    "episodesReferenced": [503, 504],
    "spoilerWarning": true,
    "spoilerSeverity": "CRITICAL",
    "spoilsBeyondEpisode": 503,
    "sourceUrl": "https://onepiece.fandom.com/wiki/Talk:Sabo/Archive_1",
    "datePosted": "2011-08",
    "popularity": {
      "likes": null,
      "upvotes": null,
      "views": null,
      "comments": null
    },
    "status": "CONFIRMED",
    "confirmationEpisode": 663,
    "confirmationDetails": "This theory was confirmed in the Dressrosa Arc when Sabo reappeared alive, revealing he had been rescued by Dragon and suffered amnesia from the incident."
  },
  {
    "theoryTitle": "Sabo's Death Foreshadows Ace's Sacrifice",
    "theoryText": "Fans theorized that Sabo's apparent death and his final letter asking Ace to take care of Luffy foreshadowed Ace's own death protecting Luffy at Marineford. The parallel between the two brothers both dying (or apparently dying) for reasons connected to their love for Luffy and their desire for freedom was seen as deliberate narrative setup. Sabo couldn't achieve freedom due to the Celestial Dragons, and Ace would later die fighting the World Government's forces.",
    "author": "Various One Piece theorists and analysts",
    "platform": "Reddit, One Piece forums, YouTube",
    "episodesReferenced": [483, 503],
    "spoilerWarning": true,
    "spoilerSeverity": "CRITICAL",
    "spoilsBeyondEpisode": 503,
    "sourceUrl": "https://www.cbr.com/one-piece-giveaways-hints-sabo-still-alive/",
    "datePosted": "2011",
    "popularity": {
      "likes": null,
      "upvotes": null,
      "views": null,
      "comments": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "confirmationEpisode": null,
    "confirmationDetails": "The narrative parallel between Sabo and Ace is intentional, though Sabo survived while Ace did not. Both stories involve themes of freedom, nobility oppression, and brotherly love."
  },
  {
    "theoryTitle": "No Body Shown = Character Not Dead",
    "theoryText": "One Piece fans developed a pattern recognition theory that if a character's body isn't explicitly shown in their death scene, they are likely still alive. This theory was based on multiple instances in the series where presumed-dead characters returned. With Sabo, only his hat was shown floating in the water, not his body, leading many to believe he survived despite the episode treating it as a death. This became a recurring fan theory pattern applied to other apparent deaths in the series.",
    "author": "One Piece fan community consensus",
    "platform": "Reddit r/OnePiece, various anime forums",
    "episodesReferenced": [503],
    "spoilerWarning": false,
    "spoilerSeverity": "MINOR",
    "spoilsBeyondEpisode": null,
    "sourceUrl": "https://www.cbr.com/one-piece-giveaways-hints-sabo-still-alive/",
    "datePosted": "2011",
    "popularity": {
      "likes": null,
      "upvotes": null,
      "views": null,
      "comments": null
    },
    "status": "PATTERN_RECOGNIZED",
    "confirmationEpisode": null,
    "confirmationDetails": "This theory became a recognized pattern in One Piece storytelling, proven correct with Sabo and several other characters throughout the series."
  }
]
