[
  {
    "theoryTitle": "Nami's True Allegiance",
    "theoryText": "When Episode 31 first aired, many fans theorized that Nami wasn't truly loyal to Arlong and was being forced to work for him under some kind of duress or blackmail. The coldness in her declaration seemed forced, and her body language suggested she was hiding something. Fans speculated she might be trying to protect the Straw Hats by pushing them away, or that she had a deeper reason for staying with Arlong.",
    "theorist": "One Piece Fan Community (2000)",
    "platform": "Discussion Forums",
    "dateProposed": "2000-07-12",
    "episodesSpanned": [31, 32, 33, 34, 35, 36, 37],
    "status": "CONFIRMED",
    "spoilerLevel": "ARC_SPOILERS",
    "popularity": {
      "upvotes": null,
      "views": null,
      "discussionThreads": null
    },
    "relatedCharacters": ["nami", "arlong"],
    "relatedEvents": ["ep031-event-010"],
    "resolution": "This theory was confirmed in later episodes when Nami's tragic backstory was revealed, showing she was forced to work for Arlong to buy back her village's freedom.",
    "evidence": [
      "Nami's hesitation and emotional conflict when confronting Zoro",
      "Her specific choice of words suggesting a transaction rather than true loyalty",
      "The fact that she stole the Going Merry but didn't harm any crew members"
    ]
  },
  {
    "theoryTitle": "Jinbe's Future Importance",
    "theoryText": "When Jinbe was first mentioned in Episode 31, some attentive fans immediately theorized that any character name-dropped this early - especially a Seven Warlord - would eventually become important to the story. Some speculated he might become an ally despite his connection to Arlong, predicting that the relationship between Jinbe and Arlong was more complex than initially presented.",
    "theorist": "One Piece Theory Community",
    "platform": "Fan Forums",
    "dateProposed": "2000-07-15",
    "episodesSpanned": [31, 430, 528, 541, 976],
    "status": "CONFIRMED",
    "spoilerLevel": "SERIES_SPOILERS",
    "popularity": {
      "upvotes": null,
      "views": null,
      "discussionThreads": null
    },
    "relatedCharacters": ["jinbe", "arlong"],
    "relatedEvents": ["ep031-event-002"],
    "resolution": "This theory proved incredibly prescient. Jinbe eventually became a major ally and even joined the Straw Hat Pirates as the helmsman. His complex relationship with Arlong and the themes of fish-man discrimination became central to the Fish-Man Island arc.",
    "evidence": [
      "Oda rarely mentions characters without eventual payoff",
      "The specific mention of Jinbe as a Warlord suggested importance",
      "The connection to Arlong hinted at deeper fish-man storylines"
    ]
  },
  {
    "theoryTitle": "Arlong's Ideology Origin",
    "theoryText": "Upon Arlong's introduction and his fish-man supremacist ideology, fans theorized that his hatred of humans wasn't purely evil but stemmed from past trauma or discrimination against fish-men. The mention of his connection to Jinbe and the Grand Line suggested a deeper backstory involving fish-man persecution that would be revealed later.",
    "theorist": "One Piece Analysis Community",
    "platform": "Online Forums",
    "dateProposed": "2000-07-20",
    "episodesSpanned": [31, 500, 541, 542, 543, 544, 545],
    "status": "CONFIRMED",
    "spoilerLevel": "SAGA_SPOILERS",
    "popularity": {
      "upvotes": null,
      "views": null,
      "discussionThreads": null
    },
    "relatedCharacters": ["arlong", "jinbe", "fisher-tiger"],
    "relatedEvents": ["ep031-event-005"],
    "resolution": "The Fish-Man Island arc confirmed this theory, revealing that Arlong's hatred stemmed from systemic discrimination against fish-men, the death of his captain Fisher Tiger, and his twisted interpretation of Tiger's ideals. While not excusing his actions, the backstory provided the complex motivation fans predicted.",
    "evidence": [
      "Arlong's mention of past experiences with humans",
      "The connection to Jinbe suggested shared history",
      "One Piece's pattern of giving villains sympathetic backstories",
      "The specificity of his ideology suggested deeper roots than simple evil"
    ]
  },
  {
    "theoryTitle": "The Significance of the Seven Warlords",
    "theoryText": "When the Seven Warlords system was first explained in Episode 31, fans immediately began theorizing that this would be a major power structure the Straw Hats would repeatedly clash with. Some predicted that each Warlord would represent a different philosophy about piracy and justice, and that defeating or converting Warlords would be a recurring pattern in Luffy's journey.",
    "theorist": "One Piece Power Structure Theorists",
    "platform": "Fan Communities",
    "dateProposed": "2000-07-13",
    "episodesSpanned": [31, 151, 377, 461, 516, 746],
    "status": "CONFIRMED",
    "spoilerLevel": "SERIES_SPOILERS",
    "popularity": {
      "upvotes": null,
      "views": null,
      "discussionThreads": null
    },
    "relatedCharacters": ["luffy", "mihawk", "jinbe", "crocodile", "doflamingo", "boa-hancock"],
    "relatedEvents": ["ep031-event-001"],
    "resolution": "This theory was thoroughly confirmed as the Straw Hats encountered and fought multiple Warlords throughout the series, with each representing different aspects of the pirate world. The Warlord system became one of the three great powers alongside the Marines and the Yonko.",
    "evidence": [
      "The formal introduction of the system suggested long-term importance",
      "Mihawk's earlier appearance as an impossibly strong opponent set precedent",
      "The government sanctioning of pirates suggested complex political dynamics"
    ]
  }
]
