[
  {
    "name": {
      "english": "Cat-Cat Fruit, Model: Leopard",
      "japanese": "ネコネコの実 モデル:豹",
      "romanized": "Neko Neko no Mi, Moderu: Reopādo"
    },
    "type": "ZOAN",
    "debutEpisode": 245,
    "debutChapter": 348,
    "description": "A Zoan-type Devil Fruit that allows the user to transform into a leopard and a leopard-human hybrid. Grants enhanced strength, speed, agility, powerful teeth and jaws, retractable claws, stealth capabilities, and enhanced senses.",
    "episodeAppearances": [245],
    "users": [
      {
        "characterId": "lucci",
        "episodeStart": 245,
        "episodeEnd": "present",
        "circumstances": "Rob Lucci consumed this fruit at some point before his undercover mission in Water 7. He reveals his transformation ability in silhouette at the end of this episode."
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Leopard Transformation",
        "episodeRevealed": 245,
        "description": "Lucci can transform into a leopard hybrid form, though only shown in silhouette in this episode. The full transformation is revealed in Episode 246.",
        "severity": "CRITICAL",
        "firstUseContext": "Lucci begins to transform at the end of the confrontation with the Straw Hats, revealing his Devil Fruit power as a cliffhanger."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim and weakness to Sea-Prism Stone",
        "episodeRevealed": 245,
        "severity": "MINOR"
      }
    ],
    "strengths": [
      {
        "strength": "Enhanced physical abilities including strength, speed, and agility",
        "episodeRevealed": 245,
        "description": "The leopard form grants dramatically increased combat capabilities, making Lucci even more dangerous when combined with his Rokushiki mastery.",
        "severity": "CRITICAL"
      },
      {
        "strength": "Powerful natural weapons - claws and teeth",
        "episodeRevealed": 245,
        "description": "The leopard form provides sharp claws and powerful jaws for close combat.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "UNCOMMON",
    "powerTier": "HIGH"
  }
]
