[
  {
    "name": {
      "english": "Mary Geoise",
      "japanese": "マリージョア",
      "romanized": "Marījoa"
    },
    "debutEpisode": 151,
    "debutChapter": 233,
    "episodeAppearances": [541],
    "locationType": "CITY",
    "region": "Red Line",
    "controllingFaction": "World Government",
    "keyEvents": [
      {
        "episodeNumber": 541,
        "eventId": "ep541-event-001",
        "eventType": "WORLD_LORE",
        "title": "Aftermath of Tiger's Attack Discussed",
        "description": "King Neptune discusses the political fallout from Fisher Tiger's attack on Mary Geoise and liberation of slaves, noting it will prevent Fish-Man Island from attending the World Summit.",
        "significance": "Reveals the far-reaching political consequences of Tiger's actions and the World Government's response.",
        "timestamp": "03:00"
      }
    ],
    "reveals": [
      {
        "infoType": "POLITICAL_IMPACT",
        "information": "Fisher Tiger's attack on Mary Geoise has caused Fish-Man Island to be barred from the World Summit",
        "episodeRevealed": 541,
        "severity": "MAJOR"
      }
    ],
    "description": "The holy land of the World Government, located at the top of the Red Line. Home to the Celestial Dragons and location of the World Summit.",
    "significance": "Mary Geoise represents the seat of power for the World Government and the Celestial Dragons, making Fisher Tiger's successful attack and slave liberation all the more remarkable and politically significant."
  },
  {
    "name": {
      "english": "Fish-Man Island",
      "japanese": "魚人島",
      "romanized": "Gyojin-tō"
    },
    "debutEpisode": 1,
    "debutChapter": 1,
    "episodeAppearances": [541],
    "locationType": "ISLAND",
    "region": "Undersea",
    "controllingFaction": "Ryugu Kingdom",
    "keyEvents": [
      {
        "episodeNumber": 541,
        "eventId": "ep541-event-001",
        "eventType": "WORLD_LORE",
        "title": "Celebration of Tiger as Hero",
        "description": "The citizens of Fish-Man Island celebrate Fisher Tiger as a hero for his attack on Mary Geoise and liberation of slaves, while Queen Otohime's attempts to gather signatures for peaceful human migration are rejected.",
        "significance": "Shows the divide in Fish-Man Island society between those who support violent rebellion against humans and those who seek peaceful coexistence.",
        "timestamp": "03:00"
      }
    ],
    "reveals": [
      {
        "infoType": "SOCIAL_DYNAMICS",
        "information": "The population largely celebrates Tiger's violent actions against the World Government while rejecting Otohime's peaceful approach",
        "episodeRevealed": 541,
        "severity": "MAJOR"
      }
    ],
    "description": "An underwater kingdom inhabited by fish-men and merfolk, located beneath the ocean on the way to the New World.",
    "significance": "Fish-Man Island serves as the homeland for the fish-men and the backdrop for exploring themes of discrimination, racism, and different approaches to achieving equality."
  }
]
