[
  {
    "id": "theory-ep461-001",
    "title": "Whitebeard Could Have Won If He Was In His Prime",
    "summary": "Fans theorize that if Whitebeard had been in his prime physical condition during the Marineford War, he could have defeated the Marines and rescued Ace successfully.",
    "fullText": "Many fans believe that Whitebeard's age and deteriorating health were the primary factors preventing him from achieving victory at Marineford. In his prime, Whitebeard was considered the strongest man in the world and rival to Gol D. Roger. With the full power of the Gura Gura no Mi and his peak physical condition, he could have potentially defeated multiple Admirals and changed the outcome of the war. Episode 461 shows his devastating power even while weakened, leading fans to speculate about what he could have done at full strength.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://onepiece.fandom.com/f/p/4400000000003777927",
      "title": "Let's say bonney was at marineford and she made whitebeard back to his prime could he save ace?",
      "platform": "Fandom",
      "accessedAt": "2025-12-13"
    },
    "postedDate": "Unknown",
    "episodeRange": [461, 483],
    "minEpisode": 461,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 483
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["whitebeard", "ace"],
    "relatedLocations": ["marineford"],
    "relatedEvents": ["ep461-event-001", "ep461-event-002"],
    "tags": ["whitebeard", "prime", "marineford", "what-if"]
  },
  {
    "id": "theory-ep461-002",
    "title": "Whitebeard Intentionally Held Back to Protect Ace",
    "summary": "Some fans theorize that Whitebeard deliberately held back his full destructive power at Marineford because unleashing it completely would have endangered Ace on the execution platform.",
    "fullText": "This theory suggests that Whitebeard's measured approach to the war wasn't just due to his health, but because he needed to be careful not to cause destruction that would kill Ace in the process. His tsunamis in Episode 461 show he could have destroyed the entire island, but doing so would have killed Ace as well. This tactical restraint may have given the Marines an advantage they wouldn't have had otherwise.",
    "author": "Worstgen Forums",
    "source": {
      "url": "https://worstgen.alwaysdata.net/forum/threads/the-reason-they-didnt-execute-ace-immediately-was-so-whitebeard-had-a-reason-to-hold-back-at-marineford.17795/",
      "title": "The reason they didn't execute Ace immediately was so Whitebeard had a reason to hold back at Marineford",
      "platform": "Worstgen",
      "accessedAt": "2025-12-13"
    },
    "postedDate": "Unknown",
    "episodeRange": [461, 483],
    "minEpisode": 461,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 483
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["whitebeard", "ace", "sengoku"],
    "relatedLocations": ["marineford"],
    "relatedEvents": ["ep461-event-002"],
    "tags": ["whitebeard", "strategy", "marineford", "ace"]
  },
  {
    "id": "theory-ep461-003",
    "title": "The D. Conversation Between Whitebeard and Roger",
    "summary": "Fans speculate about what Roger told Whitebeard regarding the meaning of the 'D.' initial, as referenced in later Marineford episodes but set up by the close relationship shown in Episode 461's flashbacks.",
    "fullText": "Episode 461 establishes the deep bonds and history within the Whitebeard Pirates. Later in the Marineford arc, there's a flashback showing Whitebeard asking Roger about the meaning of 'D.' While Roger answers, the audience doesn't hear it. Fans have developed numerous theories about what the D. stands for and why Roger shared this information with Whitebeard specifically. The father-son relationship between Whitebeard and Ace shown in this episode takes on additional meaning knowing that Ace carries the D. initial.",
    "author": "One Piece Wiki Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Summit_War_of_Marineford",
      "title": "Summit War of Marineford",
      "platform": "Fandom",
      "accessedAt": "2025-12-13"
    },
    "postedDate": "Unknown",
    "episodeRange": [461, 483],
    "minEpisode": 461,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 483
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["whitebeard", "ace", "roger"],
    "relatedLocations": [],
    "relatedEvents": ["ep461-event-015"],
    "tags": ["will-of-d", "roger", "whitebeard", "mystery"]
  }
]