[
  {
    "name": {
      "english": "Upper Yard",
      "japanese": "アッパーヤード",
      "romanized": "Appā Yādo"
    },
    "type": "ISLAND",
    "episodeAppearances": [173],
    "keyEvents": [
      {
        "episodeNumber": 173,
        "eventId": "ep173-event-001",
        "title": "Enel Joins Survival Game",
        "description": "Enel personally enters Upper Yard to participate in the survival game, confronting fighters directly.",
        "significance": "Upper Yard becomes the battleground for Enel's overwhelming display of power."
      },
      {
        "episodeNumber": 173,
        "eventId": "ep173-event-006",
        "title": "1,000,000 Volt Vari Devastates Area",
        "description": "Enel's electrical attack travels through Upper Yard's Milky Road, affecting a wide area.",
        "significance": "Demonstrates the dangerous and conductive nature of Upper Yard's environment."
      },
      {
        "episodeNumber": 173,
        "eventId": "ep173-event-015",
        "title": "Conis and Pagaya Navigate Through",
        "description": "Conis and Pagaya successfully navigate the dangerous Upper Yard to reach the Going Merry.",
        "significance": "Shows the persistent dangers in Upper Yard beyond just the survival game combatants."
      }
    ],
    "description": "The forbidden holy ground of Skypiea, formerly part of Jaya before being launched into the sky. Site of the survival game where Enel tests fighters.",
    "significance": "Central location for the Skypiea Arc's main conflicts and the survival game.",
    "currentStatus": "ACTIVE"
  },
  {
    "name": {
      "english": "Milky Road",
      "japanese": "ミルキーロード",
      "romanized": "Mirukī Rōdo"
    },
    "type": "PATHWAY",
    "episodeAppearances": [173],
    "keyEvents": [
      {
        "episodeNumber": 173,
        "eventId": "ep173-event-006",
        "title": "Electrical Attack Travels Through Milky Road",
        "description": "Enel's 1,000,000 Volt Vari attack travels through the Milky Road's conductive surface, defeating 20 fighters.",
        "significance": "Reveals that the Milky Road can conduct electricity, making it particularly dangerous against Enel's powers."
      }
    ],
    "description": "Cloud pathways in Skypiea that fighters use to navigate. The conductive properties make them dangerous conduits for Enel's electrical attacks.",
    "significance": "The conductive nature of the Milky Road amplifies Enel's attack range and effectiveness.",
    "currentStatus": "ACTIVE"
  },
  {
    "name": {
      "english": "Going Merry",
      "japanese": "ゴーイングメリー号",
      "romanized": "Gōingu Merī-gō"
    },
    "type": "SHIP",
    "episodeAppearances": [173],
    "keyEvents": [
      {
        "episodeNumber": 173,
        "eventId": "ep173-event-009",
        "title": "Battle Against Hotori and Kotori",
        "description": "Nami and Gan Fall defend the Going Merry against the twin priests Hotori and Kotori.",
        "significance": "The Going Merry serves as a safe haven for unconscious crew members and a defensive position."
      },
      {
        "episodeNumber": 173,
        "eventId": "ep173-event-014",
        "title": "Conis, Pagaya, and Aisa Arrive",
        "description": "Conis, Pagaya, and Aisa successfully locate and reach the Going Merry with supplies.",
        "significance": "The ship becomes a rallying point for allies in Upper Yard."
      }
    ],
    "description": "The Straw Hat Pirates' ship, currently anchored in Upper Yard. Serves as a base and refuge during the survival game.",
    "significance": "Safe location where injured crew members recover and allies gather.",
    "currentStatus": "ACTIVE"
  }
]
