[
  {
    "theoryTitle": "Dorry and Brogy's Return to Elbaf and Connection to Sun God Nika",
    "theoryText": "After resolving their century-long duel shown in episodes 70-77, Dorry and Brogy returned to Elbaf and later became involved in the Egghead Incident to rescue the Straw Hat Pirates. The theory suggests that Dorry and Brogy refer to Luffy as the Sun God, hinting that the Giants are aware of the legend of Nika. The connection likely comes from seeing Luffy's Gear Fifth form in his bounty poster. The Winter Solstice Festival celebrated in Elbaf, which celebrates 'the death and rebirth of the sun,' may be connected to Nika worship among the giants.",
    "originPlatform": "Reddit/GameRant",
    "author": "Multiple fans and theorists",
    "datePosted": "2024",
    "url": "https://gamerant.com/one-piece-dorry-brogy-egghead-sun-god-nika/",
    "episodesReferenced": [70, 71, 72, 73, 74, 75, 76, 77],
    "episodesSpanned": [70, 1100],
    "containsSpoilers": true,
    "spoilsEpisodes": [1000, 1100],
    "popularityMetrics": {
      "upvotes": null,
      "views": null,
      "comments": null
    },
    "status": "CONFIRMED",
    "tags": ["Elbaf", "Sun God Nika", "Dorry", "Brogy", "Giants", "Egghead"],
    "relatedTheories": ["Sun God Nika theory", "Elbaf arc predictions"]
  },
  {
    "theoryTitle": "Dorry and Brogy's Potential Death in Elbaf Arc",
    "theoryText": "A controversial theory suggests that Oda could kill off Dorry and Brogy in the Elbaf arc. The theory proposes that Zoro and Sanji might defeat Dorry and Brogy in Elbaf, leading to a heroic death for the giants. This would serve multiple narrative purposes: showing how much the Straw Hats have grown since Little Garden, providing emotional weight to the Elbaf arc, and demonstrating the dangers of the New World. The theory is based on Oda's statement about deciding to kill two characters in Elbaf, though the exact characters were not confirmed.",
    "originPlatform": "GameRant",
    "author": "One Piece theorists",
    "datePosted": "2024",
    "url": "https://gamerant.com/one-piece-oda-decided-kill-two-characters-elbaf/",
    "episodesReferenced": [70, 71, 72, 73, 74, 75, 76, 77],
    "episodesSpanned": [70, 1100],
    "containsSpoilers": true,
    "spoilsEpisodes": [1100],
    "popularityMetrics": {
      "upvotes": null,
      "views": null,
      "comments": null
    },
    "status": "SPECULATION",
    "tags": ["Elbaf", "Dorry", "Brogy", "character death", "Zoro", "Sanji"],
    "relatedTheories": ["Elbaf arc predictions", "Character deaths in One Piece"]
  },
  {
    "theoryTitle": "Norse Mythology Connection: The World Serpent",
    "theoryText": "During their time on Little Garden, Dorry refers to a serpent soaked in blood as the one thing he and Brogy can't pierce, evoking the image of Jörmungandr, the World Serpent from Norse mythology. This connection suggests deeper mythological themes in the Little Garden and Elbaf storylines. The giants' warrior culture, their reverence for combat, and references to serpents all connect to Norse mythology. This could foreshadow encounters with sea kings, ancient weapons, or other serpent-like entities later in the story. The theory suggests Oda intentionally wove Norse mythology into the giants' storyline.",
    "originPlatform": "Various fan forums and analysis sites",
    "author": "One Piece mythology analysts",
    "datePosted": "2020-2024",
    "url": "https://www.themarysue.com/one-piece-who-are-dory-and-broggy/",
    "episodesReferenced": [70, 71, 72, 73],
    "episodesSpanned": [70, 77],
    "containsSpoilers": false,
    "spoilsEpisodes": [],
    "popularityMetrics": {
      "upvotes": null,
      "views": null,
      "comments": null
    },
    "status": "SPECULATION",
    "tags": ["Norse mythology", "Jörmungandr", "Dorry", "Brogy", "symbolism", "foreshadowing"],
    "relatedTheories": ["Elbaf mythology theories", "Ancient weapons connection"]
  },
  {
    "theoryTitle": "The Giants' 100-Year Duel as a Test of Honor",
    "theoryText": "The century-long duel between Dorry and Brogy serves as more than just combat - it represents the ultimate test of warrior honor in Elbaf culture. The theory suggests that when Mr. 3 sabotaged their duel in episode 73, it wasn't just about helping Baroque Works but represented a fundamental violation of giant warrior culture. The fact that both giants were devastated by the tainted victory demonstrates that the journey (honorable combat) mattered more than the destination (winning). This theme connects to later arcs where honor and proper combat become crucial to resolving conflicts. The theory also suggests that Luffy's respect for their duel (trying to stop it when Dorry was injured) earned him the giants' eternal friendship, which pays off much later in the story.",
    "originPlatform": "Reddit/Analysis blogs",
    "author": "Multiple One Piece analysts",
    "datePosted": "2020-2023",
    "url": "https://poggers.com/blogs/anime/one-piece-little-garden-arc-summary-recap-review",
    "episodesReferenced": [70, 71, 72, 73, 74],
    "episodesSpanned": [70, 77],
    "containsSpoilers": false,
    "spoilsEpisodes": [],
    "popularityMetrics": {
      "upvotes": null,
      "views": null,
      "comments": null
    },
    "status": "ANALYSIS",
    "tags": ["honor", "warrior culture", "Elbaf", "themes", "character development"],
    "relatedTheories": ["Luffy's influence on others", "Elbaf culture theories"]
  }
]
