[
  {
    "id": "ushi-ushi-no-mi-model-bison",
    "name": {
      "english": "Ox-Ox Fruit, Model: Bison",
      "japanese": "ウシウシの実 モデル:バイソン",
      "romanized": "Ushi Ushi no Mi, Moderu: Baison"
    },
    "abilityType": "DEVIL_FRUIT",
    "devilFruitType": "ZOAN",
    "debutEpisode": 81,
    "debutChapter": 135,
    "episodeAppearances": [82],
    "currentUser": "dalton",
    "formerUsers": [],
    "description": "A Zoan-type Devil Fruit that allows the user to transform into a full bison or a human-bison hybrid at will. Dalton's usage emphasizes speed and agility rather than raw strength, allowing him to create afterimages and move rapidly across terrain.",
    "keyMoments": [
      {
        "episodeNumber": 82,
        "eventId": "ep082-event-007",
        "momentType": "POWER_REVEAL",
        "title": "Ushi Ushi no Mi, Model: Bison Named",
        "description": "The Devil Fruit is officially identified by name when Wapol's soldiers recognize Dalton's transformation during his confrontation with Wapol.",
        "significance": "First official naming of Dalton's Devil Fruit ability. This is the second Zoan Devil Fruit shown in the series and the first 'standard' Zoan focused on speed.",
        "timestamp": "16:20"
      }
    ],
    "strengths": [
      "Enhanced speed and agility in hybrid form",
      "Ability to create afterimages through rapid movement",
      "Increased physical strength",
      "Suitable for rapid traversal across difficult terrain"
    ],
    "weaknesses": [
      "Standard Devil Fruit weaknesses (sea water, Seastone)",
      "User cannot swim"
    ],
    "techniques": [
      {
        "techniqueName": "Bison Transformation",
        "description": "Dalton transforms into a human-bison hybrid, gaining enhanced speed and agility.",
        "episodeFirstUsed": 81,
        "visualDescription": "Dalton's body takes on bison characteristics with horns and enhanced musculature while maintaining his human form."
      }
    ],
    "awakening": null,
    "images": [],
    "trivia": [
      "The Ushi Ushi no Mi, Model: Bison is the second Zoan-type Devil Fruit shown in the One Piece anime (after Chopper's Hito Hito no Mi in Episode 81).",
      "It is the first 'standard' Zoan Devil Fruit that emphasizes speed over strength.",
      "The name was first revealed in Episode 82 when Wapol's soldiers identified it during Dalton's transformation."
    ]
  }
]
