[
  {
    "id": "theory-ep082-001",
    "theoryTitle": "Wapol's Hidden Connection to the World Government and Vegapunk",
    "theoryText": "Wapol's Baku Baku no Mi ability allows him to create Wapometal, a unique alloy that has secretly been used by the World Government's SSG (Special Science Group) under Vegapunk. The theory suggests that Wapol has been doing shady business with the World Government, supplying them with Wapometal for advanced technology. Evidence includes Wapometal being used in Franky's General and potentially in Germa 66's raid suits. Additionally, Wapol and Vegapunk share the same birthday (August 9th), which may be a deliberate connection by Oda.",
    "author": "Multiple One Piece Theory Communities",
    "sourceUrl": "https://thrillerbark.com/threads/wapol-and-his-hidden-connection-to-the-world-government-vegapunk.1987/",
    "sourcePlatform": "Thriller Bark Forums",
    "publishDate": "2023-01-01",
    "episodesReferenced": [79, 80, 81, 82, 83, 84, 85, 86, 87],
    "minEpisodeToAvoidSpoilers": 82,
    "maxEpisodeSpoilers": 1000,
    "spoilerSeverity": "MAJOR",
    "spoilerWarning": "Contains major spoilers about Wapol's post-Drum Island activities, Wapometal applications in later arcs, and connections to Vegapunk's technology",
    "popularity": "MEDIUM",
    "evidenceQuality": "MEDIUM",
    "status": "PARTIALLY_CONFIRMED",
    "tags": ["wapol", "vegapunk", "world-government", "wapometal", "technology"]
  },
  {
    "id": "theory-ep082-002",
    "theoryTitle": "Luffy's Bazooka Attack Distance - Physics Behind Sending Wapol Flying",
    "theoryText": "Fans have theorized about how Luffy was able to send Wapol flying thousands of kilometers from Drum Island to another island (later named Evil Black Drum Kingdom) with a single Gomu Gomu no Bazooka attack. The theory discusses whether this was an early display of Luffy's incredible strength, the lightweight nature of Wapol after consuming various items, or simply anime/manga physics allowing for comedic effect. Some fans calculate the force needed based on distance and Wapol's estimated weight.",
    "author": "Comic Vine Community",
    "sourceUrl": "https://comicvine.gamespot.com/forums/battles-7/how-was-luffy-able-to-send-wapol-flying-to-evil-dr-2071486/",
    "sourcePlatform": "Comic Vine Forums",
    "publishDate": "2020-01-01",
    "episodesReferenced": [87],
    "minEpisodeToAvoidSpoilers": 87,
    "maxEpisodeSpoilers": 87,
    "spoilerSeverity": "MINOR",
    "spoilerWarning": "Contains spoilers about Luffy's final battle with Wapol in Episode 87",
    "popularity": "LOW",
    "evidenceQuality": "LOW",
    "status": "UNCONFIRMED",
    "tags": ["luffy", "wapol", "physics", "gomu-gomu-no-bazooka", "power-scaling"]
  },
  {
    "id": "theory-ep082-003",
    "theoryTitle": "Drum Island as Anarchist Allegory - Hiriluk's Vision",
    "theoryText": "A thematic analysis theory proposes that the Drum Island arc contains deeper political allegory, with Dr. Hiriluk representing an anarchist philosophy that advocates for the 'suicide of nations' - the internally driven removal of oppressive governance. The theory suggests that Hiriluk's cherry blossoms symbolize the rejection of governing bodies and the power of individual will to transform society from within. Wapol represents tyrannical authority, while Dalton and the people's resistance represents grassroots revolution. The arc is seen as Oda's commentary on freedom versus authoritarian control.",
    "author": "Tumblr One Piece Analysis Community",
    "sourceUrl": "https://www.tumblr.com/mmmmalo/616343055840296960/thoughts-on-drum-island-forgive-me-if-i-bury-my",
    "sourcePlatform": "Tumblr",
    "publishDate": "2021-01-01",
    "episodesReferenced": [78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90],
    "minEpisodeToAvoidSpoilers": 78,
    "maxEpisodeSpoilers": 90,
    "spoilerSeverity": "MAJOR",
    "spoilerWarning": "Contains spoilers for the entire Drum Island arc including Hiriluk's backstory and the arc's conclusion",
    "popularity": "LOW",
    "evidenceQuality": "MEDIUM",
    "status": "UNCONFIRMED",
    "tags": ["drum-island", "hiriluk", "political-allegory", "themes", "anarchism"]
  }
]
