[
  {
    "id": "theory-ep313-001",
    "title": "Garp's 'Fist of Love' Actually Uses Armament Haki",
    "summary": "Despite Oda stating the 'Fist of Love' works through actual love, many fans theorize that Garp is using Armament Haki to hurt Luffy, and Oda's explanation is just a comedic deflection.",
    "fullText": "When Garp punches Luffy in Episode 313 and causes him pain despite his rubber body, the official explanation from Oda is that it's 'love' that allows the punch to hurt. However, many fans believe Garp is actually using Armament Haki, which would make more sense given his status as a legendary Marine Vice-Admiral. Evidence includes Sanji's later comment that Luffy received damage despite being rubber, suggesting something beyond normal punches was involved. The theory is that Oda gave a comedic answer to avoid spoiling the Haki reveal that would come later in the series. This creates an interesting tension between Oda's stated explanation and the logical expectation that a Marine of Garp's caliber would use Haki in combat.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Talk:Monkey_D._Garp",
      "title": "Talk: Monkey D. Garp - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-11-19"
    },
    "postedDate": "2007-06-10",
    "episodeRange": [313, 1000],
    "minEpisode": 313,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 516
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["garp", "luffy"],
    "relatedLocations": ["water-7"],
    "relatedEvents": ["ep313-event-009"],
    "tags": ["haki", "armament-haki", "fist-of-love", "garp", "power-system"]
  },
  {
    "id": "theory-ep313-002",
    "title": "Dragon is Garp's Son-in-Law, Not Biological Son",
    "summary": "A theory that Monkey D. Dragon is not Garp's biological son but rather his son-in-law, making Garp Luffy's maternal grandfather and suggesting Dragon's father could be Rocks D. Xebec.",
    "fullText": "This theory, popular on Reddit, suggests that when Garp says Luffy is 'the child of my child,' he's being deliberately ambiguous about which parent is his biological descendant. Evidence includes: (1) Dragon's physical appearance differs significantly from Garp and Luffy, lacking their characteristic round faces and wide grins; (2) Japanese naming customs allow for mukoyōshi, where a husband adopts his wife's family name, especially if coming from a shameful background; (3) This could explain why Dragon has the Monkey D. name despite potentially being the son of Rocks D. Xebec, the series' most notorious former pirate. However, this theory was later debunked in Chapter 1087 when Garp explicitly refers to Dragon as 'my son' when venting about him becoming a revolutionary.",
    "author": "Reddit User: dfd2002",
    "source": {
      "url": "https://www.cbr.com/one-piece-who-is-dragons-father-theory/",
      "title": "One Piece Theory: Dragon Isn't Garp's Biological Son",
      "platform": "CBR",
      "accessedAt": "2025-11-19"
    },
    "postedDate": "2020-01-01",
    "episodeRange": [313, 314],
    "minEpisode": 313,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "DEBUNKED",
    "relatedCharacters": ["garp", "dragon", "luffy"],
    "relatedLocations": [],
    "relatedEvents": ["ep313-event-010"],
    "tags": ["family", "dragon", "garp", "luffy", "rocks-d-xebec", "debunked"]
  },
  {
    "id": "theory-ep313-003",
    "title": "Luffy's Mother Identity Mystery",
    "summary": "Following the revelation that Garp is Luffy's grandfather and Dragon is his father, fans have theorized extensively about the identity of Luffy's mother, who remains completely unknown.",
    "fullText": "After Episode 313 reveals Garp as Luffy's grandfather, and Episode 314 reveals Dragon as his father, the complete absence of any information about Luffy's mother has spawned numerous theories. Fans have speculated she could be: (1) A member of the revolutionary army; (2) Someone of noble lineage, explaining Dragon's mukoyōshi adoption of the Monkey name; (3) A former pirate or Marine; (4) Someone who died during Luffy's childhood; (5) A character already introduced in the series. The mystery is heightened by the fact that Oda has deliberately avoided addressing this question, neither confirming nor denying any theories. Some fans believe her identity will be crucial to the endgame of One Piece, while others think she may simply be a normal person with no special significance.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://cintanna.tumblr.com/post/152257141858/luffys-mother-theory",
      "title": "Luffy's Mother Theory",
      "platform": "Tumblr",
      "accessedAt": "2025-11-19"
    },
    "postedDate": "2016-01-01",
    "episodeRange": [313, 314],
    "minEpisode": 313,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 314
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["luffy", "dragon", "garp"],
    "relatedLocations": [],
    "relatedEvents": ["ep313-event-010"],
    "tags": ["family", "luffy", "mystery", "mother", "dragon"]
  }
]
