[
  {
    "character1Id": "spandam",
    "character2Id": "funkfreed",
    "relationshipType": "MASTER_SERVANT",
    "status": "ACTIVE",
    "establishedInEpisode": 254,
    "description": "Funkfreed is Spandam's sword and closest companion, serving as both a weapon and an unofficial bodyguard.",
    "evolutionMoments": [
      {
        "episodeNumber": 254,
        "eventId": "ep254-event-001",
        "description": "Funkfreed is first shown alongside Spandam at Enies Lobby, revealing their master-servant relationship.",
        "newRelationshipType": "MASTER_SERVANT",
        "significance": "Introduces Funkfreed as Spandam's loyal companion and weapon."
      }
    ],
    "emotionalDepth": "MODERATE",
    "trustLevel": "HIGH",
    "notes": "Despite being a sword, Funkfreed has a personality and serves Spandam faithfully. However, Funkfreed is noted to be gentle and lacks battlefield courage."
  },
  {
    "character1Id": "nami",
    "character2Id": "robin",
    "relationshipType": "CREW_MEMBER",
    "status": "ACTIVE",
    "establishedInEpisode": 130,
    "description": "Nami and Robin are fellow crew members of the Straw Hat Pirates with a strong bond of friendship and mutual care.",
    "evolutionMoments": [
      {
        "episodeNumber": 254,
        "eventId": "ep254-event-003",
        "description": "Nami emotionally reveals Robin's sacrifice to Luffy, showing her deep concern for Robin's wellbeing and determination to save her.",
        "newRelationshipType": "CREW_MEMBER",
        "significance": "Demonstrates how much Nami cares about Robin and is willing to risk her life to help rescue her."
      }
    ],
    "emotionalDepth": "DEEP",
    "trustLevel": "HIGH",
    "notes": "This episode shows Nami's emotional investment in Robin's safety, highlighting their sisterly bond within the crew."
  },
  {
    "character1Id": "luffy",
    "character2Id": "robin",
    "relationshipType": "CAPTAIN_CREW",
    "status": "ACTIVE",
    "establishedInEpisode": 130,
    "description": "Luffy is Robin's captain and nakama, with an unwavering commitment to protect and support her.",
    "evolutionMoments": [
      {
        "episodeNumber": 254,
        "eventId": "ep254-event-012",
        "description": "Upon learning of Robin's sacrifice, Luffy immediately declares they will rescue her, demonstrating his absolute loyalty to his crew.",
        "newRelationshipType": "CAPTAIN_CREW",
        "significance": "Reinforces Luffy's role as a captain who will never abandon a crew member, no matter the cost."
      }
    ],
    "emotionalDepth": "DEEP",
    "trustLevel": "ABSOLUTE",
    "notes": "Luffy's instant decision to rescue Robin, even from a World Government stronghold, exemplifies his protective nature toward his nakama."
  },
  {
    "character1Id": "paulie",
    "character2Id": "luffy",
    "relationshipType": "ALLY",
    "status": "ACTIVE",
    "establishedInEpisode": 240,
    "description": "Paulie and Luffy have formed an alliance to fight against CP9 and rescue Robin and Franky.",
    "evolutionMoments": [
      {
        "episodeNumber": 254,
        "eventId": "ep254-event-009",
        "description": "Paulie risks his life to save Luffy and the other Straw Hats from the Aqua Laguna using his rope abilities.",
        "newRelationshipType": "ALLY",
        "significance": "Solidifies Paulie's commitment to helping the Straw Hats in their mission."
      }
    ],
    "emotionalDepth": "MODERATE",
    "trustLevel": "HIGH",
    "notes": "Paulie's rescue of the Straw Hats demonstrates his transition from rival to trusted ally."
  },
  {
    "character1Id": "chopper",
    "character2Id": "zoro",
    "relationshipType": "CREW_MEMBER",
    "status": "ACTIVE",
    "establishedInEpisode": 90,
    "description": "Chopper and Zoro are fellow crew members with a relationship built on mutual support and occasional comedy.",
    "evolutionMoments": [
      {
        "episodeNumber": 254,
        "eventId": "ep254-event-006",
        "description": "Chopper finds Zoro stuck in a chimney and brings him his sword, enabling Zoro to escape.",
        "newRelationshipType": "CREW_MEMBER",
        "significance": "Shows Chopper's dedication to helping his crewmates even in comedic situations."
      }
    ],
    "emotionalDepth": "MODERATE",
    "trustLevel": "HIGH",
    "notes": "This episode highlights their supportive dynamic, with Chopper immediately rushing to help Zoro when he finds him in trouble."
  }
]
