[
  {
    "id": "theory-ep311-001",
    "title": "Going Merry's Klabautermann Saved the Crew",
    "summary": "The theory that the Going Merry's ship spirit (Klabautermann) physically manifested to sail the ship from Water 7 to Enies Lobby, explaining how a critically damaged ship could make such a journey.",
    "fullText": "Fans theorized that the Going Merry's rescue of the Straw Hats at Enies Lobby was the work of its Klabautermann - the ship's spirit from nautical folklore. This theory explains how a ship that was deemed beyond repair could sail itself through a storm across the ocean to arrive at exactly the right moment. The Klabautermann concept was previously introduced when Usopp saw a mysterious figure repairing the ship, and this episode serves as confirmation that ships can develop spirits through the love and care of their crews. This theory was later essentially confirmed by Franky's explanation of the ship spirit.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Klabautermann",
      "title": "Klabautermann - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-11-19"
    },
    "postedDate": "2007-05-27",
    "episodeRange": [234, 312],
    "minEpisode": 234,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 312
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["usopp", "franky"],
    "relatedLocations": ["going-merry"],
    "relatedEvents": ["ep311-event-001", "ep312-event-farewell"],
    "tags": ["klabautermann", "ship-spirit", "going-merry", "confirmed-theory"]
  },
  {
    "id": "theory-ep311-002",
    "title": "Enies Lobby Was Once Laugh Tale",
    "summary": "A theory suggesting that the mysterious hole at Enies Lobby was once the location of Laugh Tale, and the Going Merry's final resting place near Enies Lobby means it fulfilled its ultimate mission.",
    "fullText": "Some fans have theorized that Enies Lobby's mysterious chasm - where there's perpetual daylight and a massive hole in the ocean - was once the location of Laugh Tale, the island where the One Piece is hidden. This theory suggests that the island was destroyed or moved, leaving only the hole behind. If true, this would mean that the Going Merry, which meets its end near Enies Lobby, actually made it to the vicinity of the legendary final island, symbolically completing its journey. While this theory is largely speculative and lacks concrete evidence, it adds poetic resonance to the Going Merry's final voyage.",
    "author": "Reddit User",
    "source": {
      "url": "https://www.reddit.com/r/OnePiece/",
      "title": "r/OnePiece Theory Discussion",
      "platform": "Reddit",
      "accessedAt": "2025-11-19"
    },
    "postedDate": "2015-01-01",
    "episodeRange": [311, 1000],
    "minEpisode": 311,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1000
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": [],
    "relatedLocations": ["enies-lobby", "going-merry"],
    "relatedEvents": ["ep311-event-012"],
    "tags": ["enies-lobby", "laugh-tale", "going-merry", "speculative"]
  },
  {
    "id": "theory-ep311-003",
    "title": "Enies Lobby's Hole Was Created by Ancient Weapon",
    "summary": "Theory that the massive hole beneath Enies Lobby was created by one of the Ancient Weapons, possibly Uranus, during the Void Century.",
    "fullText": "Fans have long theorized about the origin of Enies Lobby's mysterious bottomless hole and perpetual daylight. One popular theory suggests that an Ancient Weapon - possibly Uranus - destroyed whatever island once stood there during the Void Century. Recent manga chapters showing what happened to Lulusia have reignited this theory, as fans draw parallels between that destruction and what might have happened at Enies Lobby. Some theorize it could have been God Valley, though timeline inconsistencies exist (giants Oimo and Kashii mention working at Enies Lobby for 50 years). This theory connects to the broader mystery of the Void Century and the World Government's secrets.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://www.cbr.com/one-piece-1089-enies-lobby-secret-details/",
      "title": "Did One Piece Just Reveal the Secret of Enies Lobby?",
      "platform": "CBR",
      "accessedAt": "2025-11-19"
    },
    "postedDate": "2023-07-01",
    "episodeRange": [263, 1089],
    "minEpisode": 263,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": [],
    "relatedLocations": ["enies-lobby"],
    "relatedEvents": ["ep311-event-011"],
    "tags": ["ancient-weapons", "void-century", "enies-lobby", "worldbuilding"]
  },
  {
    "id": "theory-ep311-004",
    "title": "Aokiji Let the Straw Hats Escape on Purpose",
    "summary": "Theory that Admiral Aokiji deliberately arrived late and ordered the Marines to stand down because he sympathized with the Straw Hats' cause or had other motives.",
    "fullText": "Some fans theorize that Aokiji's decision to declare Enies Lobby a 'complete defeat' and order the Marines to stand down wasn't just pragmatism - it was intentional. Aokiji has shown a tendency to follow his own sense of justice rather than absolute orders (as seen in his interactions with the crew at Long Ring Long Land). The theory suggests he may have deliberately delayed his arrival or chose not to pursue the Straw Hats because he respected their determination to save Robin, or because he had doubts about the World Government's actions. This theory gains credence from later revelations about Aokiji's character and his eventual departure from the Marines.",
    "author": "Reddit/YouTube Theory Community",
    "source": {
      "url": "https://www.reddit.com/r/OnePiece/",
      "title": "Aokiji Character Analysis Discussions",
      "platform": "Reddit",
      "accessedAt": "2025-11-19"
    },
    "postedDate": "2007-06-01",
    "episodeRange": [225, 311, 650],
    "minEpisode": 225,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 650
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["aokiji"],
    "relatedLocations": ["enies-lobby"],
    "relatedEvents": ["ep311-event-010", "ep311-event-011"],
    "tags": ["aokiji", "lazy-justice", "character-motivation"]
  }
]
