[
  {
    "name": {
      "english": "Sand-Sand Fruit",
      "japanese": "スナスナの実",
      "romanized": "Suna Suna no Mi"
    },
    "type": "LOGIA",
    "debutEpisode": 106,
    "debutChapter": 170,
    "episodeAppearances": [106],
    "description": "A Logia-type Devil Fruit that allows the user to create, control, and transform into sand at will. The user becomes a Sand Human with the ability to turn their body intangible by transforming into sand, making them immune to conventional physical attacks.",
    "abilities": [
      {
        "abilityName": "Sand Transformation",
        "description": "The user can transform their entire body or parts of it into sand, allowing physical attacks to pass harmlessly through them.",
        "episodeFirstUsed": 106,
        "visualDescription": "Crocodile's body disperses into sand when attacked, reforming instantly.",
        "limitations": "Like all Devil Fruit users, the user is vulnerable to Seastone and seawater. Additionally, the sand form can be solidified if it gets wet."
      }
    ],
    "currentUser": {
      "characterId": "crocodile",
      "episodeObtained": null,
      "howObtained": "UNKNOWN"
    },
    "previousUsers": [],
    "awakening": {
      "isAwakened": false,
      "awakeningEpisode": null,
      "awakeningAbilities": []
    },
    "weakness": [
      {
        "weakness": "Water/Moisture",
        "description": "Water causes the sand to clump and solidify, preventing transformation and making the user vulnerable to physical attacks.",
        "episodeRevealed": null
      },
      {
        "weakness": "Seastone",
        "description": "Standard Devil Fruit weakness - contact with Seastone nullifies powers.",
        "episodeRevealed": 106
      }
    ],
    "culturalReferences": [],
    "reveals": [
      {
        "episodeNumber": 106,
        "revealType": "POWER_REVEAL",
        "description": "First full demonstration and explanation of the Suna Suna no Mi's intangibility and sand transformation abilities.",
        "significance": "Establishes Crocodile as nearly invincible through conventional means and sets up the challenge for defeating him.",
        "severity": "MAJOR"
      }
    ]
  },
  {
    "name": {
      "english": "Flower-Flower Fruit",
      "japanese": "ハナハナの実",
      "romanized": "Hana Hana no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 67,
    "debutChapter": 114,
    "episodeAppearances": [106],
    "description": "A Paramecia-type Devil Fruit that allows the user to replicate and sprout their body parts on any surface within range. The user can create multiple copies of their arms, legs, eyes, or even their entire body on objects or living beings.",
    "abilities": [
      {
        "abilityName": "Body Part Replication",
        "description": "The user can sprout multiple copies of body parts from any surface, including enemies' bodies, to restrain or attack them.",
        "episodeFirstUsed": 67,
        "visualDescription": "Arms, hands, or other body parts bloom like flowers from surfaces to grab, restrain, or strike targets.",
        "limitations": "Damage to the sprouted body parts is felt by the user. The user cannot sprout body parts on surfaces they cannot see or that are too far away."
      }
    ],
    "currentUser": {
      "characterId": "nico-robin",
      "episodeObtained": null,
      "howObtained": "CONSUMED_AS_CHILD"
    },
    "previousUsers": [],
    "awakening": {
      "isAwakened": false,
      "awakeningEpisode": null,
      "awakeningAbilities": []
    },
    "weakness": [
      {
        "weakness": "Shared Damage",
        "description": "Any damage dealt to sprouted body parts is felt by the user's real body.",
        "episodeRevealed": null
      }
    ],
    "culturalReferences": [],
    "reveals": [
      {
        "episodeNumber": 106,
        "revealType": "TECHNIQUE_DEBUT",
        "description": "Robin demonstrates advanced combat applications of her Hana Hana no Mi, using it to simultaneously restrain and defeat both Vivi and Pell.",
        "significance": "Showcases Robin's combat effectiveness and her role as Crocodile's most powerful agent.",
        "severity": "MINOR"
      }
    ]
  },
  {
    "name": {
      "english": "Bird-Bird Fruit, Model: Falcon",
      "japanese": "トリトリの実 モデル隼",
      "romanized": "Tori Tori no Mi, Moderu: Hayabusa"
    },
    "type": "ZOAN",
    "debutEpisode": 106,
    "debutChapter": 169,
    "episodeAppearances": [106],
    "description": "A Zoan-type Devil Fruit that allows the user to transform into a falcon or a falcon-human hybrid at will. This fruit grants the user enhanced speed, aerial maneuverability, and powerful claw attacks.",
    "abilities": [
      {
        "abilityName": "Falcon Transformation",
        "description": "The user can transform fully or partially into a falcon, gaining wings for flight and enhanced physical abilities.",
        "episodeFirstUsed": 106,
        "visualDescription": "Pell transforms into a large falcon capable of carrying humans and engaging in aerial combat.",
        "limitations": "Standard Devil Fruit weaknesses including Seastone and seawater."
      },
      {
        "abilityName": "Tobizume (Flying Claws)",
        "description": "An aerial claw attack executed while in falcon form.",
        "episodeFirstUsed": 106,
        "visualDescription": "Pell dives from the sky with extended talons to strike enemies.",
        "limitations": "Requires aerial positioning and flight capability."
      }
    ],
    "currentUser": {
      "characterId": "pell",
      "episodeObtained": null,
      "howObtained": "UNKNOWN"
    },
    "previousUsers": [],
    "awakening": {
      "isAwakened": false,
      "awakeningEpisode": null,
      "awakeningAbilities": []
    },
    "weakness": [
      {
        "weakness": "Seastone",
        "description": "Standard Devil Fruit weakness.",
        "episodeRevealed": null
      }
    ],
    "culturalReferences": [
      {
        "reference": "Pell's falcon form represents one of the guardian spirits of Alabasta, connecting to ancient Egyptian symbolism where falcons were associated with Horus, the god of the sky and kingship.",
        "significance": "Ties the character to the Egyptian-themed Alabasta Kingdom."
      }
    ],
    "reveals": [
      {
        "episodeNumber": 106,
        "revealType": "FIRST_APPEARANCE",
        "description": "First appearance of the Tori Tori no Mi, Model: Falcon, showcased through Pell's rescue of Vivi.",
        "significance": "Introduces one of only five known flying Devil Fruit abilities in existence.",
        "severity": "MINOR"
      }
    ]
  }
]
