[
  {
    "id": "theory-194-001",
    "title": "Roger Couldn't Actually Write the Ancient Language",
    "theoryText": "When Episode 194 aired, many fans theorized that Gol D. Roger couldn't have written the message himself since Gan Fall explicitly states Roger could 'hear the voice of all things' but could not read the ancient writing. This led to speculation that someone in Roger's crew must have written it for him. This theory was later confirmed when it was revealed that Kozuki Oden, who traveled with Roger, was the one who actually carved the message on Roger's behalf.",
    "author": "One Piece fan community (various contributors)",
    "sourceUrl": "https://anime.stackexchange.com/questions/21108/who-wrote-the-passage-on-the-poneglyph-at-skypiea",
    "sourcePlatform": "Anime & Manga Stack Exchange",
    "dateProposed": "2004-06-06",
    "status": "CONFIRMED",
    "episodesSpanned": [194, 966, 967],
    "spoilerLevel": "CRITICAL",
    "popularity": "HIGH",
    "evidenceFor": [
      "Gan Fall states Roger could not read the ancient writing",
      "The message is written in the same script as Poneglyphs",
      "Roger needed someone to translate Poneglyphs for him",
      "Later confirmed in Oden's flashback arc"
    ],
    "evidenceAgainst": [],
    "relatedCharacters": ["gol-d-roger", "kozuki-oden", "gan-fall"],
    "tags": ["Roger's journey", "Ancient language", "Kozuki Oden", "Poneglyphs"]
  },
  {
    "id": "theory-194-002",
    "title": "The Rio Poneglyph is on Laugh Tale",
    "theoryText": "Based on Robin's deduction in Episode 194 that Roger took the Poneglyph information 'to where the Rio Poneglyph is located,' fans theorized that the final Poneglyph containing the complete True History must be on Laugh Tale, the final island Roger reached. This would explain why reaching Laugh Tale requires gathering information from multiple Poneglyphs - they form a map or system that guides readers to the final destination.",
    "author": "One Piece fan community (various contributors)",
    "sourceUrl": "https://onepiece.fandom.com/wiki/Poneglyph",
    "sourcePlatform": "Fandom Wiki",
    "dateProposed": "2004-06-06",
    "status": "UNCONFIRMED",
    "episodesSpanned": [194],
    "spoilerLevel": "CRITICAL",
    "popularity": "HIGH",
    "evidenceFor": [
      "Robin's deduction about connecting Poneglyphs",
      "Roger reached Laugh Tale after collecting Poneglyph information",
      "The systematic nature of the Poneglyph network",
      "Road Poneglyphs lead to Laugh Tale"
    ],
    "evidenceAgainst": [
      "No direct confirmation of a 'Rio Poneglyph' existing",
      "The True History might be revealed through connecting multiple Poneglyphs rather than a single final stone"
    ],
    "relatedCharacters": ["robin", "gol-d-roger"],
    "tags": ["Rio Poneglyph", "Laugh Tale", "True History", "Poneglyphs"]
  },
  {
    "id": "theory-194-003",
    "title": "Luffy Will Follow Roger's Exact Path",
    "theoryText": "After discovering Roger's message in Episode 194, fans theorized that Luffy and the Straw Hats are following the exact same route Roger took to reach Laugh Tale. The parallel is emphasized by Robin's contemplation at the end of the episode. This theory suggests that just like Roger, Luffy will visit all the same islands, gather the same Poneglyph information, and ultimately reach Laugh Tale, possibly experiencing the same revelation that made Roger laugh.",
    "author": "One Piece fan community",
    "sourceUrl": "https://onepiece.fandom.com/wiki/Episode_194",
    "sourcePlatform": "Fandom Wiki",
    "dateProposed": "2004-06-06",
    "status": "PARTIALLY_CONFIRMED",
    "episodesSpanned": [194],
    "spoilerLevel": "MAJOR",
    "popularity": "MEDIUM",
    "evidenceFor": [
      "Both Roger and Luffy visited Skypiea",
      "Robin's contemplation about following Roger's path",
      "The parallel journey theme throughout One Piece",
      "Later episodes show more similarities in their journeys"
    ],
    "evidenceAgainst": [
      "Luffy's journey has many unique elements Roger didn't experience",
      "The world situation has changed significantly since Roger's time",
      "Luffy doesn't necessarily need to follow the exact same route"
    ],
    "relatedCharacters": ["luffy", "gol-d-roger", "robin"],
    "tags": ["Inherited will", "Roger's journey", "Parallel paths", "Laugh Tale"]
  },
  {
    "id": "theory-194-004",
    "title": "Poseidon's Location Revelation Foreshadows Future Arcs",
    "theoryText": "When Robin reveals that the Shandorian Poneglyph contains information about Poseidon's location in Episode 194, fans theorized this was foreshadowing a future arc where the crew would discover or encounter Poseidon. This theory was validated years later when Poseidon was revealed to be Princess Shirahoshi during the Fish-Man Island arc, showing Oda's long-term planning.",
    "author": "One Piece fan community",
    "sourceUrl": "https://onepiece.fandom.com/wiki/Poneglyph",
    "sourcePlatform": "Fandom Wiki",
    "dateProposed": "2004-06-06",
    "status": "CONFIRMED",
    "episodesSpanned": [194, 560, 561, 562, 563, 564, 565],
    "spoilerLevel": "CRITICAL",
    "popularity": "HIGH",
    "evidenceFor": [
      "Direct mention of Poseidon in Episode 194",
      "Later revelation of Shirahoshi as Poseidon",
      "Robin's ability to read Poneglyphs becomes crucial in Fish-Man Island",
      "Oda's pattern of long-term foreshadowing"
    ],
    "evidenceAgainst": [],
    "relatedCharacters": ["robin", "shirahoshi"],
    "tags": ["Poseidon", "Ancient Weapons", "Foreshadowing", "Fish-Man Island"]
  },
  {
    "id": "theory-194-005",
    "title": "Roger's 'Voice of All Things' is Connected to Observation Haki",
    "theoryText": "After Gan Fall reveals that Roger could 'hear the voice of all things' in Episode 194, fans began theorizing about what this ability actually means. Many speculated it was an advanced form of Observation Haki that allows someone to hear the emotions, thoughts, or essence of living things and even inanimate objects like Poneglyphs. This theory gained traction as more was revealed about Haki in later arcs.",
    "author": "One Piece fan community",
    "sourceUrl": "https://onepiece.fandom.com/wiki/Gol_D._Roger",
    "sourcePlatform": "Fandom Wiki",
    "dateProposed": "2004-06-06",
    "status": "PARTIALLY_CONFIRMED",
    "episodesSpanned": [194],
    "spoilerLevel": "MAJOR",
    "popularity": "MEDIUM",
    "evidenceFor": [
      "Luffy later shows similar abilities to hear Sea Kings and Zunisha",
      "The ability seems related to Observation Haki",
      "Roger's crew members confirm he had this unique power",
      "The ability is hereditary (Luffy has it, Roger had it)"
    ],
    "evidenceAgainst": [
      "Never explicitly confirmed to be Haki",
      "The exact nature of the ability remains mysterious",
      "It seems distinct from normal Observation Haki"
    ],
    "relatedCharacters": ["gol-d-roger", "luffy", "gan-fall"],
    "tags": ["Voice of all things", "Observation Haki", "Special abilities", "Roger"]
  }
]
