[
  {
    "id": "shandorian-poneglyph",
    "name": "Shandorian Poneglyph",
    "nameJapanese": "シャンドラのポーネグリフ",
    "nameRomanized": "Shandora no Pōnegurifu",
    "type": "PONEGLYPH",
    "subtype": "HISTORICAL_PONEGLYPH",
    "debut": {
      "episode": 174
    },
    "episodeAppearances": [194],
    "description": "An ancient Poneglyph located at the base of the Golden Bell in Shandora. This particular Poneglyph contains information about Poseidon, one of the three Ancient Weapons. It has been protected by the Shandorians for over 400 years.",
    "keyMoments": [
      {
        "episode": 194,
        "timestamp": "04:15",
        "description": "Robin deciphers the Poneglyph and reveals it contains information about Poseidon's location",
        "significance": "First reveal of one of the Ancient Weapons in the series and confirmation that Poneglyphs contain such dangerous information"
      },
      {
        "episode": 194,
        "timestamp": "10:20",
        "description": "Robin deduces that this Poneglyph's information was carried by Roger to the location of the Rio Poneglyph",
        "significance": "Reveals how the Poneglyph system works - individual stones provide pieces that connect to lead to the final truth"
      }
    ],
    "properties": {
      "material": "Indestructible stone",
      "language": "Ancient script readable only by scholars of Ohara and the Kozuki clan",
      "contents": "Information about Poseidon, an Ancient Weapon"
    },
    "historicalSignificance": "Protected by Shandora and the Shandians for centuries. Gol D. Roger obtained its information through Kozuki Oden's translation over twenty years before the present timeline.",
    "currentLocation": "Base of the Golden Bell, Shandora, Skypiea",
    "previousOwners": [],
    "currentOwner": "Protected by the Shandians"
  },
  {
    "id": "golden-pillar-of-shandora",
    "name": "Golden Pillar of Shandora",
    "nameJapanese": "シャンドラの黄金の柱",
    "nameRomanized": "Shandora no Ōgon no Hashira",
    "type": "TREASURE",
    "subtype": "GOLD",
    "debut": {
      "episode": 194
    },
    "episodeAppearances": [194],
    "description": "A massive broken golden pillar from the Golden Belfry of Shandora. This pillar represents a piece of the legendary City of Gold's treasure and was gifted to the Straw Hat Pirates by the Shandians as thanks for ending their 400-year war.",
    "keyMoments": [
      {
        "episode": 194,
        "timestamp": "14:30",
        "description": "The Shandia present the golden pillar to the Straw Hats as a token of gratitude",
        "significance": "Represents the bond formed between the Shandians and Straw Hats, and provides the crew with substantial wealth"
      },
      {
        "episode": 194,
        "timestamp": "16:45",
        "description": "The Straw Hats mistake the wrapped pillar for a giant cannon and flee in panic",
        "significance": "Comedic moment that provides levity after serious revelations"
      }
    ],
    "properties": {
      "material": "Pure gold",
      "size": "Massive cylindrical pillar, several meters in length",
      "weight": "Extremely heavy, requires multiple people or special equipment to move",
      "value": "Immensely valuable - represents a significant portion of Shandora's golden treasures"
    },
    "historicalSignificance": "Part of the legendary City of Gold's architecture, representing 400 years of Shandorian history and culture.",
    "currentLocation": "Given to the Straw Hat Pirates",
    "previousOwners": ["Shandorians"],
    "currentOwner": "Straw Hat Pirates"
  },
  {
    "id": "rogers-message",
    "name": "Gol D. Roger's Message on the Golden Bell",
    "nameJapanese": "ゴール・D・ロジャーのメッセージ",
    "nameRomanized": "Gōru D. Rojā no Messēji",
    "type": "INSCRIPTION",
    "subtype": "HISTORICAL_ARTIFACT",
    "debut": {
      "episode": 194
    },
    "episodeAppearances": [194],
    "description": "An ancient message carved into the Golden Bell by Kozuki Oden on behalf of Gol D. Roger. Written in the same ancient language as the Poneglyphs, this message declares Roger's journey and intention to guide the Poneglyph's information to its final destination.",
    "keyMoments": [
      {
        "episode": 194,
        "timestamp": "06:30",
        "description": "Robin discovers and reads Roger's message carved on the Golden Bell",
        "significance": "Monumentalrevelation connecting the Pirate King to Skypiea and establishing the parallel between Roger's and Luffy's journeys"
      }
    ],
    "properties": {
      "material": "Carved into the golden surface of the Golden Bell",
      "language": "Ancient language (same script as Poneglyphs)",
      "contents": "I made it here and I will guide this passage all the way to the farthest ends of the earth. The stormiest seas will not stop me. - Pirate Gol D. Roger"
    },
    "historicalSignificance": "Left by Gol D. Roger (written by Kozuki Oden) over twenty years before the current timeline, serving as proof of the Pirate King's journey and his connection to the Poneglyphs and the True History.",
    "currentLocation": "Carved into the Golden Bell at Shandora, Skypiea",
    "previousOwners": [],
    "currentOwner": "Part of the Golden Bell, protected by the Shandians"
  }
]
