[
  {
    "id": "golden-bell",
    "names": {
      "primary": "Golden Bell",
      "japanese": "黄金の鐘",
      "romanized": "Ōgon no Kane",
      "aliases": ["Shandorian Golden Belfry Bell", "The Bell of Shandora"]
    },
    "type": "LANDMARK",
    "debut": {
      "episode": 188
    },
    "episodeAppearances": [194],
    "description": "The legendary Golden Bell of Shandora, a massive golden bell located at the top of the Giant Jack beanstalk. The bell contains a Poneglyph at its base and has Gol D. Roger's message carved into its golden surface.",
    "keyEvents": [
      {
        "episode": 194,
        "timestamp": "04:15",
        "description": "Robin deciphers the Poneglyph at the base of the Golden Bell, revealing information about Poseidon",
        "significance": "The location where crucial information about an Ancient Weapon is discovered"
      },
      {
        "episode": 194,
        "timestamp": "06:30",
        "description": "A Shandian warrior points out Gol D. Roger's message carved into the bell itself",
        "significance": "Reveals that the Pirate King left his mark on this sacred location, connecting it to the greater mystery of One Piece"
      }
    ],
    "geography": {
      "region": "Upper Yard, Skypiea",
      "climate": "Sky Island climate",
      "terrain": "Located at the peak of Giant Jack, above the cloud layer"
    },
    "culturalSignificance": [
      {
        "description": "Sacred symbol of Shandora and the Shandian people's heritage",
        "episode": 194
      },
      {
        "description": "Contains both a Poneglyph and Roger's message, making it crucial to understanding the True History",
        "episode": 194
      }
    ]
  },
  {
    "id": "shandora",
    "names": {
      "primary": "Shandora",
      "japanese": "シャンドラ",
      "romanized": "Shandora",
      "aliases": ["City of Gold", "Golden City"]
    },
    "type": "ANCIENT_RUINS",
    "debut": {
      "episode": 174
    },
    "episodeAppearances": [194],
    "description": "The legendary ancient city of Shandora, also known as the City of Gold. It was blasted into the sky 400 years ago and contains the ruins of an advanced ancient civilization that protected a Poneglyph.",
    "keyEvents": [
      {
        "episode": 194,
        "timestamp": "04:15",
        "description": "The Poneglyph that Shandora protected for centuries is finally read by Robin",
        "significance": "Fulfills the purpose of Shandora's 400-year protection mission"
      },
      {
        "episode": 194,
        "timestamp": "12:00",
        "description": "Robin reveals to the Shandians that their ancestors' duty to protect the Poneglyph has been completed",
        "significance": "Provides closure to Shandora's historical mission and the Shandians' war"
      },
      {
        "episode": 194,
        "timestamp": "14:30",
        "description": "The Shandians present a golden pillar from Shandora to the Straw Hats as thanks",
        "significance": "Represents the friendship between the Straw Hats and the descendants of Shandora"
      }
    ],
    "geography": {
      "region": "Upper Yard, Skypiea (originally Jaya)",
      "climate": "Sky Island climate",
      "terrain": "Ancient ruins with golden structures and artifacts"
    },
    "culturalSignificance": [
      {
        "description": "Ancient civilization that fought to protect the Poneglyph from destruction",
        "episode": 194
      },
      {
        "description": "The City of Gold that has been sought by countless adventurers and pirates",
        "episode": 194
      }
    ],
    "historicalNotes": [
      {
        "episode": 194,
        "note": "Gol D. Roger visited Shandora over twenty years ago and took the Poneglyph's information forward on his journey"
      }
    ]
  }
]
