[
  {
    "id": "theory-ep347-001",
    "title": "Shadows Contain Core Personality Traits",
    "summary": "The fact that Inuppe retained Sanji's chivalry suggests that shadows contain not just memories but fundamental personality traits and core values that define a person.",
    "fullText": "Episode 347 provides important evidence about the nature of shadows in One Piece. When Inuppe, animated by Sanji's shadow, refuses to attack Nami despite direct orders, it demonstrates that shadows contain more than just fighting ability or memories - they retain core personality traits and deeply held values. This suggests that a person's shadow is intrinsically linked to their identity and moral character. This has broader implications for understanding how Gecko Moria's powers work and why certain zombies behave in unexpected ways. It also raises philosophical questions about what makes someone who they are - if your shadow contains your core values, is it truly separate from you? This moment is particularly significant for Sanji's character, showing that his chivalry is so fundamental to his being that even his shadow, separated from his body and placed in a zombie dog-penguin hybrid, cannot violate this principle.",
    "author": "One Piece Community Analysis",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_347",
      "title": "Episode 347 Analysis",
      "platform": "Fandom",
      "accessedAt": "2025-11-24"
    },
    "postedDate": "2008-03-16",
    "episodeRange": [347, 377],
    "minEpisode": 347,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 377
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["sanji", "inuppe", "gecko-moria"],
    "relatedLocations": ["thriller-bark"],
    "relatedEvents": ["ep347-event-001"],
    "tags": ["shadows", "personality", "thriller-bark", "sanji", "chivalry"]
  },
  {
    "id": "theory-ep347-002",
    "title": "Robin's Wing Technique Foreshadows Greater Mobility Powers",
    "summary": "Robin's debut of Cien Fleur: Wing in this episode marks the beginning of her developing more mobility-focused techniques, expanding beyond her primarily combat-oriented abilities.",
    "fullText": "The introduction of Cien Fleur: Wing in Episode 347 represents a significant evolution in Robin's fighting style. Prior to this, most of Robin's Hana Hana no Mi techniques focused on restraining opponents, attacking from a distance, or creating defensive structures. The Wing technique introduces a new dimension - mobility and flight. This suggests that Robin is becoming more creative with her Devil Fruit powers and thinking beyond traditional combat applications. Fans theorize that this technique laid the groundwork for Robin to develop even more mobility and utility-based applications of her power in future arcs. The technique also provides important tactical advantages, allowing her to escape danger, reach high places, and reposition during battle. Some fans speculate that Robin's creativity with her Devil Fruit will continue to grow, potentially leading to even more innovative applications like creating complete body doubles or more complex structures.",
    "author": "One Piece Community Analysis",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_347",
      "title": "Episode 347 - Technique Analysis",
      "platform": "Fandom",
      "accessedAt": "2025-11-24"
    },
    "postedDate": "2008-03-16",
    "episodeRange": [347, 1000],
    "minEpisode": 347,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 347
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["robin"],
    "relatedLocations": ["thriller-bark"],
    "relatedEvents": ["ep347-event-009"],
    "tags": ["robin", "hana-hana-no-mi", "technique-development", "devil-fruit"]
  },
  {
    "id": "theory-ep347-003",
    "title": "Moria's Zombie Army's Critical Weakness",
    "summary": "The incident with Inuppe reveals a fundamental flaw in Gecko Moria's zombie army strategy - shadows with strong personalities or deeply held beliefs can act against the zombies' orders.",
    "fullText": "Episode 347 exposes what could be considered a critical weakness in Gecko Moria's strategy for creating his zombie army. By using the shadows of powerful pirates with strong personalities and deeply held beliefs, Moria may have inadvertently created zombies that can resist orders or act unpredictably. Inuppe's refusal to attack Nami due to Sanji's chivalrous nature demonstrates that the shadows' core personality traits can override the zombie's programming or orders from their commanders. This suggests that Moria's approach of stealing shadows from strong-willed individuals might backfire, as these shadows bring not just combat ability but also unpredictable behavioral traits. A more obedient zombie army might be created using shadows from people with weaker personalities or fewer strongly held beliefs, but this would sacrifice combat effectiveness. This paradox - needing strong shadows for powerful zombies but risking disobedience - represents a significant strategic weakness that the Straw Hats could potentially exploit. It also raises questions about whether Moria fully understands the nature of shadows and their connection to personal identity.",
    "author": "One Piece Community Analysis",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Thriller_Bark_Arc",
      "title": "Thriller Bark Arc - Strategic Analysis",
      "platform": "Fandom",
      "accessedAt": "2025-11-24"
    },
    "postedDate": "2008-03-16",
    "episodeRange": [347, 377],
    "minEpisode": 347,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 377
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["gecko-moria", "inuppe", "sanji"],
    "relatedLocations": ["thriller-bark"],
    "relatedEvents": ["ep347-event-001", "ep347-event-002"],
    "tags": ["gecko-moria", "zombie-army", "thriller-bark", "strategy", "weakness"]
  }
]
