[
  {
    "id": "usopp",
    "name": "Usopp",
    "nameJapanese": "ウソップ",
    "nameRomanized": "Usoppu",
    "aliases": [],
    "debut": {
      "episode": 9,
      "chapter": 23
    },
    "episodeAppearances": [10],
    "status": "ALIVE",
    "affiliations": [
      {
        "name": "Straw Hat Pirates",
        "role": "Ally/Future Member",
        "episodeEstablished": 9
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 10,
        "timestamp": "05:30",
        "title": "Usopp Defends His Father's Honor",
        "description": "When Klahadore insults Yasopp, calling him a worthless pirate who abandoned his family, Usopp becomes enraged and physically attacks the butler. This reveals Usopp's deep emotional connection to his father despite never having grown up with him.",
        "significance": "Shows that beneath Usopp's lies and bravado, he has genuine pride in his father and strong emotional core. His father is his emotional anchor.",
        "spoilerLevel": "MINOR"
      },
      {
        "episodeNumber": 10,
        "timestamp": "09:40",
        "title": "Learning About Yasopp from Luffy",
        "description": "Luffy reveals that he personally knows Usopp's father Yasopp, who is a member of Shanks' Red Hair Pirates. Luffy tells Usopp that Yasopp talks about him constantly and is very proud of his son.",
        "significance": "Validates Usopp's lifelong belief in his father and creates a deeper bond between Usopp and Luffy. This connection to the Red Hair Pirates foreshadows Usopp's future importance.",
        "spoilerLevel": "MAJOR"
      },
      {
        "episodeNumber": 10,
        "timestamp": "13:30",
        "title": "Discovering Kuro's True Identity",
        "description": "Usopp and Luffy overhear Klahadore being addressed as Captain Kuro by Jango, discovering that the butler is actually the infamous pirate who supposedly died three years ago.",
        "significance": "Usopp becomes the first person in the village to learn the truth about Klahadore. This puts him in a unique position where he must convince others despite his reputation as a liar.",
        "spoilerLevel": "CRITICAL"
      },
      {
        "episodeNumber": 10,
        "timestamp": "20:30",
        "title": "Kuro Spares Usopp",
        "description": "After discovering the conspiracy, Kuro decides not to kill Usopp because he believes no one in the village will believe 'the village liar' anyway. Usopp is left alive but faces the challenge of convincing everyone of the truth.",
        "significance": "Sets up Usopp's character arc for the remainder of the Syrup Village arc - he must overcome his reputation as a liar to save Kaya and the village. The boy who cried wolf must now be believed.",
        "spoilerLevel": "MAJOR"
      }
    ],
    "relationships": [
      {
        "characterId": "yasopp",
        "relationType": "FAMILY",
        "description": "Father and son. Yasopp left to become a pirate when Usopp was very young, but Usopp has always been proud of him.",
        "episodeEstablished": 9,
        "episodeEvolved": 10
      },
      {
        "characterId": "luffy",
        "relationType": "FRIEND",
        "description": "Growing friendship strengthened by their shared connection to the Red Hair Pirates through their respective father figures (Yasopp and Shanks).",
        "episodeEstablished": 9,
        "episodeEvolved": 10
      },
      {
        "characterId": "kuro",
        "relationType": "ENEMY",
        "description": "Usopp discovers Kuro's true identity and assassination plot, making him a direct threat to Kuro's plans. Kuro views Usopp with contempt as a harmless liar.",
        "episodeEstablished": 10,
        "episodeEvolved": 10
      }
    ],
    "reveals": [
      {
        "episodeNumber": 10,
        "revealType": "CHARACTER_BACKGROUND",
        "description": "Yasopp is confirmed to be a member of Shanks' Red Hair Pirates and often speaks proudly of his son Usopp to his crewmates.",
        "spoilerLevel": "MAJOR"
      }
    ]
  },
  {
    "id": "kuro",
    "name": "Kuro",
    "nameJapanese": "クロ",
    "nameRomanized": "Kuro",
    "aliases": [
      "Klahadore",
      "Captain Kuro",
      "Kuro of a Hundred Plans"
    ],
    "debut": {
      "episode": 9,
      "chapter": 23
    },
    "episodeAppearances": [10],
    "status": "ALIVE",
    "age": 33,
    "height": "207 cm",
    "affiliations": [
      {
        "name": "Black Cat Pirates",
        "role": "Captain",
        "episodeEstablished": 10
      },
      {
        "name": "Kaya's Household",
        "role": "Butler (undercover)",
        "episodeEstablished": 9
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 10,
        "timestamp": "05:30",
        "title": "Kuro Provokes Usopp",
        "description": "Klahadore deliberately insults Usopp's father Yasopp to provoke a reaction. This calculated cruelty shows his manipulative nature and desire to create conflict.",
        "significance": "Demonstrates Kuro's psychological manipulation tactics and his contempt for others.",
        "spoilerLevel": "MINOR"
      },
      {
        "episodeNumber": 10,
        "timestamp": "07:20",
        "title": "Expelling the Straw Hats",
        "description": "Kuro uses Usopp's attack as justification to permanently expel the Straw Hat crew from the mansion, isolating Kaya from potential allies.",
        "significance": "Shows Kuro's strategic thinking - he turns Usopp's emotional reaction into an opportunity to remove threats to his plan.",
        "spoilerLevel": "MINOR"
      },
      {
        "episodeNumber": 10,
        "timestamp": "13:30",
        "title": "True Identity Revealed to Audience",
        "description": "Klahadore is revealed to be Captain Kuro of the Black Cat Pirates when Jango addresses him by his real name. This is the major twist of the episode.",
        "significance": "Transforms the character from mysterious butler to main arc antagonist. Establishes him as a serious threat with a history of piracy.",
        "spoilerLevel": "CRITICAL"
      },
      {
        "episodeNumber": 10,
        "timestamp": "14:45",
        "title": "Revealing His Escape Method",
        "description": "Kuro explains how he faked his death three years ago by hypnotizing one of his crew members to believe he was Captain Kuro, then sent this lookalike to be executed by the Marines.",
        "significance": "Establishes Kuro's ruthlessness and cunning. He's willing to sacrifice his own crew members for his plans, earning his epithet 'Kuro of a Hundred Plans.'",
        "spoilerLevel": "MAJOR"
      },
      {
        "episodeNumber": 10,
        "timestamp": "16:00",
        "title": "The Assassination Plot Explained",
        "description": "Kuro reveals his complete plan: have Jango hypnotize Kaya into writing a will leaving her fortune to Klahadore, then stage a pirate raid where Kaya dies and he inherits everything.",
        "significance": "Reveals the full scope of Kuro's three-year deception and his willingness to murder an innocent girl for wealth. Shows his motivation is purely greed and desire for a peaceful retirement.",
        "spoilerLevel": "CRITICAL"
      },
      {
        "episodeNumber": 10,
        "timestamp": "20:30",
        "title": "Kuro's Arrogant Decision",
        "description": "Despite knowing Usopp overheard the entire plan, Kuro arrogantly decides not to kill him, believing no one will believe 'the village liar.'",
        "significance": "Shows Kuro's fatal flaw - his overconfidence and underestimation of his opponents. This decision will come back to haunt him.",
        "spoilerLevel": "MAJOR"
      }
    ],
    "abilities": [
      {
        "name": "Strategic Planning",
        "description": "Kuro is known as 'Kuro of a Hundred Plans' for his exceptional ability to create elaborate schemes. His three-year infiltration of Kaya's household demonstrates this skill.",
        "debutEpisode": 10,
        "abilityType": "SKILL"
      },
      {
        "name": "Hand-to-Hand Combat",
        "description": "As a former pirate captain, Kuro possesses significant combat skills, easily deflecting Usopp's attack.",
        "debutEpisode": 10,
        "abilityType": "COMBAT"
      }
    ],
    "relationships": [
      {
        "characterId": "jango",
        "relationType": "ALLY",
        "description": "Jango serves as Kuro's first mate and co-conspirator. He follows Kuro's orders and uses his hypnotic abilities to support Kuro's plans.",
        "episodeEstablished": 10,
        "episodeEvolved": 10
      },
      {
        "characterId": "kaya",
        "relationType": "TARGET",
        "description": "Kuro has spent three years posing as Kaya's butler to gain her trust, all with the ultimate goal of inheriting her fortune after her death.",
        "episodeEstablished": 9,
        "episodeEvolved": 10
      },
      {
        "characterId": "usopp",
        "relationType": "ENEMY",
        "description": "Kuro views Usopp with contempt, both for his lies and his defense of his pirate father. He underestimates Usopp due to his reputation as the village liar.",
        "episodeEstablished": 10,
        "episodeEvolved": 10
      }
    ],
    "reveals": [
      {
        "episodeNumber": 10,
        "revealType": "IDENTITY",
        "description": "Klahadore is revealed to be Captain Kuro of the Black Cat Pirates, a pirate who supposedly died three years ago.",
        "spoilerLevel": "CRITICAL"
      },
      {
        "episodeNumber": 10,
        "revealType": "BACKSTORY",
        "description": "Kuro faked his death by hypnotizing one of his crew members to take his place and be executed by the Marines.",
        "spoilerLevel": "MAJOR"
      },
      {
        "episodeNumber": 10,
        "revealType": "MOTIVATION",
        "description": "Kuro's entire plan is motivated by greed - he wants to inherit Kaya's fortune so he can retire in wealth and peace.",
        "spoilerLevel": "MAJOR"
      }
    ]
  },
  {
    "id": "jango",
    "name": "Jango",
    "nameJapanese": "ジャンゴ",
    "nameRomanized": "Jango",
    "aliases": [
      "Django"
    ],
    "debut": {
      "episode": 9,
      "chapter": 25
    },
    "episodeAppearances": [10],
    "status": "ALIVE",
    "height": "207 cm",
    "affiliations": [
      {
        "name": "Black Cat Pirates",
        "role": "First Mate/Hypnotist",
        "episodeEstablished": 10
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 10,
        "timestamp": "12:15",
        "title": "Secret Meeting with Kuro",
        "description": "Jango meets with Kuro at the base of the cliff to discuss their assassination plan, revealing his role as Kuro's lieutenant and co-conspirator.",
        "significance": "Establishes Jango as Kuro's right-hand man and a major antagonist in the arc.",
        "spoilerLevel": "MAJOR"
      },
      {
        "episodeNumber": 10,
        "timestamp": "17:30",
        "title": "Reports on Black Cat Pirates' Readiness",
        "description": "Jango informs Kuro that the Black Cat Pirates and their ship are stationed at the northern shore, ready to attack the village on command.",
        "significance": "Confirms that the threat is immediate and real - the pirate crew is already in position.",
        "spoilerLevel": "MAJOR"
      },
      {
        "episodeNumber": 10,
        "timestamp": "19:10",
        "title": "Demonstrating Hypnotic Powers",
        "description": "Jango uses his signature hypnosis technique for the first time on screen, chanting 'One, Two, Jango!' while swinging his chakram pendulum to instantly put Luffy to sleep.",
        "significance": "First full demonstration of Jango's supernatural hypnotic abilities, which will be a major threat throughout the arc.",
        "spoilerLevel": "MAJOR"
      },
      {
        "episodeNumber": 10,
        "timestamp": "19:45",
        "title": "Causing Luffy to Fall",
        "description": "After hypnotizing Luffy to sleep, Jango causes him to fall headfirst off the cliff, demonstrating his willingness to kill.",
        "significance": "Shows that Jango and Kuro are deadly serious and willing to murder to protect their plan.",
        "spoilerLevel": "MAJOR"
      }
    ],
    "abilities": [
      {
        "name": "Hypnotism",
        "description": "Jango's signature ability. By swinging his heart-shaped chakram pendulum and chanting 'One, Two, Jango!', he can hypnotize people into sleep or make them follow commands. This ability was used to help Kuro fake his death three years ago.",
        "debutEpisode": 9,
        "demonstratedEpisode": 10,
        "abilityType": "SUPERNATURAL"
      },
      {
        "name": "Chakram Combat",
        "description": "Jango uses his chakram as both a hypnotic tool and a weapon.",
        "debutEpisode": 10,
        "abilityType": "WEAPON"
      }
    ],
    "relationships": [
      {
        "characterId": "kuro",
        "relationType": "ALLY",
        "description": "Jango serves as Captain Kuro's loyal first mate and follows his orders without question. He was instrumental in helping Kuro fake his death three years ago.",
        "episodeEstablished": 10,
        "episodeEvolved": 10
      },
      {
        "characterId": "luffy",
        "relationType": "ENEMY",
        "description": "After discovering that Luffy overheard their plan, Jango hypnotizes him and causes him to fall off a cliff.",
        "episodeEstablished": 10,
        "episodeEvolved": 10
      }
    ],
    "reveals": [
      {
        "episodeNumber": 10,
        "revealType": "ABILITY",
        "description": "Jango's hypnotic powers are demonstrated for the first time, showing he can instantly put people to sleep with his chakram pendulum and chant.",
        "spoilerLevel": "MAJOR"
      },
      {
        "episodeNumber": 10,
        "revealType": "AFFILIATION",
        "description": "Jango is confirmed to be the first mate of the Black Cat Pirates and Kuro's loyal subordinate.",
        "spoilerLevel": "MAJOR"
      }
    ]
  },
  {
    "id": "luffy",
    "name": "Monkey D. Luffy",
    "nameJapanese": "モンキー・D・ルフィ",
    "nameRomanized": "Monkī Dī Rufi",
    "aliases": [
      "Straw Hat Luffy"
    ],
    "debut": {
      "episode": 1,
      "chapter": 1
    },
    "episodeAppearances": [10],
    "status": "ALIVE",
    "keyMoments": [
      {
        "episodeNumber": 10,
        "timestamp": "09:40",
        "title": "Revealing Knowledge of Yasopp",
        "description": "Luffy tells Usopp that he personally knows his father Yasopp, who is a member of Shanks' Red Hair Pirates. He explains that Yasopp would talk about Usopp constantly and is very proud of his son.",
        "significance": "Strengthens the bond between Luffy and Usopp through their shared connection to the Red Hair Pirates. Shows Luffy's emotional intelligence and ability to comfort others.",
        "spoilerLevel": "MAJOR"
      },
      {
        "episodeNumber": 10,
        "timestamp": "13:30",
        "title": "Discovering Kuro's Conspiracy",
        "description": "While sitting on the cliff with Usopp, Luffy overhears Kuro and Jango's conversation and learns about the assassination plot against Kaya.",
        "significance": "Luffy gains crucial intelligence about the villains' plan, setting up the conflict for the rest of the arc.",
        "spoilerLevel": "MAJOR"
      },
      {
        "episodeNumber": 10,
        "timestamp": "19:45",
        "title": "Hypnotized and Falls Off Cliff",
        "description": "Jango uses his hypnotic powers to put Luffy to sleep, causing him to fall headfirst off the cliff toward the rocks below.",
        "significance": "Creates a cliffhanger and demonstrates that even Luffy is vulnerable to certain types of attacks. Shows the real danger posed by the villains.",
        "spoilerLevel": "MAJOR"
      }
    ],
    "relationships": [
      {
        "characterId": "usopp",
        "relationType": "FRIEND",
        "description": "Luffy's friendship with Usopp deepens as he shares information about Yasopp, creating a bond through their connection to the Red Hair Pirates.",
        "episodeEstablished": 9,
        "episodeEvolved": 10
      },
      {
        "characterId": "yasopp",
        "relationType": "ACQUAINTANCE",
        "description": "Luffy knows Yasopp from his time with Shanks' crew. Yasopp would often tell stories about his son Usopp.",
        "episodeEstablished": 10,
        "episodeEvolved": 10
      }
    ]
  },
  {
    "id": "yasopp",
    "name": "Yasopp",
    "nameJapanese": "ヤソップ",
    "nameRomanized": "Yasoppu",
    "aliases": [],
    "debut": {
      "episode": 4,
      "chapter": 1
    },
    "episodeAppearances": [10],
    "status": "ALIVE",
    "affiliations": [
      {
        "name": "Red Hair Pirates",
        "role": "Sniper",
        "episodeEstablished": 4
      }
    ],
    "relationships": [
      {
        "characterId": "usopp",
        "relationType": "FAMILY",
        "description": "Yasopp is Usopp's father. Despite leaving when Usopp was young to join Shanks' crew, Yasopp remains proud of his son and talks about him constantly to his crewmates.",
        "episodeEstablished": 9,
        "episodeEvolved": 10
      },
      {
        "characterId": "luffy",
        "relationType": "ACQUAINTANCE",
        "description": "Luffy knows Yasopp from his time with Shanks. Yasopp told Luffy stories about his son Usopp.",
        "episodeEstablished": 10,
        "episodeEvolved": 10
      }
    ],
    "reveals": [
      {
        "episodeNumber": 10,
        "revealType": "CHARACTER_BACKGROUND",
        "description": "It's revealed that Yasopp frequently talks about his son Usopp to his crewmates on the Red Hair Pirates, showing pride in his son despite being absent.",
        "spoilerLevel": "MAJOR"
      }
    ]
  }
]
