[
  {
    "id": "theory-ep010-001",
    "title": "Kuro's Plan Was Too Perfect to Fail",
    "theory": "Many fans have theorized that Kuro's three-year plan to infiltrate Kaya's household was nearly foolproof. If not for pure chance - Luffy and Usopp randomly being on the cliff at the exact moment of his meeting with Jango - the plan would have succeeded completely. This demonstrates that Kuro truly earned his epithet 'Kuro of a Hundred Plans' and that luck is often as important as strength in the One Piece world.",
    "author": "One Piece Fan Community",
    "sourceUrl": null,
    "platform": "GENERAL_FANDOM",
    "dateProposed": null,
    "episodeSpan": [9, 10, 11, 12, 13, 14, 15],
    "spoilerLevel": "ARC_SPECIFIC",
    "status": "CANON_SUPPORTED",
    "popularity": "MODERATE",
    "evidenceForTheory": [
      "Kuro's plan had contingencies at every level - fake death, three-year infiltration, hypnosis backup",
      "The only reason the plan failed was random chance - the heroes happened to be in the right place at the right time",
      "Kuro's arrogance in letting Usopp live nearly worked, as no one initially believed him"
    ],
    "evidenceAgainstTheory": [
      "Kuro underestimated the Straw Hats' determination and combat ability",
      "His plan required him to personally stay in one location for three years, limiting his options"
    ]
  },
  {
    "id": "theory-ep010-002",
    "title": "Yasopp Knows About Luffy Meeting Usopp",
    "theory": "Some fans theorize that Yasopp specifically told Luffy detailed stories about Usopp because he knew or hoped that Luffy might meet his son someday. Yasopp's constant talking about Usopp to Shanks' crew seems intentional, as if he wanted to ensure that if any of them ever encountered Usopp, they would recognize and help him. This theory suggests Yasopp has been keeping tabs on Usopp from afar.",
    "author": "One Piece Fan Community",
    "sourceUrl": null,
    "platform": "GENERAL_FANDOM",
    "dateProposed": null,
    "episodeSpan": [4, 10],
    "spoilerLevel": "MAJOR",
    "status": "SPECULATION",
    "popularity": "MODERATE",
    "evidenceForTheory": [
      "Luffy immediately recognized Usopp's name and knew details about him",
      "Yasopp talked about Usopp 'constantly' according to Luffy, which seems excessive unless intentional",
      "The Red Hair Pirates are known to move through the East Blue"
    ],
    "evidenceAgainstTheory": [
      "Yasopp might simply be a proud father who can't help but talk about his son",
      "No evidence suggests Yasopp knew Luffy would become a pirate and meet Usopp"
    ]
  },
  {
    "id": "theory-ep010-003",
    "title": "The Village Liar Trope as Thematic Setup",
    "theory": "Fans have noted that the 'boy who cried wolf' setup with Usopp in Episode 10 serves as thematic foreshadowing for the entire series. Throughout One Piece, truth and lies, belief and doubt, become central themes. Usopp's role as the liar who must be believed when telling the truth parallels larger narrative arcs where the 'official truth' (like the World Government's version of history) is actually the lie, and the 'crazy stories' (like Void Century theories) turn out to be true.",
    "author": "One Piece Analysis Community",
    "sourceUrl": null,
    "platform": "GENERAL_FANDOM",
    "dateProposed": null,
    "episodeSpan": [9, 10, 11, 12],
    "spoilerLevel": "MAJOR",
    "status": "THEMATIC_ANALYSIS",
    "popularity": "HIGH",
    "evidenceForTheory": [
      "The series repeatedly questions official narratives versus hidden truths",
      "Usopp's lies often foreshadow real events that happen later",
      "The theme of belief versus skepticism runs throughout One Piece"
    ],
    "evidenceAgainstTheory": [
      "This may be reading too much into a simple character setup",
      "Usopp's arc may be more about personal courage than epistemological themes"
    ]
  },
  {
    "id": "theory-ep010-004",
    "title": "Kuro's Hypnotized Crewmate's Fate",
    "theory": "The revelation that Kuro hypnotized one of his crew members to impersonate him and be executed by the Marines has led to fan theories about whether this crew member is truly dead. Some fans speculate that the hypnotized pirate might have survived execution somehow, or that this event is what caused Morgan to become the brutal Marine he is (Morgan is mentioned as the 'badly maimed Marine' who captured 'Kuro'). This theory explores the long-term consequences of Kuro's deception.",
    "author": "One Piece Fan Community",
    "sourceUrl": null,
    "platform": "GENERAL_FANDOM",
    "dateProposed": null,
    "episodeSpan": [10],
    "spoilerLevel": "MAJOR",
    "status": "SPECULATION",
    "popularity": "LOW",
    "evidenceForTheory": [
      "Morgan was involved in 'Kuro's' capture and may have been traumatized by the event",
      "The hypnotized crew member's fate is never explicitly confirmed",
      "One Piece often revisits seemingly minor plot points years later"
    ],
    "evidenceAgainstTheory": [
      "The crew member was stated to be executed, which is pretty definitive",
      "This plot point seems designed to show Kuro's ruthlessness, not set up future storylines"
    ]
  },
  {
    "id": "theory-ep010-005",
    "title": "Jango's Hypnotism Limits and Strategy",
    "theory": "Fans have theorized about the limitations of Jango's hypnotic abilities based on his actions in Episode 10. The fact that he hypnotized Luffy to sleep rather than commanding him to 'not move' or 'forget what you heard' suggests that his hypnosis may only work for simple, immediate commands. This theory attempts to explain the tactical limits of what appears to be an overpowered ability.",
    "author": "One Piece Power Scaling Community",
    "sourceUrl": null,
    "platform": "GENERAL_FANDOM",
    "dateProposed": null,
    "episodeSpan": [10, 11, 12, 13, 14],
    "spoilerLevel": "MINOR",
    "status": "SPECULATION",
    "popularity": "MODERATE",
    "evidenceForTheory": [
      "Jango chose 'sleep' rather than more strategic commands",
      "His hypnosis seems to work best on simple, direct commands",
      "The ability would be too powerful without limitations"
    ],
    "evidenceAgainstTheory": [
      "Jango may have simply chosen the quickest option in the moment",
      "Later episodes may show more complex uses of his hypnosis"
    ]
  }
]
