[
  {
    "id": "syrup-village-cliff",
    "name": "Syrup Village Cliff",
    "nameJapanese": "シロップ村の崖",
    "nameRomanized": "Shiroppu Mura no Gake",
    "aliases": [
      "The Cliff",
      "Northern Cliff"
    ],
    "debut": {
      "episode": 10,
      "chapter": 25
    },
    "episodeAppearances": [10],
    "locationType": "NATURAL_LANDMARK",
    "region": "East Blue",
    "island": "Syrup Village",
    "description": "A tall cliff overlooking the ocean on the northern side of Syrup Village. The cliff provides a panoramic view of the sea and has a secluded area at its base.",
    "keyEvents": [
      {
        "episodeNumber": 10,
        "timestamp": "09:40",
        "title": "Luffy and Usopp's Heart-to-Heart",
        "description": "Luffy and Usopp sit on top of the cliff, where Luffy reveals that he knows Usopp's father Yasopp from Shanks' crew. This emotional bonding moment strengthens their friendship.",
        "significance": "The cliff serves as a location for character development and an important reveal about Usopp's father.",
        "spoilerLevel": "MAJOR"
      },
      {
        "episodeNumber": 10,
        "timestamp": "12:15",
        "title": "Kuro and Jango's Secret Meeting",
        "description": "At the base of the cliff, Kuro (as Klahadore) secretly meets with Jango to discuss their assassination plot. They believe they are alone and speak freely about their plan.",
        "significance": "The cliff's secluded base location makes it perfect for villains to have secret meetings, but its height allows Luffy and Usopp to overhear from above.",
        "spoilerLevel": "CRITICAL"
      },
      {
        "episodeNumber": 10,
        "timestamp": "13:30",
        "title": "Kuro's Identity Revealed",
        "description": "While meeting at the cliff base, Jango addresses Klahadore as 'Captain Kuro,' and the two villains discuss their plan to assassinate Kaya. Luffy and Usopp overhear this from the top of the cliff.",
        "significance": "The cliff becomes the location of the arc's major plot reveal - Klahadore's true identity as Captain Kuro.",
        "spoilerLevel": "CRITICAL"
      },
      {
        "episodeNumber": 10,
        "timestamp": "19:45",
        "title": "Luffy Falls from the Cliff",
        "description": "After being hypnotized by Jango, Luffy falls headfirst off the cliff toward the rocks below, creating a dangerous cliffhanger situation.",
        "significance": "The cliff's height creates peril for Luffy and demonstrates the villains' willingness to kill.",
        "spoilerLevel": "MAJOR"
      }
    ],
    "inhabitants": [],
    "controlledBy": null,
    "status": "INTACT",
    "strategicImportance": "The cliff overlooks the northern shore where the Black Cat Pirates' ship is stationed, making it a strategic vantage point for observing enemy movements."
  },
  {
    "id": "kaya-mansion",
    "name": "Kaya's Mansion",
    "nameJapanese": "カヤの屋敷",
    "nameRomanized": "Kaya no Yashiki",
    "aliases": [
      "Kaya's Estate",
      "The Mansion"
    ],
    "debut": {
      "episode": 9,
      "chapter": 24
    },
    "episodeAppearances": [10],
    "locationType": "RESIDENCE",
    "region": "East Blue",
    "island": "Syrup Village",
    "description": "A large, wealthy mansion that formerly belonged to Kaya's parents. After their death, Kaya inherited the estate along with her family's fortune.",
    "keyEvents": [
      {
        "episodeNumber": 10,
        "timestamp": "03:15",
        "title": "Straw Hats Request Ship",
        "description": "The Straw Hat crew approaches Klahadore at the mansion to request a ship for their journey, but he refuses and reacts with hostility.",
        "significance": "Shows the mansion as a location of conflict between the crew and Klahadore.",
        "spoilerLevel": "MINOR"
      },
      {
        "episodeNumber": 10,
        "timestamp": "05:30",
        "title": "Klahadore Insults Yasopp",
        "description": "At the mansion's entrance, Klahadore deliberately provokes Usopp by insulting his father Yasopp, triggering an angry response.",
        "significance": "The mansion becomes a site of confrontation between Klahadore and Usopp.",
        "spoilerLevel": "MINOR"
      },
      {
        "episodeNumber": 10,
        "timestamp": "07:20",
        "title": "Crew Expelled from Mansion",
        "description": "Klahadore orders the Straw Hat crew and Usopp to leave the mansion grounds and never return, isolating Kaya from potential allies.",
        "significance": "The expulsion from the mansion makes it harder for the heroes to protect Kaya from Kuro's plot.",
        "spoilerLevel": "MINOR"
      }
    ],
    "inhabitants": [
      "Kaya",
      "Kuro (as Klahadore)",
      "Merry"
    ],
    "controlledBy": "Kaya (owner), though Kuro exerts significant control as butler",
    "status": "INTACT"
  },
  {
    "id": "syrup-village",
    "name": "Syrup Village",
    "nameJapanese": "シロップ村",
    "nameRomanized": "Shiroppu Mura",
    "aliases": [],
    "debut": {
      "episode": 9,
      "chapter": 23
    },
    "episodeAppearances": [10],
    "locationType": "VILLAGE",
    "region": "East Blue",
    "description": "A peaceful village in the East Blue where Usopp and Kaya live. The village is currently under threat from the Black Cat Pirates.",
    "keyEvents": [
      {
        "episodeNumber": 10,
        "timestamp": "17:30",
        "title": "Black Cat Pirates Position for Attack",
        "description": "Jango reveals that the Black Cat Pirates' ship is stationed at the northern shore of Syrup Village, ready to attack when ordered.",
        "significance": "The entire village is now in danger of being massacred as part of Kuro's assassination plan.",
        "spoilerLevel": "MAJOR"
      }
    ],
    "status": "INTACT",
    "strategicImportance": "Target of the Black Cat Pirates' planned attack as cover for assassinating Kaya."
  }
]
