[
  {
    "name": {
      "english": "Mark-Mark Fruit",
      "japanese": "マトマトの実",
      "romanized": "Mato Mato no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 532,
    "debutChapter": 613,
    "episodeAppearances": [532],
    "currentUser": {
      "characterId": "vander-decken-ix",
      "episodeConsumed": null,
      "status": "ACTIVE"
    },
    "previousUsers": [],
    "abilities": [
      {
        "abilityName": "Target Lock",
        "description": "The user can mark targets by touching them with their bare hands. Once marked, any object thrown by the user with the same hand will automatically lock onto and chase the marked target until it hits them or is stopped by an obstacle.",
        "episodeFirstRevealed": 532,
        "limitations": [
          "The user must touch the target with their bare hand to mark them",
          "The user can only mark targets with their palms",
          "Once marked, the target remains marked until the user touches a new target with that hand",
          "The user cannot swim due to standard Devil Fruit weakness"
        ]
      },
      {
        "abilityName": "Multi-Target Marking",
        "description": "The user can mark different targets with their right and left hands, allowing them to throw objects at two different targets simultaneously.",
        "episodeFirstRevealed": 532,
        "limitations": [
          "Limited to two targets maximum (one per hand)"
        ]
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 532,
        "eventId": "ep532-event-001",
        "momentType": "POWER_REVEAL",
        "title": "Mark-Mark Fruit Powers Demonstrated",
        "description": "Vander Decken IX demonstrates the Mato Mato no Mi's power by throwing a giant axe that automatically targets and chases Princess Shirahoshi through the water.",
        "significance": "First demonstration of the fruit's targeting ability and the threat it poses.",
        "timestamp": "03:15"
      },
      {
        "episodeNumber": 532,
        "eventId": "ep532-event-014",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "Decken Wears Glove to Prevent Marking",
        "description": "When forming an alliance with Hody Jones, Vander Decken puts on a glove before shaking hands to avoid marking Hody with his Devil Fruit power.",
        "significance": "Reveals the limitation and precaution needed when using the Mark-Mark Fruit in social situations.",
        "timestamp": "23:00"
      }
    ],
    "awakening": {
      "isAwakened": false,
      "episodeAwakened": null,
      "awakenedAbilities": []
    },
    "trivia": [
      {
        "fact": "The Mato Mato no Mi is one of the rare Devil Fruits consumed by a fish-man, which is particularly dangerous since fish-men who eat Devil Fruits lose their natural swimming ability.",
        "category": "GENERAL"
      },
      {
        "fact": "The fruit's name 'Mato' comes from the Japanese word for 'target' or 'mark'.",
        "category": "ETYMOLOGY"
      },
      {
        "fact": "Vander Decken has had Shirahoshi marked for over 10 years, suggesting the mark does not fade over time.",
        "category": "ABILITY"
      }
    ]
  }
]
