[
  {
    "name": {
      "english": "Love-Love Fruit",
      "japanese": "メロメロの実",
      "romanized": "Mero Mero no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 410,
    "debutChapter": 516,
    "episodeAppearances": [410],
    "currentUser": {
      "characterId": "boa-hancock",
      "episodeObtained": null,
      "episodeLost": null,
      "status": "ACTIVE"
    },
    "previousUsers": [],
    "abilities": [
      {
        "abilityName": "Mero Mero Mellow",
        "description": "The user forms a heart shape with their hands and fires heart-shaped beams that petrify anyone who is attracted to the user. Victims are turned into stone statues.",
        "episodeFirstUsed": 410,
        "limitations": "Only affects those who feel attraction or lust toward the user. Can be resisted by those with pure hearts, no attraction, or who override the attraction with other strong emotions like pain or fear."
      },
      {
        "abilityName": "Petrification",
        "description": "The core ability of the fruit - transforming those attracted to the user into stone through emotions of love, lust, or adoration.",
        "episodeFirstUsed": 410,
        "limitations": "Effectiveness depends on the target's emotional state and attraction level. Blind individuals or those who cannot see the user's beauty are immune."
      }
    ],
    "awakening": {
      "isAwakened": false,
      "awakeningEpisode": null,
      "awakeningAbilities": []
    },
    "keyMoments": [
      {
        "episodeNumber": 410,
        "eventId": "ep410-event-007",
        "momentType": "POWER_REVEAL",
        "title": "Mero Mero Mellow Debut",
        "description": "Hancock uses her Mero Mero no Mi power for the first time in the series, demonstrating the Mero Mero Mellow technique to petrify Momonga's entire crew.",
        "significance": "First demonstration of the Love-Love Fruit's devastating ability and its unique emotion-based mechanics.",
        "timestamp": "15:20"
      },
      {
        "episodeNumber": 410,
        "eventId": "ep410-event-008",
        "momentType": "POWER_REVEAL",
        "title": "Weakness Revealed - Pain Resistance",
        "description": "Momonga stabs his own hand to resist Hancock's powers, revealing that the fruit's effectiveness can be overcome through pain or other strong emotions that override attraction.",
        "significance": "Establishes a critical weakness of the Mero Mero no Mi - its dependence on the victim's emotional state.",
        "timestamp": "16:45"
      }
    ],
    "weaknesses": [
      {
        "weakness": "Requires victim to feel attraction or lust toward the user",
        "episodeRevealed": 410
      },
      {
        "weakness": "Can be resisted through pain, fear, or other strong emotions that override attraction",
        "episodeRevealed": 410
      },
      {
        "weakness": "Standard Devil Fruit weaknesses (seawater, Seastone, inability to swim)",
        "episodeRevealed": 410
      }
    ],
    "trivia": [
      "The name 'Mero Mero' is Japanese onomatopoeia for being lovestruck or head-over-heels in love",
      "This is one of the few Devil Fruits whose effectiveness is based on emotional states rather than physical attributes",
      "The fruit's powers have similarities to the Greek mythological figure Medusa, who could turn people to stone with her gaze"
    ]
  }
]
