[
  {
    "id": "theory-ep410-001",
    "title": "Mero Mero no Mi is Actually a Mythical Zoan - Medusa Model",
    "theoryText": "A popular theory suggests the Mero Mero no Mi might not be a true Paramecia, but could actually be the Hito Hito no Mi, Model: Medusa or Gorgon. Evidence includes: (1) Both of Hancock's sisters possess Snake Zoan Devil Fruits, making it strange that she was fed a Paramecia, (2) Hancock's Devil Fruit and snake theme are reflective of the Greek mythical character Medusa, who endured abuse before being turned into a snake-haired monster with the ability to turn anyone who looks into her eyes into stone, (3) Similar to how Luffy's Gomu Gomu no Mi turned out to be the Hito Hito no Mi, Model: Nika after his Awakening, it's now possible for Oda to hide the true nature of a character's Devil Fruit.",
    "author": "One Piece Community",
    "source": {
      "url": "https://gamerant.com/one-piece-mero-mero-no-mi-mythical-zoan-gorgon-medusa/",
      "platform": "GameRant",
      "publishDate": null
    },
    "episodesReferenced": [410],
    "minEpisode": 410,
    "spoilerStatus": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 1100,
      "spoilerDescription": "References Gear 5 and Luffy's fruit reveal from much later episodes"
    },
    "popularity": {
      "upvotes": null,
      "engagement": "HIGH"
    },
    "status": "UNCONFIRMED",
    "tags": ["devil-fruit", "hancock", "mero-mero-no-mi", "mythical-zoan"]
  },
  {
    "id": "theory-ep410-002",
    "title": "Blackbeard Wants Hancock's Fruit to Kill Immortals",
    "theoryText": "Some fans theorize that Blackbeard's interest in Hancock's Mero Mero no Mi might stem from the fruit's unique ability to turn people into stone—an ability that could theoretically bypass conventional defenses. Characters who received the 'immortality surgery' from the Ope Ope no Mi might only be susceptible to unique forms of attack, and if the Mero Mero no Mi can turn even such people to stone, it could theoretically 'kill' immortals by trapping them eternally in stone.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://fandomwire.com/one-piece-theory-blackbeard-wants-boa-hancocks-mero-mero-no-mi-to-unlock-an-army-of-giants-from-cryo-sleep/",
      "platform": "FandomWire",
      "publishDate": null
    },
    "episodesReferenced": [410],
    "minEpisode": 410,
    "spoilerStatus": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 1000,
      "spoilerDescription": "References Blackbeard's later pursuit of Hancock and immortality surgery concepts"
    },
    "popularity": {
      "upvotes": null,
      "engagement": "MEDIUM"
    },
    "status": "UNCONFIRMED",
    "tags": ["blackbeard", "mero-mero-no-mi", "immortality", "ope-ope-no-mi"]
  },
  {
    "id": "theory-ep410-003",
    "title": "Hancock Will Help Luffy Reach Ace",
    "theoryText": "After episode 410 where Hancock refuses the Marine summons, fans theorized that 'Luffy will learn of Ace's execution and will need to get there ASAP. Hancock will probably give him a ride when she decides she must accept the WG's invitation to war for the sake of the Kuja.' This prediction suggested Hancock would eventually change her mind and use the war summons as an opportunity to help Luffy.",
    "author": "Never Watched One Piece (Tumblr blogger)",
    "source": {
      "url": "https://neverwatchedonepiece.tumblr.com/post/137511109659/410-411-everyone-falls-in-love-pirate-empress",
      "platform": "Tumblr",
      "publishDate": "2016"
    },
    "episodesReferenced": [410, 411],
    "minEpisode": 410,
    "spoilerStatus": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 421,
      "spoilerDescription": "Theory about future events in the Amazon Lily arc and Hancock's decision"
    },
    "popularity": {
      "upvotes": null,
      "engagement": "LOW"
    },
    "status": "CONFIRMED",
    "tags": ["hancock", "ace", "amazon-lily", "prediction"]
  },
  {
    "id": "theory-ep410-004",
    "title": "Hancock's Beauty is Supernaturally Enhanced by Her Devil Fruit",
    "theoryText": "There's ongoing discussion about whether Hancock's ability to make people fall in love regardless of age and gender is naturally impossible without some sort of technique. Some fans theorize that while it has never been stated that the Mero Mero no Mi has inherent charming powers, the fruit itself might passively enhance her beauty or attractiveness to make her Devil Fruit more effective. However, there is nothing to disprove it, and there's no conclusive evidence other than speculation, so this should be considered theory rather than fact.",
    "author": "One Piece Wiki Discussion Forum",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Talk:Mero_Mero_no_Mi",
      "platform": "Fandom",
      "publishDate": null
    },
    "episodesReferenced": [410],
    "minEpisode": 410,
    "spoilerStatus": {
      "containsSpoilers": false,
      "maxEpisodeSpoiler": 410,
      "spoilerDescription": "Only discusses information revealed in episode 410"
    },
    "popularity": {
      "upvotes": null,
      "engagement": "MEDIUM"
    },
    "status": "UNCONFIRMED",
    "tags": ["hancock", "mero-mero-no-mi", "beauty", "devil-fruit-mechanics"]
  }
]
