[
  {
    "id": "yuba",
    "name": {
      "english": "Yuba",
      "japanese": "ユバ",
      "romanized": "Yuba"
    },
    "type": "TOWN",
    "debutEpisode": 104,
    "debutChapter": 165,
    "episodeAppearances": [104],
    "parentLocation": "arabasta",
    "description": "A once-prosperous oasis town in Arabasta that has been devastated by endless sandstorms. The oasis has nearly dried up, leaving the town in ruins with only Toto remaining to search for water.",
    "keyEvents": [
      {
        "episodeNumber": 104,
        "eventId": "ep104-event-001",
        "title": "Straw Hats Arrive at Yuba",
        "description": "The Straw Hat Pirates discover Yuba has been devastated by sandstorms and the rebel army has left.",
        "timestamp": "03:00"
      },
      {
        "episodeNumber": 104,
        "eventId": "ep104-event-012",
        "title": "Luffy vs. Vivi Confrontation",
        "description": "The location of the emotional confrontation between Luffy and Vivi about the meaning of comradeship.",
        "timestamp": "22:30"
      }
    ],
    "currentStatus": "ABANDONED",
    "statusHistory": [
      {
        "status": "RUINED",
        "episodeStart": 104,
        "description": "Town devastated by artificial sandstorms caused by Crocodile's scheme"
      }
    ],
    "significance": "Former base of the rebel army and symbol of the devastation caused by Crocodile's manipulation of Arabasta's climate.",
    "culturalNotes": "Yuba was planned to be a major commercial intersection where merchants would come and go, representing the dreams and ambitions of Arabasta's people before Crocodile's interference.",
    "images": [],
    "trivia": [
      "Toto continues to dig for water alone despite the town being abandoned by everyone else",
      "The rebel army relocated from Yuba to Katorea before the Straw Hats arrived"
    ]
  },
  {
    "id": "rain-dinners",
    "name": {
      "english": "Rain Dinners",
      "japanese": "レインディナーズ",
      "romanized": "Rein Dināzu"
    },
    "type": "CASINO",
    "debutEpisode": 104,
    "debutChapter": 165,
    "episodeAppearances": [104],
    "parentLocation": "rainbase",
    "description": "A luxurious casino in Rainbase owned by Crocodile. It serves as the secret headquarters for Baroque Works and contains a hidden basement where the organization's officer agents meet.",
    "keyEvents": [
      {
        "episodeNumber": 104,
        "eventId": "ep104-event-005",
        "title": "Baroque Works Officer Agents Meeting",
        "description": "The officer agents gather at Rain Dinners for a secret meeting with their boss.",
        "timestamp": "12:00"
      },
      {
        "episodeNumber": 104,
        "eventId": "ep104-event-006",
        "title": "Crocodile Reveals Himself as Mr. 0",
        "description": "The location where Crocodile reveals his identity to the officer agents.",
        "timestamp": "14:30"
      },
      {
        "episodeNumber": 104,
        "eventId": "ep104-event-009",
        "title": "Mr. 3's Execution",
        "description": "Crocodile executes Mr. 3 by throwing him into a Bananawani pit.",
        "timestamp": "19:30"
      }
    ],
    "currentStatus": "OPERATIONAL",
    "statusHistory": [
      {
        "status": "OPERATIONAL",
        "episodeStart": 104,
        "description": "Functioning as Crocodile's casino and Baroque Works headquarters"
      }
    ],
    "significance": "Secret headquarters of Baroque Works where Crocodile plans Operation Utopia and coordinates his scheme to overthrow Arabasta.",
    "culturalNotes": "The casino serves as a front for Crocodile's criminal operations while also generating income and maintaining his public image as a hero of Arabasta.",
    "images": [],
    "trivia": [
      "Contains a pit of Bananawani (giant crocodiles with banana-shaped growths on their heads) that Crocodile uses for executions"
    ]
  }
]
