[
  {
    "name": {
      "english": "Cat-Cat Fruit, Model: Leopard",
      "japanese": "ネコネコの実 モデル豹",
      "romanized": "Neko Neko no Mi, Moderu: Hyō"
    },
    "type": "ZOAN",
    "debutEpisode": 246,
    "debutChapter": 349,
    "description": "A Zoan-type Devil Fruit that allows its user to transform into a leopard and a leopard-human hybrid at will, making the user a Leopard Human. The fruit grants the user dramatically increased physical strength, speed, and agility in hybrid and full leopard forms, along with retractable claws, powerful jaws, enhanced senses, and superior climbing and jumping abilities.",
    "episodeAppearances": [246],
    "users": [
      {
        "characterId": "rob-lucci",
        "episodeStart": 246,
        "episodeEnd": "present",
        "circumstances": "Lucci ate the fruit at some point before joining CP9. He reveals his transformation ability in Episode 246 during the attack on Galley-La headquarters."
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Leopard Transformation",
        "episodeRevealed": 246,
        "description": "User transforms into a leopard-human hybrid, gaining enhanced physical abilities including increased strength, speed, sharp claws, and fangs.",
        "severity": "CRITICAL",
        "firstUseContext": "Rob Lucci transforms into his leopard form to defeat the Straw Hat pirates at the Galley-La headquarters, easily overpowering Luffy, Zoro, and Nami."
      },
      {
        "abilityName": "Enhanced Physical Strength",
        "episodeRevealed": 246,
        "description": "The leopard form grants a dramatic increase to physical strength, allowing the user to easily overpower opponents and send them flying with single strikes.",
        "severity": "MAJOR",
        "firstUseContext": "Lucci uses his enhanced strength to defeat both Luffy and Zoro simultaneously, sending them into the sea."
      },
      {
        "abilityName": "Enhanced Speed and Agility",
        "episodeRevealed": 246,
        "description": "The leopard form provides superior speed and agility, making the user a deadly predator in combat.",
        "severity": "MAJOR",
        "firstUseContext": "Lucci swiftly moves through the battle, quickly dispatching multiple opponents before they can effectively counter."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim and weakness to seawater",
        "episodeRevealed": 246,
        "severity": "MAJOR"
      },
      {
        "weakness": "Standard Devil Fruit weakness - vulnerability to Seastone",
        "episodeRevealed": 246,
        "severity": "MAJOR"
      }
    ],
    "strengths": [
      {
        "strength": "Carnivorous Zoan advantage - users who transform into carnivorous animals are naturally more dangerous and powerful in physical combat",
        "episodeRevealed": 246,
        "description": "As a carnivorous predator transformation, the leopard form grants superior combat effectiveness compared to herbivorous Zoan types.",
        "severity": "MAJOR"
      },
      {
        "strength": "Combines well with Rokushiki martial arts techniques",
        "episodeRevealed": 246,
        "description": "Lucci combines his Devil Fruit powers with his mastery of Rokushiki, creating devastating combination attacks.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "UNCOMMON",
    "powerTier": "HIGH"
  }
]
