[
  {
    "name": {
      "english": "Shadow-Shadow Fruit",
      "japanese": "カゲカゲの実",
      "romanized": "Kage Kage no Mi"
    },
    "type": "Paramecia",
    "debutEpisode": 343,
    "debutChapter": 449,
    "episodeAppearances": [349],
    "currentUser": "gecko-moria",
    "formerUsers": [],
    "userHistory": [
      {
        "userId": "gecko-moria",
        "episodeStart": 343,
        "episodeEnd": "present",
        "howObtained": "Consumed before series start"
      }
    ],
    "abilities": [
      {
        "abilityName": "Shadow Extraction",
        "description": "The user can extract shadows from living beings or objects, storing them to later implant into corpses to create zombies. The shadows retain the personality and combat abilities of their original owners.",
        "episodeFirstShown": 343,
        "limitations": ["Victims who lose their shadows will be destroyed if exposed to sunlight", "Zombies can be purified using salt, which forces the shadow to return to its original owner"]
      },
      {
        "abilityName": "Kage Giri",
        "description": "The user manifests giant scissors to physically cut and sever shadows from their owners. Once cut, the shadow can be captured and stored for later use in zombie creation.",
        "episodeFirstShown": 349,
        "limitations": ["Requires the victim to be immobilized or unable to escape while the shadow is being cut"]
      },
      {
        "abilityName": "Zombie Creation",
        "description": "By implanting stolen shadows into corpses, the user creates zombies that possess the fighting abilities and personality of the shadow's original owner while maintaining the physical strength of the corpse body.",
        "episodeFirstShown": 343,
        "limitations": ["Zombies are weak to salt purification", "Zombies are destroyed by sunlight if shadows are removed", "The quality of the zombie depends on both the shadow's strength and the body's physical condition"]
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 349,
        "eventId": "ep349-event-002",
        "momentType": "WORLD_LORE",
        "title": "Detailed Explanation of Shadow Mechanics",
        "description": "Brook provides a thorough explanation of how the Kage Kage no Mi works, including how shadows function as 'second souls' and how they're used to create zombies.",
        "significance": "Establishes the fundamental mechanics of Moria's Devil Fruit power for viewers and characters."
      },
      {
        "episodeNumber": 349,
        "eventId": "ep349-event-009",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "Kage Giri Technique Revealed",
        "description": "First demonstration of Moria's shadow-cutting technique using giant scissors to physically sever shadows from their owners.",
        "significance": "Shows the specific method Moria uses to steal shadows, making his power more visually defined and threatening."
      },
      {
        "episodeNumber": 349,
        "eventId": "ep349-event-010",
        "momentType": "POWER_REVEAL",
        "title": "Luffy's Shadow Successfully Stolen",
        "description": "Moria uses Kage Giri to cut and steal Luffy's shadow, demonstrating the devastating effect of the power on its victims.",
        "significance": "Major demonstration of the fruit's power and its consequences, creating the arc's central crisis."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Salt Purification",
        "description": "Zombies created with stolen shadows can be purified using salt, which forces the shadow to return to its original master.",
        "episodeRevealed": 349
      },
      {
        "weakness": "Standard Devil Fruit Weaknesses",
        "description": "User cannot swim and is weakened by seawater and Seastone.",
        "episodeRevealed": 343
      }
    ],
    "voiceActors": {}
  }
]
