[
  {
    "name": {
      "english": "Thriller Bark",
      "japanese": "スリラーバーク",
      "romanized": "Surirā Bāku"
    },
    "type": "Island Ship",
    "debutEpisode": 337,
    "debutChapter": 442,
    "episodeAppearances": [349],
    "region": "Florian Triangle",
    "description": "A massive island-sized ship ruled by Gecko Moria and the Thriller Bark Pirates. It serves as both a pirate ship and a zombie-creating facility where Moria and Dr. Hogback create their undead army.",
    "keyEvents": [
      {
        "episodeNumber": 349,
        "eventId": "ep349-event-001",
        "eventType": "BATTLE_END",
        "title": "Brook Defeats Tararan",
        "description": "Brook defeats the giant spider-monkey zombie Tararan using his sword technique combined with salt purification.",
        "significance": "Demonstrates that the Straw Hats are learning how to combat the zombie threat effectively."
      },
      {
        "episodeNumber": 349,
        "eventId": "ep349-event-002",
        "eventType": "WORLD_LORE",
        "title": "Zombie Mechanics Explained",
        "description": "Brook reveals detailed information about how Thriller Bark's zombies are created through Moria's shadow-stealing powers and Hogback's medical expertise.",
        "significance": "Provides crucial understanding of how Thriller Bark operates as a zombie-creation facility."
      }
    ],
    "status": "ACTIVE",
    "rulers": ["gecko-moria"],
    "inhabitants": ["gecko-moria", "hogback", "perona", "absalom"]
  },
  {
    "name": {
      "english": "Moria's Chamber",
      "japanese": "モリアの部屋",
      "romanized": "Moria no Heya"
    },
    "type": "Interior Location",
    "debutEpisode": 349,
    "debutChapter": 455,
    "episodeAppearances": [349],
    "region": "Thriller Bark",
    "description": "The private chamber of Gecko Moria located within Thriller Bark. This is where Moria performs his shadow-stealing operations and where the Mysterious Four gather. The room is equipped with large light sources to cast clear shadows for extraction.",
    "keyEvents": [
      {
        "episodeNumber": 349,
        "eventId": "ep349-event-005",
        "eventType": "CULTURAL_MOMENT",
        "title": "The Mysterious Four Gather",
        "description": "The four leaders of Thriller Bark meet in Moria's chamber to discuss their plans while the hidden Straw Hats observe.",
        "significance": "First proper view of Moria's personal chamber where he conducts his most important operations."
      },
      {
        "episodeNumber": 349,
        "eventId": "ep349-event-007",
        "eventType": "MAJOR_DECISION",
        "title": "Luffy Captured",
        "description": "Luffy is bound by spider webs and suspended in the chamber, with a large light source positioned to cast his shadow clearly for extraction.",
        "significance": "The chamber serves as the setting for one of the arc's most critical events."
      },
      {
        "episodeNumber": 349,
        "eventId": "ep349-event-010",
        "eventType": "POWER_REVEAL",
        "title": "Luffy's Shadow Stolen",
        "description": "In his chamber, Moria uses his Kage Giri technique to cut and steal Luffy's shadow, leaving the Straw Hat captain unconscious.",
        "significance": "This location becomes the site of the arc's central crisis - the theft of the protagonist's shadow."
      }
    ],
    "status": "ACTIVE",
    "rulers": ["gecko-moria"],
    "inhabitants": []
  }
]
