[
  {
    "id": "theory-ep599-001",
    "title": "Law as the Third Corazon",
    "summary": "Theory that Doflamingo reserved the 'Corazon' (Heart) seat for Trafalgar Law, hoping he would one day rejoin the Donquixote Pirates as the third Corazon after Vergo (first) and Rosinante (second).",
    "fullText": "After Rosinante's death, the 'Corazon' codename went unused. Fans theorize that Doflamingo reserved the 'Heart seat' specifically for Trafalgar Law, hoping the boy would one day rejoin the crew and become the 'third Corazon'. This theory is supported by Doflamingo's apparent attachment to Law despite his betrayal, and the fact that the Heart seat remained vacant rather than being filled by another officer. Some fans suggest that Doflamingo was the first occupier of the Heart Seat under his father's rule before he murdered him, then promoted Vergo to the first Corazon position, followed by his brother Donquixote Rosinante. The theory adds depth to the complex relationship between Doflamingo and Law revealed in Episode 599.",
    "author": "Tumblr User: lockdaisy",
    "source": {
      "url": "https://www.tumblr.com/lockdaisy/96732066230/third-corazon-updated",
      "title": "Third Corazon (Updated)",
      "platform": "Tumblr",
      "accessedAt": "2026-01-04"
    },
    "postedDate": "2014-08-01",
    "episodeRange": [599, 746],
    "minEpisode": 599,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 746
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["trafalgar-law", "donquixote-doflamingo", "vergo", "donquixote-rosinante"],
    "relatedLocations": [],
    "relatedEvents": ["ep599-event-009", "ep599-event-001"],
    "tags": ["corazon", "law", "doflamingo", "donquixote-pirates", "heart-seat"]
  },
  {
    "id": "theory-ep599-002",
    "title": "Parallel Infiltrators - Vergo and Rosinante",
    "summary": "Theory examining the mirror situation where Rosinante was a Marine infiltrating the Donquixote Family while Vergo was a pirate infiltrating the Marines, both serving different masters.",
    "fullText": "Fans have noted the poetic parallel between Vergo and Rosinante (Corazon). While Vergo infiltrated the Marines on Doflamingo's orders and spent 15 years rising through the ranks as a spy, Rosinante was secretly a Marine who infiltrated the Donquixote Pirates. Both held the title of Corazon at different times, yet served opposing purposes. This mirror structure creates a fascinating dynamic where Doflamingo's trust in both men was misplaced in different ways - Vergo remained loyal but represented Doflamingo's criminal nature, while Rosinante betrayed him but represented a path to redemption. Law's connection to both men (trained by Rosinante, revealed as former Doflamingo subordinate in Episode 599) places him at the center of this parallel, making him uniquely positioned to understand both sides of Doflamingo's character.",
    "author": "Various One Piece Community Members",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Donquixote_Rosinante",
      "title": "Donquixote Rosinante - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2026-01-04"
    },
    "postedDate": "2014-01-01",
    "episodeRange": [599, 746],
    "minEpisode": 599,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 746
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["vergo", "donquixote-rosinante", "donquixote-doflamingo", "trafalgar-law"],
    "relatedLocations": [],
    "relatedEvents": ["ep599-event-001", "ep599-event-009"],
    "tags": ["vergo", "corazon", "rosinante", "infiltration", "parallel-narratives", "doflamingo"]
  },
  {
    "id": "theory-ep599-003",
    "title": "Law's Heart Pirates Name as Tribute to Corazon",
    "summary": "Theory that Law named his pirate crew the 'Heart Pirates' as a tribute to Rosinante (Corazon, meaning 'Heart' in Spanish) after he was killed, and that his heart-themed tattoos serve the same purpose.",
    "fullText": "When Episode 599 reveals that Law once worked for Doflamingo, fans theorize about the deeper meaning behind Law's crew name and symbolism. The Heart Pirates' name and Law's prominent heart tattoos on his chest, shoulders, and back are believed to be tributes to Donquixote Rosinante, who held the title 'Corazon' (Spanish for 'heart'). This theory suggests that Law's entire pirate identity is built around honoring the man who saved his life and showed him kindness when he was a child. The revelation in Episode 599 that Law has a history with Doflamingo adds weight to this theory, as it establishes the connection that would later be fully explored in the Dressrosa arc. Law's motivation for taking down Doflamingo is thus deeply personal - avenging Corazon while carrying his heart/legacy forward.",
    "author": "Tumblr User: rspixart",
    "source": {
      "url": "https://rspixart.tumblr.com/post/67549827623/theory-time-about-laws-pastmotifs/amp",
      "title": "THEORY TIME ABOUT LAW'S PAST/MOTIFS",
      "platform": "Tumblr",
      "accessedAt": "2026-01-04"
    },
    "postedDate": "2013-11-01",
    "episodeRange": [599, 708],
    "minEpisode": 599,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 708
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["trafalgar-law", "donquixote-rosinante", "donquixote-doflamingo"],
    "relatedLocations": [],
    "relatedEvents": ["ep599-event-009"],
    "tags": ["law", "heart-pirates", "corazon", "symbolism", "tribute", "crew-name"]
  },
  {
    "id": "theory-ep599-004",
    "title": "Extent of Doflamingo's World Government Infiltration",
    "summary": "Theory that if Vergo could infiltrate the Marines for 15 years and reach Vice Admiral rank, Doflamingo likely has other deep-cover agents throughout the World Government.",
    "fullText": "Episode 599's revelation that Vergo spent 15 years infiltrating the Marines raises questions about the full extent of Doflamingo's network. Fans theorize that Vergo's successful infiltration - reaching Vice Admiral rank and commanding the G-5 base - suggests Doflamingo has a systematic approach to planting agents within the World Government. If one man could remain undetected for 15 years, how many other deep-cover agents might be embedded in various Marine branches, Cipher Pol units, or even higher government positions? This theory suggests Doflamingo's power and influence extend far beyond what's visible, with sleeping agents potentially placed throughout the government infrastructure. The theory gains credibility from Doflamingo's status as both a Shichibukai and former Celestial Dragon, giving him unique access and knowledge to execute such long-term infiltration plans.",
    "author": "One Piece Community (Various Forums)",
    "source": {
      "url": "https://tvtropes.org/pmwiki/pmwiki.php/Characters/OnePieceDonquixotePirates",
      "title": "Characters in One Piece: Donquixote Pirates",
      "platform": "TV Tropes",
      "accessedAt": "2026-01-04"
    },
    "postedDate": "2013-06-10",
    "episodeRange": [599, 746],
    "minEpisode": 599,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 800
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["donquixote-doflamingo", "vergo"],
    "relatedLocations": [],
    "relatedEvents": ["ep599-event-001"],
    "tags": ["doflamingo", "infiltration", "world-government", "conspiracy", "vergo", "undercover-agents"]
  }
]
