[
  {
    "id": "nami",
    "name": {
      "english": "Nami",
      "japanese": "ナミ",
      "romanized": "Nami"
    },
    "debutEpisode": 1,
    "episodeAppearances": [132],
    "keyMoments": [
      {
        "episodeNumber": 132,
        "eventId": "ep132-event-004",
        "momentType": "MAJOR_DECISION",
        "title": "Nami Acquires Millennium Paper",
        "description": "Nami discovers and purchases Millennium Paper from Rice Rice, obtaining the professional-grade materials needed to pursue her dream of creating a world map.",
        "significance": "This acquisition enables Nami to begin seriously working on her lifelong dream with materials that will last for generations.",
        "timestamp": "10:20",
        "quote": "This paper is perfect for making maps! It will last a thousand years without fading!"
      },
      {
        "episodeNumber": 132,
        "eventId": "ep132-event-005",
        "momentType": "BACKSTORY_REVEAL",
        "title": "Childhood Dream Flashback",
        "description": "Nami remembers her childhood in Cocoyasi Village, standing on a cliff with Bell-mère and Nojiko, where she first expressed her dream to explore the world and create maps.",
        "significance": "This flashback reveals the origins of Nami's cartography dream and shows Bell-mère's crucial role in encouraging her ambitions.",
        "timestamp": "12:00",
        "quote": "What lies beyond the sea?"
      },
      {
        "episodeNumber": 132,
        "eventId": "ep132-event-007",
        "momentType": "MAJOR_DECISION",
        "title": "Beginning the World Map Project",
        "description": "Nami makes the decision to start creating her world map, beginning with detailed maps of Little Garden, Drum Island, and Arabasta.",
        "significance": "This represents Nami taking concrete action toward her dream, marking a transition from aspiration to active pursuit.",
        "timestamp": "15:00",
        "quote": "Now I can finally start working on my real dream - to draw a map of the entire world!"
      },
      {
        "episodeNumber": 132,
        "eventId": "ep132-event-010",
        "momentType": "CULTURAL_MOMENT",
        "title": "Navigator's Mutiny",
        "description": "Frustrated by constant interruptions, Nami playfully declares a 'Navigator's Mutiny,' demanding peace and quiet to work on her maps.",
        "significance": "This moment shows Nami's assertiveness and her commitment to her craft, willing to stand up to her crewmates for her professional work.",
        "timestamp": "18:30",
        "quote": "This is a Navigator's Mutiny! I need quiet to work on my maps!"
      },
      {
        "episodeNumber": 132,
        "eventId": "ep132-event-015",
        "momentType": "CULTURAL_MOMENT",
        "title": "Completing First Professional Maps",
        "description": "Despite obstacles and interruptions, Nami successfully completes detailed maps of three islands, representing her first real steps toward mapping the entire world.",
        "significance": "This achievement symbolizes Nami's freedom to pursue her dreams and her skill as a cartographer, honoring Bell-mère's memory.",
        "timestamp": "22:45",
        "quote": "These maps are my first real steps toward mapping the entire world. Bell-mère, I'm finally doing it!"
      }
    ],
    "status": "ALIVE",
    "reveals": [
      {
        "infoType": "DREAM",
        "information": "Reinforcement of Nami's childhood dream to map the entire world, first shared with Bell-mère in Cocoyasi Village",
        "episodeRevealed": 132,
        "severity": "MAJOR"
      },
      {
        "infoType": "SKILL",
        "information": "Nami's professional cartography skills are showcased as she creates detailed maps of Little Garden, Drum Island, and Arabasta",
        "episodeRevealed": 132,
        "severity": "MINOR"
      }
    ]
  },
  {
    "id": "rice-rice",
    "name": {
      "english": "Rice Rice",
      "japanese": "ライスライス",
      "romanized": "Raisu Raisu"
    },
    "debutEpisode": 132,
    "debutChapter": null,
    "episodeAppearances": [132],
    "keyMoments": [
      {
        "episodeNumber": 132,
        "eventId": "ep132-event-001",
        "momentType": "FIRST_APPEARANCE",
        "title": "Rice Rice's Debut",
        "description": "Rice Rice is fished out of the water by Luffy, introducing himself as a traveling salesman from the Den Den Mushi Mail Order company.",
        "significance": "Rice Rice's appearance provides the catalyst for Nami obtaining the Millennium Paper needed for her cartography work.",
        "timestamp": "03:15",
        "quote": "Nahahhahahahaha! Thank you for saving me! I'm Rice Rice from the Den Den Mushi Mail Order!"
      },
      {
        "episodeNumber": 132,
        "eventId": "ep132-event-003",
        "momentType": "CULTURAL_MOMENT",
        "title": "Product Demonstrations",
        "description": "Rice Rice demonstrates various products from his catalog including the Buru Buru Blade, Ab-Ab Slider, Golden Fish, Mero Mero Juice, and kitchen knives.",
        "significance": "Establishes Rice Rice's character as a stereotypical pushy salesman and provides comedic moments.",
        "timestamp": "07:45",
        "quote": ""
      },
      {
        "episodeNumber": 132,
        "eventId": "ep132-event-013",
        "momentType": "MAJOR_DECISION",
        "title": "Fleeing in Fear",
        "description": "Upon realizing he's aboard a pirate ship with Straw Hat Luffy, Rice Rice becomes terrified and flees on his Escar, abandoning his inventory.",
        "significance": "Provides comic relief and shows how the Straw Hats are perceived by ordinary people as dangerous pirates.",
        "timestamp": "20:45",
        "quote": ""
      }
    ],
    "status": "ALIVE",
    "statusHistory": [
      {
        "status": "ALIVE",
        "episodeStart": 132,
        "episodeEnd": "present"
      }
    ],
    "occupations": ["Salesman"],
    "affiliations": [
      {
        "organizationName": "Den Den Mushi Mail Order",
        "role": "Traveling Salesman",
        "episodeJoined": 132,
        "episodeLeft": null
      }
    ],
    "characterTraits": [
      "Pushy salesman personality",
      "Dishonest in business dealings",
      "Easily terrified of pirates",
      "Absent-minded",
      "Opportunistic"
    ],
    "distinctiveLaugh": "Nahahhahahahaha",
    "reveals": [
      {
        "infoType": "OCCUPATION",
        "information": "Works as a traveling salesman for the Den Den Mushi Mail Order company",
        "episodeRevealed": 132,
        "severity": "MINOR"
      },
      {
        "infoType": "PERSONALITY",
        "information": "Stereotypical pushy salesman who attempts to overcharge customers and shows minimal gratitude despite being rescued",
        "episodeRevealed": 132,
        "severity": "MINOR"
      }
    ]
  },
  {
    "id": "bell-mere",
    "name": {
      "english": "Bell-mère",
      "japanese": "ベルメール",
      "romanized": "Berumēru"
    },
    "debutEpisode": 31,
    "episodeAppearances": [132],
    "keyMoments": [
      {
        "episodeNumber": 132,
        "eventId": "ep132-event-005",
        "momentType": "BACKSTORY_REVEAL",
        "title": "Encouraging Nami's Curiosity",
        "description": "In a flashback, Bell-mère listens to young Nami's question 'What lies beyond the sea?' and encourages her curiosity about the world.",
        "significance": "Shows Bell-mère's supportive role in nurturing Nami's dreams and sense of wonder about the world beyond Cocoyasi Village.",
        "timestamp": "12:00",
        "quote": ""
      },
      {
        "episodeNumber": 132,
        "eventId": "ep132-event-006",
        "momentType": "BACKSTORY_REVEAL",
        "title": "Praising Nami's First Map",
        "description": "Bell-mère praises young Nami's first attempt at drawing a map, calling it the first step toward her dream of mapping the entire world and giving Nami confidence in her abilities.",
        "significance": "This crucial moment establishes the foundation of Nami's cartography skills and shows how Bell-mère's encouragement gave Nami the faith to pursue her ambitious dream.",
        "timestamp": "13:30",
        "quote": "This is wonderful, Nami! This is the first step of your dream to map the world!"
      }
    ],
    "status": "DECEASED",
    "reveals": [
      {
        "infoType": "RELATIONSHIP",
        "information": "Further depth on Bell-mère's role in encouraging Nami's cartography dream and giving her confidence to pursue it",
        "episodeRevealed": 132,
        "severity": "MAJOR"
      }
    ]
  }
]
