[
  {
    "id": "going-merry",
    "name": {
      "english": "Going Merry",
      "japanese": "ゴーイング・メリー号",
      "romanized": "Gōingu Merī-gō"
    },
    "debutEpisode": 17,
    "episodeAppearances": [132],
    "locationType": "SHIP",
    "keyEvents": [
      {
        "episodeNumber": 132,
        "eventId": "ep132-event-001",
        "title": "Rice Rice Rescued",
        "description": "The Straw Hat crew rescues Rice Rice from the water and brings him aboard the Going Merry.",
        "timestamp": "03:15"
      },
      {
        "episodeNumber": 132,
        "eventId": "ep132-event-003",
        "title": "Product Demonstrations on Deck",
        "description": "Rice Rice demonstrates various products from his catalog on the deck of the Going Merry to the interested crew members.",
        "timestamp": "07:45"
      },
      {
        "episodeNumber": 132,
        "eventId": "ep132-event-007",
        "title": "Nami's Mapmaking Workspace",
        "description": "Nami settles down on the Going Merry to work on creating detailed maps of Little Garden, Drum Island, and Arabasta using her new Millennium Paper.",
        "timestamp": "15:00"
      },
      {
        "episodeNumber": 132,
        "eventId": "ep132-event-014",
        "title": "Navigating Through Tornado",
        "description": "The Going Merry encounters and navigates through a deadly tornado at sea, with Nami providing crucial guidance.",
        "timestamp": "21:30"
      }
    ],
    "description": "The Straw Hat Pirates' ship serves as the primary setting for this episode, where Nami works on her cartography and the crew interacts with Rice Rice.",
    "significance": "The Going Merry is the home and workspace for the Straw Hats, providing both the freedom to pursue their dreams and the chaos of communal living."
  },
  {
    "id": "cocoyasi-village",
    "name": {
      "english": "Cocoyasi Village",
      "japanese": "ココヤシ村",
      "romanized": "Kokoyashi Mura"
    },
    "debutEpisode": 31,
    "episodeAppearances": [132],
    "locationType": "VILLAGE",
    "keyEvents": [
      {
        "episodeNumber": 132,
        "eventId": "ep132-event-005",
        "title": "Nami's Childhood Dream Flashback",
        "description": "In a flashback, young Nami stands on a cliff in Cocoyasi Village with Bell-mère and Nojiko, expressing her curiosity about what lies beyond the sea and her dream to explore the world.",
        "timestamp": "12:00"
      },
      {
        "episodeNumber": 132,
        "eventId": "ep132-event-006",
        "title": "Bell-mère's Encouragement",
        "description": "Bell-mère praises young Nami's first map drawing in Cocoyasi Village, encouraging her dream to map the entire world.",
        "timestamp": "13:30"
      }
    ],
    "description": "Nami's hometown appears in flashbacks, showing the origins of her cartography dream and Bell-mère's encouragement.",
    "significance": "Cocoyasi Village represents Nami's roots and the place where her dreams were first nurtured by Bell-mère. The flashbacks contrast her past constraints with her current freedom."
  }
]
