[
  {
    "name": {
      "english": "Corrida Colosseum",
      "japanese": "コリーダコロシアム",
      "romanized": "Korīda Koroshiamu"
    },
    "debutEpisode": 632,
    "debutChapter": 702,
    "episodeAppearances": [632],
    "locationType": "ARENA",
    "geography": {
      "region": "New World",
      "island": "Dressrosa",
      "parent": "Dressrosa Kingdom"
    },
    "keyEvents": [
      {
        "episodeNumber": 632,
        "eventId": "ep632-event-003",
        "title": "Luffy and Franky Arrive at Corrida Colosseum",
        "description": "Luffy and Franky arrive at the enormous gladiatorial arena and prepare to enter the tournament.",
        "significance": "Marks the beginning of the tournament arc at this historic location.",
        "timestamp": "08:15"
      },
      {
        "episodeNumber": 632,
        "eventId": "ep632-event-005",
        "title": "Mera Mera no Mi Revealed as Tournament Prize",
        "description": "The Mera Mera no Mi is unveiled as the grand prize for the tournament winner.",
        "significance": "Establishes the stakes for the entire tournament and draws competitors from around the world.",
        "timestamp": "12:00"
      },
      {
        "episodeNumber": 632,
        "eventId": "ep632-event-009",
        "title": "Tournament Structure Explained",
        "description": "The tournament rules and block system are announced, revealing 556 participants will compete.",
        "significance": "Sets up the framework for the tournament battles to come.",
        "timestamp": "14:30"
      }
    ],
    "description": "The Corrida Colosseum is a massive gladiatorial arena located in Dressrosa. It is a famous battleground where warriors from across the world compete for glory and prizes. The colosseum has a long history and is known for hosting spectacular tournaments with enormous crowds in attendance.",
    "culturalSignificance": "The Corrida Colosseum represents Dressrosa's gladiatorial tradition and serves as a symbol of combat prowess and honor. It draws fighters from around the world and holds great cultural importance to the island's history.",
    "controlledBy": "Donquixote Pirates / Doflamingo",
    "images": [],
    "historicalNotes": "The colosseum has been a central part of Dressrosa's culture for generations. Under Doflamingo's rule, it became a tool for entertainment and control, with the Mera Mera no Mi tournament specifically designed to trap Luffy.",
    "status": "ACTIVE"
  },
  {
    "name": {
      "english": "Dressrosa",
      "japanese": "ドレスローザ",
      "romanized": "Doresurōza",
      "aliases": ["Kingdom of Love, Passion and Toys"]
    },
    "debutEpisode": 629,
    "debutChapter": 700,
    "episodeAppearances": [632],
    "locationType": "ISLAND",
    "geography": {
      "region": "New World",
      "parent": "Dressrosa Kingdom"
    },
    "keyEvents": [
      {
        "episodeNumber": 632,
        "eventId": "ep632-event-001",
        "title": "Violet's Debut in Dressrosa",
        "description": "Violet appears as a flamenco dancer in the streets of Dressrosa and approaches Sanji.",
        "significance": "Introduces a key character who will help reveal Dressrosa's secrets.",
        "timestamp": "03:45"
      },
      {
        "episodeNumber": 632,
        "eventId": "ep632-event-008",
        "title": "Zoro Searches for Stolen Sword",
        "description": "Zoro uses Observation Haki to track down the fairy who stole his sword in Dressrosa.",
        "significance": "Begins the subplot involving the Tontatta dwarves and their connection to the island's mysteries.",
        "timestamp": "06:20"
      }
    ],
    "description": "Dressrosa is a tropical island kingdom in the New World known for its passionate culture, flamenco dancing, and Spanish-inspired architecture. Under Donquixote Doflamingo's rule, the island appears to be a paradise filled with living toys, but hides dark secrets beneath its cheerful surface.",
    "culturalSignificance": "Dressrosa is famous for its passionate culture, combining elements of Spanish and Mediterranean traditions with gladiatorial combat sports. The island is known as the 'Kingdom of Love, Passion and Toys' and features unique living toy citizens.",
    "controlledBy": "Donquixote Doflamingo",
    "images": [],
    "historicalNotes": "Dressrosa was originally ruled by the Riku Family before Doflamingo took control. The island has a long history with the Tontatta dwarves and holds secrets related to Doflamingo's Devil Fruit powers and his manipulation of the kingdom.",
    "status": "OCCUPIED"
  }
]
