[
  {
    "name": {
      "english": "Shadow-Shadow Fruit",
      "japanese": "カゲカゲの実",
      "romanized": "Kage Kage no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 343,
    "debutChapter": 448,
    "description": "Grants the user the ability to manifest and control shadows as physical entities. The user can steal shadows from living beings by cutting them off and implanting them into corpses to create zombies. The user can also manipulate their own shadow to fight independently.",
    "episodeAppearances": [343],
    "users": [
      {
        "characterId": "gecko-moria",
        "episodeStart": 343,
        "episodeEnd": "present",
        "circumstances": "Moria consumed the fruit at some point in the past and uses it to create his zombie army"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Shadow Stealing",
        "episodeRevealed": 343,
        "description": "The user can cut shadows from living beings and steal them, preventing the victims from being able to walk in sunlight.",
        "severity": "MAJOR",
        "firstUseContext": "Explained by the old man as the source of the shadowless victims on Thriller Bark."
      },
      {
        "abilityName": "Zombie Creation",
        "episodeRevealed": 343,
        "description": "By implanting stolen shadows into corpses, the user can create an army of zombies that retain the abilities of the shadow's original owner.",
        "severity": "MAJOR",
        "firstUseContext": "The zombie army on Thriller Bark is revealed to be created through Moria's shadow-stealing powers."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 343,
        "severity": "MAJOR"
      },
      {
        "weakness": "Zombies are weak to salt and purification",
        "episodeRevealed": null,
        "severity": "MAJOR"
      }
    ],
    "strengths": [
      {
        "strength": "Can create a massive army of zombies with various abilities",
        "episodeRevealed": 343,
        "description": "Moria has created an army of over 1,000 zombies using stolen shadows.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "HIGH"
  }
]
