[
  {
    "id": "theory-ep343-001",
    "title": "Thriller Bark is God Valley Theory",
    "summary": "A theory that Thriller Bark, the massive island-ship originally from the West Blue, may actually be the remnants of God Valley, the island where the Rocks Pirates were defeated.",
    "fullText": "Japanese One Piece fans have proposed that Thriller Bark might be God Valley, the mysterious island that vanished after the battle between the Roger Pirates, Garp, and the Rocks Pirates. Evidence includes: 1) Both islands mysteriously originate from the West Blue, 2) Some of Moria's General Zombies strongly resemble members of the Rocks Pirates seen in flashbacks, 3) Both islands have connections to major historical events, 4) God Valley disappeared after the battle, and converting it to a ship would explain its disappearance. This theory gained traction after Chapter 1096 revealed more about God Valley and the Rocks Pirates.",
    "author": "Japanese One Piece Fan Community",
    "source": {
      "url": "https://comicbook.com/anime/news/one-piece-god-valley-thriller-bark-theory/",
      "title": "One Piece's Craziest Theory Suggests Luffy Has Already Been to God Valley",
      "platform": "ComicBook.com",
      "accessedAt": "2025-11-19"
    },
    "postedDate": "2023-12-01",
    "episodeRange": [343, 381],
    "minEpisode": 343,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["gecko-moria", "rocks-d-xebec"],
    "relatedLocations": ["thriller-bark", "god-valley"],
    "relatedEvents": ["ep343-event-008"],
    "tags": ["god-valley", "thriller-bark", "rocks-pirates", "west-blue", "historical-mystery"]
  },
  {
    "id": "theory-ep343-002",
    "title": "Gecko Moria is Kozuki Clan Theory",
    "summary": "A theory suggesting that Gecko Moria has Kozuki blood and may be related to the Kozuki family from Wano, which would explain his conflict with Kaido and his connection to Wano.",
    "fullText": "Fans noticed that Moria's name in Japanese uses the kanji 月光 (Gekkō) meaning 'moonlight,' which when reversed becomes 光月 (Kōzuki), the kanji for the Kozuki clan name. This linguistic connection, combined with Moria's traumatic past battle against Kaido in Wano (revealed in Episode 343's arc), suggests a deeper connection to Wano than previously understood. Chapter 1158's cover story appears to confirm this theory, revealing Moria's potential Kozuki heritage. This would mean Moria could be related to Kozuki Oden and thus an uncle figure to Momonosuke and Hiyori. The theory recontextualizes Moria's entire character arc - his loss to Kaido becomes even more tragic if Kaido destroyed not just his crew but also conquered his homeland.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://www.soapcentral.com/anime/latest-one-piece-revelation-gecko-moria-gives-insight-thriller-bark-s-origin",
      "title": "Latest One Piece revelation about Gecko Moria gives more insight into Thriller Bark's origin",
      "platform": "Soap Central",
      "accessedAt": "2025-11-19"
    },
    "postedDate": "2024-11-15",
    "episodeRange": [343, 1158],
    "minEpisode": 343,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1158
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "LIKELY_CONFIRMED",
    "relatedCharacters": ["gecko-moria", "kozuki-oden", "kaido", "momonosuke"],
    "relatedLocations": ["thriller-bark", "wano"],
    "relatedEvents": ["ep343-event-007", "ep343-event-002"],
    "tags": ["kozuki-clan", "moria-lineage", "wano-connection", "kaido", "name-theory"]
  },
  {
    "id": "theory-ep343-003",
    "title": "Moria's Traumatic Past Shaped His Philosophy",
    "summary": "A theory that Moria's reliance on zombies rather than living crew members stems from the trauma of losing his entire original crew to Kaido, making him afraid to care about living people again.",
    "fullText": "When Moria is introduced in Episode 343, hints are dropped about his past and why he relies on zombies. Fans theorize that Moria once had a traditional pirate crew that he genuinely cared about - the Gecko Pirates. However, 21 years before the current story (one year after Roger's execution), Moria's crew was completely wiped out by Kaido in Wano. This traumatic loss broke Moria's spirit and fundamentally changed his approach to piracy. Rather than risk caring about living comrades who could die, he created an army of expendable zombies. His philosophy 'You can't lose what's already dead' reflects someone who has experienced devastating loss and refuses to be vulnerable again. This makes Moria a tragic villain rather than simply evil - he's someone whose dreams were crushed and who took the wrong lessons from his trauma. The theory was later supported by explicit reveals about Moria's past battle with Kaido.",
    "author": "r/OnePiece Community",
    "source": {
      "url": "https://www.cbr.com/one-piece-rocks-d-xebec-flashback-gecko-moria-thriller-bark-reframe/",
      "title": "Eiichiro Oda Just Redeemed 1 of One Piece's Most Controversial Arcs",
      "platform": "CBR",
      "accessedAt": "2025-11-19"
    },
    "postedDate": "2024-06-15",
    "episodeRange": [343, 950],
    "minEpisode": 343,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 950
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["gecko-moria", "kaido"],
    "relatedLocations": ["thriller-bark", "wano"],
    "relatedEvents": ["ep343-event-007", "ep343-event-009"],
    "tags": ["character-psychology", "trauma", "kaido-conflict", "wano", "villain-motivation"]
  },
  {
    "id": "theory-ep343-004",
    "title": "The Warlords Were Chosen to Counter Specific Threats",
    "summary": "A theory that the World Government strategically chose each Warlord of the Sea to counter specific threats, with Moria chosen specifically for his ability to create an army.",
    "fullText": "Episode 343 reveals Moria as one of the Seven Warlords of the Sea, leading fans to theorize about why the World Government would grant him this position despite his apparent laziness. The theory suggests that each Warlord was chosen to counter specific threats: Mihawk for his individual power, Crocodile for intelligence operations, Doflamingo for underworld connections, Hancock for her strategic Amazon Lily location, Kuma for his unique abilities, Jinbe for Fish-Man Island control, and Moria for his ability to create a massive army through his Devil Fruit. In a world where the Marines need to control vast territories and face multiple pirate crews, Moria's zombie army represents a scalable military force that doesn't require training or risk Marine lives. The government may have seen value in someone who could create unlimited soldiers from the corpses of defeated enemies. This would make Moria's position as a Warlord more logical despite his seeming weakness compared to others.",
    "author": "One Piece Analysis Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Gecko_Moria",
      "title": "Gecko Moria - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-11-19"
    },
    "postedDate": "2020-03-15",
    "episodeRange": [343, 500],
    "minEpisode": 343,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 500
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "PLAUSIBLE",
    "relatedCharacters": ["gecko-moria", "crocodile", "mihawk", "doflamingo", "boa-hancock", "jinbe", "bartholomew-kuma"],
    "relatedLocations": ["thriller-bark"],
    "relatedEvents": ["ep343-event-002"],
    "tags": ["warlords", "world-government", "strategic-theory", "military-theory"]
  }
]
