[
  {
    "id": "theory-ep001-001",
    "title": "The Straw Hat's Ancient Significance",
    "summary": "A theory that the straw hat Luffy wears (and that Shanks gave him, originally from Gol D. Roger) has deeper significance beyond sentimentality, potentially connecting to Joy Boy, ancient weapons, or the national treasure of Mary Geoise.",
    "fullText": "Fans have theorized that Luffy's iconic straw hat may be more than just a symbol of his promise with Shanks. In later chapters, a giant frozen straw hat is revealed to exist in Mary Geoise, leading to speculation about connections to ancient history. Some believe the straw hat contains hidden power, serves as a key to finding the One Piece, or is connected to Joy Boy, who is depicted wearing a similar wide-brimmed hat. The fact that Gol D. Roger once wore this same hat suggests it may be passed down among those destined to change the world.",
    "author": "Various One Piece fans (Reddit, forums)",
    "source": {
      "url": "https://www.cbr.com/one-piece-crazy-reddit-fan-theories/",
      "title": "One Piece: 5 Reddit Fan Theories About One Piece That Are Crazy (& 5 That Just Might Be True)",
      "platform": "CBR / Reddit",
      "accessedAt": "2025-01-17"
    },
    "postedDate": "2020-06-15",
    "episodeRange": [1, 1000],
    "minEpisode": 1,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 906
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["luffy", "shanks", "gol-d-roger"],
    "relatedLocations": ["mary-geoise"],
    "relatedEvents": ["ep001-event-003"],
    "tags": ["straw-hat", "shanks", "ancient-history", "joy-boy", "gol-d-roger", "mary-geoise"]
  },
  {
    "id": "theory-ep001-002",
    "title": "Luffy's Dream Was Inherited from Roger",
    "summary": "The theory that becoming Pirate King is not just Luffy's personal dream, but part of an inherited will passed down from Gol D. Roger through Shanks to Luffy, representing a cycle of freedom.",
    "fullText": "Episode 1 establishes both Roger's execution and Luffy's declaration to become Pirate King. Some fans theorize that the Will of D. represents an inherited dream across generations. Roger's final words sparked the Great Pirate Era, and Shanks - who was on Roger's crew - later gave his hat to Luffy after seeing Roger's spirit in the boy. This suggests Luffy isn't just randomly pursuing the same goal, but is the next inheritor of a grander purpose to bring freedom to the world. The straw hat serves as a physical symbol of this inherited will.",
    "author": "One Piece theory community",
    "source": {
      "url": "https://screenrant.com/one-piece-fan-theories-we-hope-are-true/",
      "title": "10 One Piece Fan Theories We Hope Are True",
      "platform": "ScreenRant",
      "accessedAt": "2025-01-17"
    },
    "postedDate": "2021-03-20",
    "episodeRange": [1, 1000],
    "minEpisode": 1,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 500
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["luffy", "gol-d-roger", "shanks"],
    "relatedLocations": [],
    "relatedEvents": ["ep001-event-001", "ep001-event-005"],
    "tags": ["will-of-d", "inherited-will", "gol-d-roger", "shanks", "pirate-king", "freedom"]
  },
  {
    "id": "theory-ep001-003",
    "title": "Koby Will Become a Great Marine Admiral",
    "summary": "Based on Koby's declaration in Episode 1 to join the Marines and become an admiral, fans theorize he will eventually achieve this goal and potentially face Luffy in a final confrontation representing pirates vs. marines.",
    "fullText": "In Episode 1, Koby reveals his dream to join the Marines and become an admiral. Many fans believe this isn't just a throwaway line but foreshadowing for Koby's eventual rise to admiral rank. This would create a narrative parallel where both Luffy (Pirate King) and Koby (Marine Admiral) achieve their dreams declared in Episode 1. Some theorize a final confrontation between them would represent the series' ultimate question: what does true justice look like? Their friendship from Episode 1 adds emotional weight to this potential future clash.",
    "author": "One Piece fan community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Koby",
      "title": "Koby - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-01-17"
    },
    "postedDate": "2019-10-20",
    "episodeRange": [1, 1000],
    "minEpisode": 1,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1000
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["koby", "luffy"],
    "relatedLocations": [],
    "relatedEvents": ["ep001-event-006"],
    "tags": ["koby", "marines", "admiral", "character-growth", "luffy-vs-koby"]
  },
  {
    "id": "theory-ep001-004",
    "title": "The Gomu Gomu no Mi Was Intentionally Sought",
    "summary": "A theory suggesting that Shanks didn't just randomly have the Gomu Gomu no Mi, but was transporting it for a specific purpose, and Luffy eating it was either fate or part of a larger plan.",
    "fullText": "Episode 1 reveals that Luffy has the Gomu Gomu no Mi powers (with his backstory of eating it to be shown later). Later revelations in the series suggest this fruit may be more significant than initially presented. Fans theorize that Shanks, a member of Roger's crew, may have been transporting this specific Devil Fruit because of its importance. Whether Luffy eating it was an accident, fate, or somehow orchestrated remains a mystery, but the theory suggests the Gomu Gomu no Mi has deeper lore significance connected to the ancient history of the One Piece world.",
    "author": "One Piece theory community",
    "source": {
      "url": "https://www.ranker.com/list/crazy-one-piece-fan-theories/anna-lindwasser",
      "title": "These 15 'One Piece' Fan Theories Are So Convincing, They Might Actually Be Canon",
      "platform": "Ranker",
      "accessedAt": "2025-01-17"
    },
    "postedDate": "2022-01-15",
    "episodeRange": [1, 1000],
    "minEpisode": 1,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1071
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["luffy", "shanks"],
    "relatedLocations": [],
    "relatedEvents": ["ep001-event-008"],
    "tags": ["gomu-gomu-no-mi", "devil-fruit", "shanks", "ancient-history", "fate", "nika"]
  }
]
