[
  {
    "name": {
      "english": "Jacket-Jacket Fruit",
      "japanese": "ジャケジャケの実",
      "romanized": "Jake Jake no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 645,
    "debutChapter": 715,
    "description": "Allows the user to transform themselves into a full body jacket that can be worn by another individual. While being worn, the user can take control of the wearer's body and utilize their physique and powers, combining the strengths of both individuals.",
    "episodeAppearances": [645],
    "users": [
      {
        "characterId": "kelly-funk",
        "episodeStart": 645,
        "episodeEnd": "present",
        "circumstances": "Kelly uses the fruit to transform into a jacket that his brother Bobby wears, combining Kelly's speed and skill with Bobby's strength and durability."
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Jacket Transformation",
        "episodeRevealed": 645,
        "description": "The user transforms into a jacket that can be worn by another person, allowing the user to control the wearer's body.",
        "severity": "MINOR",
        "firstUseContext": "Kelly transforms into a jacket and has Bobby wear him to fight Boo in the Corrida Colosseum tournament."
      },
      {
        "abilityName": "Body Control",
        "episodeRevealed": 645,
        "description": "While being worn, the user can control the wearer's movements and actions, effectively combining both individuals' abilities.",
        "severity": "MINOR",
        "firstUseContext": "Kelly controls Bobby's body while being worn as a jacket, using Bobby's strength with Kelly's fighting skills."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 645,
        "severity": "MAJOR"
      },
      {
        "weakness": "Requires cooperation with another person to be effective",
        "episodeRevealed": 645,
        "severity": "MINOR"
      },
      {
        "weakness": "The user is vulnerable while in jacket form if not being worn",
        "episodeRevealed": 645,
        "severity": "MINOR"
      }
    ],
    "strengths": [
      {
        "strength": "Combines the abilities and strengths of two individuals",
        "episodeRevealed": 645,
        "description": "The user can merge their abilities with the wearer's physical attributes, creating a powerful hybrid fighter.",
        "severity": "MINOR"
      },
      {
        "strength": "Allows control of someone else's body",
        "episodeRevealed": 645,
        "description": "The user can take over the movements of the person wearing them, potentially using their strength or devil fruit powers.",
        "severity": "MINOR"
      }
    ],
    "awakening": null,
    "rarity": "UNCOMMON",
    "powerTier": "MEDIUM"
  }
]
