[
  {
    "name": {
      "english": "Sleep-Sleep Fruit",
      "japanese": "ネムネムの実",
      "romanized": "Nemu Nemu no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 220,
    "debutChapter": null,
    "description": "Grants the user the ability to trap people in dream worlds and steal their memories. The user can also hypnotize others through direct eye contact and emit memory-stealing sounds when played as an instrument.",
    "episodeAppearances": [223],
    "users": [
      {
        "characterId": "noko",
        "episodeStart": 220,
        "episodeEnd": 224,
        "circumstances": "Noko consumed the Nemu Nemu no Mi at an unknown point before the Ocean's Dream Arc"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Memory-Stealing Sound",
        "episodeRevealed": 220,
        "description": "By being played as an instrument, the user emits a low, mournful sound that steals memories from sleeping listeners.",
        "severity": "MAJOR",
        "firstUseContext": "Noko used this ability to steal the Straw Hats' memories while they slept, taking all their memories since joining the crew."
      },
      {
        "abilityName": "Hypnotic Eyes",
        "episodeRevealed": 223,
        "description": "The user can lock eyes with targets to control their actions through hypnosis. The user's eyes glow red when activating this power.",
        "severity": "MAJOR",
        "firstUseContext": "Noko used this ability to control Zoro and Drim, forcing them to act against their will and attack the Straw Hats."
      },
      {
        "abilityName": "Spectral Illusions",
        "episodeRevealed": 222,
        "description": "The user creates purple smoke that produces visions of loved ones or enemies to manipulate targets emotionally.",
        "severity": "MINOR",
        "firstUseContext": "Noko created illusions to confuse and manipulate the Straw Hats during their pursuit."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 220,
        "severity": "MAJOR"
      },
      {
        "weakness": "Hypnosis requires direct eye contact",
        "episodeRevealed": 223,
        "description": "The hypnotic eye ability can be avoided by closing one's eyes or looking away, limiting its effectiveness in combat.",
        "severity": "MINOR"
      },
      {
        "weakness": "Physical attacks can disrupt control",
        "episodeRevealed": 223,
        "description": "Strong physical attacks against the user can break the hypnotic control over affected individuals and release stolen memories.",
        "severity": "MINOR"
      }
    ],
    "strengths": [
      {
        "strength": "Memory manipulation",
        "episodeRevealed": 220,
        "description": "Can steal and store vast amounts of memories from multiple individuals simultaneously.",
        "severity": "MAJOR"
      },
      {
        "strength": "Mind control",
        "episodeRevealed": 223,
        "description": "Hypnotized individuals retain their full combat abilities while under control, making them formidable unwilling combatants.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "MEDIUM"
  }
]
