[
  {
    "theoryTitle": "Zoro's Sword Continuity Error and Canon Timeline",
    "theoryText": "Fans have discussed the continuity error in Episode 135 where Zoro is shown without his original pair of katanas and having the Wado Ichimonji repaired. This contradicts later canon material which revealed that Zoro's original katanas were childhood gifts from Shimotsuki Kouzaburou that remained with him until they were destroyed during his duel with Mihawk (Episode 24). Some fans theorize that this episode should be considered non-canon not just because it's filler, but because it creates impossible timeline conflicts with the established story.",
    "author": "One Piece Wiki Contributors and Fan Community",
    "source": "https://onepiece.fandom.com/wiki/Episode_135",
    "platform": "One Piece Wiki / Fan Discussions",
    "postedDate": null,
    "episodesSpanned": [135, 24, 1033],
    "spoilerStatus": true,
    "spoilsEpisodes": [1033],
    "popularityMetrics": {
      "upvotes": null,
      "views": null,
      "comments": null
    },
    "debunked": false,
    "confirmed": false,
    "tags": ["continuity", "swords", "zoro", "wado-ichimonji", "filler"]
  },
  {
    "theoryTitle": "Johnny and Yosaku as Zoro's Character Development",
    "theoryText": "The Post-Arabasta Arc character episodes serve to deepen the bonds between the Straw Hats by exploring their pasts. Episode 135's depiction of Zoro's meeting with Johnny and Yosaku reinforces a recurring theme in One Piece: that Zoro's strength and honorable character naturally inspire loyalty in others. Some fans theorize that Johnny and Yosaku's admiration for Zoro mirrors the way all the Straw Hats are drawn to their respective dreams and the people who embody those dreams. This episode, though filler, emphasizes that Zoro was already living by the same code of honor before joining Luffy.",
    "author": "Tumblr User: neverwatchedonepiece",
    "source": "https://www.tumblr.com/neverwatchedonepiece/109530422639/135-the-fabled-pirate-hunter-zoro-the",
    "platform": "Tumblr",
    "postedDate": null,
    "episodesSpanned": [135],
    "spoilerStatus": false,
    "spoilsEpisodes": [],
    "popularityMetrics": {
      "upvotes": null,
      "views": null,
      "comments": null
    },
    "debunked": false,
    "confirmed": false,
    "tags": ["character-development", "zoro", "themes", "honor", "loyalty"]
  }
]
