[
  {
    "name": {
      "english": "Straw Hat Pirates",
      "japanese": "麦わらの一味",
      "romanized": "Mugiwara no Ichimi"
    },
    "id": "straw-hat-pirates",
    "debutEpisode": 1,
    "debutChapter": 1,
    "episodeAppearances": [102],
    "crewType": "PIRATE_CREW",
    "captain": "luffy",
    "keyMoments": [
      {
        "episodeNumber": 102,
        "eventId": "ep102-event-012",
        "momentType": "CREW_PHILOSOPHY",
        "title": "Nami Explains Each Member's Unique Role",
        "description": "Nami articulates how each crew member has unique abilities that make them valuable: Zoro (swordsman), Nami (navigator), Usopp (storyteller), Luffy (fighter), Chopper (doctor), and Sanji (cook).",
        "significance": "Explicitly defines the crew's structure and complementary skills. Shows how diversity of talents makes the crew stronger.",
        "timestamp": "19:45",
        "quote": "Each of us has something we're good at. We all need each other."
      },
      {
        "episodeNumber": 102,
        "eventId": "ep102-event-016",
        "momentType": "CREW_PHILOSOPHY",
        "title": "Zoro's Teamwork Philosophy",
        "description": "Zoro explains to Chopper that the crew works together by working separately - each person taking individual risks for the collective good.",
        "significance": "Reveals the philosophical foundation of how the Straw Hats operate as a team despite their independent personalities.",
        "timestamp": "22:30",
        "quote": "You work together by working separately. Everyone does their part."
      },
      {
        "episodeNumber": 102,
        "eventId": "ep102-event-008",
        "momentType": "CREW_BONDING",
        "title": "Zoro Discusses Crew Dynamics with Chopper",
        "description": "Zoro helps Chopper understand why everyone joined the crew despite being independent, and how their goals aligned with following Luffy.",
        "significance": "Shows the crew integrating their newest member and passing on the crew's values.",
        "timestamp": "14:30",
        "quote": "We all have our own reasons for being here. But there's something more now."
      }
    ],
    "philosophy": "The Straw Hats believe in working together through individual action. Each member has unique abilities and personal goals, but they're united by their trust in Luffy and each other. Teamwork means everyone doing their part separately while supporting the collective mission.",
    "reveals": [
      {
        "infoType": "CREW_PHILOSOPHY",
        "information": "The crew operates on a philosophy of 'working together by working separately' - individual members taking individual risks for collective good",
        "episodeRevealed": 102,
        "severity": "MINOR"
      },
      {
        "infoType": "CREW_STRUCTURE",
        "information": "Each member has a clearly defined role: Zoro (swordsman), Nami (navigator), Usopp (storyteller), Luffy (fighter/captain), Chopper (doctor), Sanji (cook)",
        "episodeRevealed": 102,
        "severity": "MINOR"
      },
      {
        "infoType": "CREW_DYNAMIC",
        "information": "Members joined for their own reasons but have developed a secondary shared purpose beyond individual goals",
        "episodeRevealed": 102,
        "severity": "MINOR"
      }
    ]
  }
]
