[
  {
    "id": "theory-171-001",
    "title": "Enel's City of Gold Connection to the Void Century",
    "theory": "Enel's pursuit of the City of Gold (Shandora) is connected to deeper secrets of the Void Century. Shandora was built 1100 years ago but fell to the Twenty Kingdoms over 800 years ago during the Void Century. The theory suggests that the Battle of Shandora may have been the final battle of the Void Century, and that all 13 Poneglyphs were originally kept in Shandora before being scattered by Nefertari D. Lili. Enel's knowledge of the City of Gold and his later journey to the moon suggests he may possess ancient knowledge about the winged races and their role in the Void Century.",
    "author": "Various One Piece theorists",
    "source": "https://www.sportskeeda.com/anime/void-century-one-piece-theory-proves-every-fan-must-watch-skypiea-arc",
    "platform": "Sportskeeda / Reddit",
    "publishDate": "2024",
    "relatedEpisodes": [171, 195, 196],
    "relatedCharacters": ["enel"],
    "relatedLocations": ["shandora", "underground-ruins"],
    "spoilerStatus": "FULL_SERIES",
    "popularity": "HIGH",
    "status": "UNCONFIRMED"
  },
  {
    "id": "theory-171-002",
    "title": "Wyper and the Shandia's Ancient Weapons Connection",
    "theory": "The Shandia tribe, represented by warriors like Wyper, has a deeper connection to the Ancient Weapons than initially revealed. The Poneglyph within Shandora indicates the location of Poseidon, and eight hundred years ago, the ancient Shandorians were entrusted to protect this ancient text. Wyper, as a descendant of these protectors, carries the burden of safeguarding the truth of Shandora and potentially protecting the future of Poseidon. His fierce determination to reclaim his homeland is not just about territory, but about fulfilling his ancestors' duty to protect world-changing secrets.",
    "author": "Various One Piece theorists",
    "source": "https://www.sportskeeda.com/anime/a-forgotten-skypiea-warrior-may-hold-key-void-century-one-piece",
    "platform": "Sportskeeda / Fan Forums",
    "publishDate": "2024",
    "relatedEpisodes": [171, 195],
    "relatedCharacters": ["wyper"],
    "relatedLocations": ["shandora"],
    "spoilerStatus": "FULL_SERIES",
    "popularity": "MEDIUM",
    "status": "PARTIALLY_CONFIRMED"
  },
  {
    "id": "theory-171-003",
    "title": "Luffy's Shandia Connection and Nika Fruit Selection",
    "theory": "A theory suggests that Monkey D. Dragon may have Shandian origins, which would connect Luffy to the Shandia tribe. This becomes particularly significant after the revelation that Zoan devil fruits have a will of their own. The mythical Zoan Human-Human Fruit Model Nika may have chosen someone from or connected to the Shandia tribe specifically because they worship the Sun God Nika. This would explain why Luffy feels such a strong connection to freeing oppressed people and why he naturally allies with the Shandia's cause in Episode 171 and beyond, despite initially being at odds with Wyper.",
    "author": "Various One Piece theorists",
    "source": "https://gamerant.com/one-piece-dragon-skypiea-fan-theory/",
    "platform": "Game Rant / Reddit",
    "publishDate": "2024",
    "relatedEpisodes": [171, 195],
    "relatedCharacters": ["luffy", "wyper", "dragon"],
    "relatedLocations": ["shandora"],
    "spoilerStatus": "ULTRA_SECRET",
    "popularity": "MEDIUM",
    "status": "SPECULATIVE"
  },
  {
    "id": "theory-171-004",
    "title": "Usopp's 8,000 Followers Prophecy",
    "theory": "When Usopp bluffs to Enel in Episode 171 that he has 8,000 followers, it's actually foreshadowing his future as 'God Usopp' in Dressrosa. Throughout One Piece, Usopp's lies have a pattern of eventually coming true. This instance in Episode 171 is one of the most significant examples, as Usopp will later gain exactly the kind of following he claims to have, becoming a legendary figure with thousands of believers. The fact that he makes this claim while facing a false god (Enel) adds ironic weight to his eventual deification.",
    "author": "One Piece community",
    "source": "https://onepiece.fandom.com/wiki/Usopp",
    "platform": "Reddit / Fan Forums",
    "publishDate": "2003-2024",
    "relatedEpisodes": [171, 629, 630],
    "relatedCharacters": ["usopp", "enel"],
    "relatedLocations": ["going-merry"],
    "spoilerStatus": "MAJOR",
    "popularity": "VERY_HIGH",
    "status": "CONFIRMED"
  },
  {
    "id": "theory-171-005",
    "title": "Enel's Return in the Final Saga",
    "theory": "Enel's quest for the City of Gold and his subsequent journey to the moon (Fairy Vearth) sets up his eventual return in One Piece's Final Saga. The races of Skypieans, Shandians, and Birkans are important to the overarching plot, and their history dates back to the Void Century. Enel's revelation in Episode 171 that he seeks the City of Gold suggests he's searching for ancient technology or knowledge. His journey to the moon reveals ancient automata and murals depicting the history of the winged races. Fans theorize that Enel will return with this ancient knowledge and technology, potentially as an ally or antagonist in the final battles, bringing crucial information about the Void Century and the Ancient Kingdom.",
    "author": "Various One Piece theorists",
    "source": "https://gamerant.com/one-piece-return-enel-explained/",
    "platform": "Game Rant / YouTube",
    "publishDate": "2024",
    "relatedEpisodes": [171, 195],
    "relatedCharacters": ["enel"],
    "relatedLocations": ["shandora"],
    "spoilerStatus": "FULL_SERIES",
    "popularity": "HIGH",
    "status": "SPECULATIVE"
  },
  {
    "id": "theory-171-006",
    "title": "The Great Kingdom Was a Coalition Including Shandora",
    "theory": "Fan theories suggest that the Great Kingdom destroyed during the Void Century was actually a coalition of kingdoms rather than a single nation. This coalition included Shandora and Wano, both referred to as 'City/Country of Gold' in their own ways. When Enel reveals in Episode 171 that he seeks the City of Gold, it ties into this larger mystery. The Poneglyphs scattered across the world (including the one in Shandora) were created to preserve the truth of this coalition. The underground ruins that Luffy falls into at the end of Episode 171 may contain evidence of this ancient alliance and the true nature of the Great Kingdom.",
    "author": "Various One Piece theorists",
    "source": "https://danwhobrowses.tumblr.com/post/190332052822/one-piece-void-century-theory-dump",
    "platform": "Tumblr / Reddit",
    "publishDate": "2020-2024",
    "relatedEpisodes": [171, 195],
    "relatedCharacters": ["enel", "luffy"],
    "relatedLocations": ["shandora", "underground-ruins"],
    "spoilerStatus": "FULL_SERIES",
    "popularity": "MEDIUM",
    "status": "SPECULATIVE"
  }
]
