[
  {
    "title": "Kuma's Sacrifice Was for Bonney",
    "theory": "Fans theorized that Bartholomew Kuma's willing transformation into a mindless Pacifista was motivated by a deal to save someone he cared about, likely Jewelry Bonney. The theory suggested that Vegapunk offered to cure Bonney's Sapphire Scale Disease in exchange for Kuma becoming the Pacifista prototype.",
    "author": "One Piece Community",
    "source": "https://onepiece.fandom.com/wiki/Bartholomew_Kuma",
    "platform": "Various Discussion Forums",
    "dateProposed": "2010",
    "spoilerStatus": "CONFIRMED",
    "episodesReferenced": [468, 469],
    "popularity": "HIGH",
    "status": "CONFIRMED",
    "relatedCharacters": ["kuma", "bonney", "vegapunk"],
    "evidence": [
      "Doflamingo reveals Kuma voluntarily underwent the transformation",
      "Kuma's kind nature suggests he would sacrifice himself for others",
      "Later confirmed in the manga that Kuma made a deal with Vegapunk to save Bonney"
    ]
  },
  {
    "title": "Kuma Can Be Restored",
    "theory": "Despite Doflamingo's claim that 'Kuma is dead,' fans theorized that Kuma's consciousness or memories might be recoverable through Vegapunk's technology or some other means, and that he would eventually be restored to help the Revolutionary Army.",
    "author": "One Piece Community",
    "source": "https://worstgen.alwaysdata.net/forum/threads/theory-on-the-secret-of-kuma.50870/",
    "platform": "Worstgen Forums",
    "dateProposed": "2010-2020",
    "spoilerStatus": "PARTIALLY_CONFIRMED",
    "episodesReferenced": [468],
    "popularity": "MEDIUM",
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["kuma", "vegapunk", "ivankov"],
    "evidence": [
      "Vegapunk's scientific genius suggests possibilities for restoration",
      "Kuma's past kindness toward the Straw Hats implies unfinished business",
      "Later developments in the manga show attempts to preserve/restore Kuma's memories"
    ]
  },
  {
    "title": "Hancock Will Lose Her Warlord Status",
    "theory": "After Hancock openly attacked Smoker to protect Luffy in Episode 468, fans theorized that she would lose her Warlord position and that Amazon Lily would lose its protection from the World Government as a consequence.",
    "author": "One Piece Community",
    "source": "https://onepiece.fandom.com/wiki/Boa_Hancock",
    "platform": "Various Forums",
    "dateProposed": "2010",
    "spoilerStatus": "CONFIRMED",
    "episodesReferenced": [468],
    "popularity": "HIGH",
    "status": "CONFIRMED",
    "relatedCharacters": ["hancock", "luffy"],
    "evidence": [
      "Smoker directly questions if she's resigning from the Shichibukai",
      "Her actions clearly violate her duties as a Warlord",
      "Later confirmed when the Warlord system is abolished"
    ]
  },
  {
    "title": "Vegapunk Has a Hidden Agenda",
    "theory": "Fans speculated that Dr. Vegapunk, despite working for the World Government, might have his own agenda or sympathies toward the Revolutionary Army, given his connection to both Kuma (a Revolutionary) and the morally questionable nature of the Pacifista program.",
    "author": "One Piece Community",
    "source": "https://onepiece.fandom.com/wiki/Vegapunk",
    "platform": "Reddit and Forums",
    "dateProposed": "2010",
    "spoilerStatus": "CONFIRMED",
    "episodesReferenced": [468],
    "popularity": "HIGH",
    "status": "CONFIRMED",
    "relatedCharacters": ["vegapunk", "kuma", "dragon"],
    "evidence": [
      "Kuma's willingness to undergo transformation suggests trust in Vegapunk",
      "The relationship between Kuma and Vegapunk implied deeper connections",
      "Later revealed that Vegapunk has sympathies toward the Revolutionary Army and helped Dragon"
    ]
  }
]
