[
  {
    "abilityName": "Cien Fleur: Delphinium",
    "abilityNameJapanese": "百花繚乱 大飛燕草",
    "abilityNameRomanized": "Cien Fleur: Delphinium",
    "abilityType": "DEVIL_FRUIT",
    "debutEpisode": 310,
    "debutChapter": 428,
    "characterId": "robin",
    "devilFruitId": "hana-hana-no-mi",
    "description": "Robin creates one hundred arms that form into a giant pair of wings, capable of carrying a person through the air. The technique resembles butterfly or bird wings and provides both lift and mobility.",
    "episodeAppearances": [310],
    "keyMoments": [
      {
        "episodeNumber": 310,
        "eventId": "ep310-event-012",
        "title": "Robin Saves Luffy with Cien Fleur: Delphinium",
        "description": "Robin uses this technique to carry the immobilized Luffy off the platform and toward the sea below, protecting him from cannon fire.",
        "significance": "First use of this technique, demonstrating Robin's ability to rescue and protect her crewmates.",
        "timestamp": "20:15"
      }
    ],
    "variations": [],
    "images": []
  },
  {
    "abilityName": "Klabautermann Manifestation",
    "abilityNameJapanese": "クラバウターマン",
    "abilityNameRomanized": "Kurabaūtāman",
    "abilityType": "SUPERNATURAL",
    "debutEpisode": 252,
    "debutChapter": 352,
    "characterId": "going-merry",
    "devilFruitId": null,
    "description": "The manifestation of a ship's spirit, known as a Klabautermann in maritime folklore. When a ship is deeply loved and cared for, it can develop a consciousness that can repair itself, speak, and even sail independently. The Going Merry's Klabautermann appears as a childlike spirit.",
    "episodeAppearances": [310],
    "keyMoments": [
      {
        "episodeNumber": 310,
        "eventId": "ep310-event-010",
        "title": "Going Merry Speaks to the Crew",
        "description": "The Going Merry's Klabautermann speaks directly to all the Straw Hats for the first time, calling them to jump into the sea.",
        "significance": "First time the entire crew hears the ship's voice, confirming its sentience and spiritual presence.",
        "timestamp": "18:45"
      },
      {
        "episodeNumber": 310,
        "eventId": "ep310-event-013",
        "title": "Autonomous Sailing to Enies Lobby",
        "description": "The Going Merry sails from Water 7 to Enies Lobby completely on its own, with no crew aboard, navigating through dangerous Grand Line waters.",
        "significance": "Demonstrates the full extent of the Klabautermann's power and the ship's love for its crew.",
        "timestamp": "20:45"
      }
    ],
    "variations": [],
    "images": []
  }
]
