[
  {
    "id": "theory-ep269-001",
    "title": "Enies Lobby as the Ancient Kingdom Location",
    "summary": "A theory suggesting that Enies Lobby was built on the ruins of the Ancient Kingdom, representing the World Government's oppression over the lost civilization.",
    "fullText": "Some fans theorize that Enies Lobby was the location of the Ancient Kingdom, which would represent a full circle moment since the Enies Lobby arc first revealed lore about an ancient lost kingdom. This would speak to Imu's vindictiveness if they built a symbol of oppression and 'justice' on top of the destruction of Joy Boy's kingdom. The theory is supported by the fact that Enies Lobby has unusual characteristics like perpetual daylight and the massive hole in its center, which could be remnants of an ancient battle or cataclysm.",
    "author": "Various One Piece theorists",
    "source": {
      "url": "https://gamerant.com/one-piece-tragedy-ohara/",
      "title": "One Piece: The Tragedy Of Ohara, Explained",
      "platform": "GameRant",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2023-01-01",
    "episodeRange": [269, 293],
    "minEpisode": 269,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1000
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": ["robin", "luffy"],
    "relatedLocations": ["enies-lobby", "ohara"],
    "relatedEvents": ["ep269-event-004"],
    "tags": ["ancient-kingdom", "enies-lobby", "world-government", "joy-boy"]
  },
  {
    "id": "theory-ep269-002",
    "title": "Rob Lucci's True Motivation - Pure Bloodlust",
    "summary": "A theory that Rob Lucci doesn't actually care about justice at all, and only serves the World Government to legally kill without consequences.",
    "fullText": "Fans theorize that Rob Lucci's adherence to 'Dark Justice' is merely a facade, and his true motivation is pure bloodlust. As revealed in episode 269, Lucci states that he wants 'government-sanctioned killing' and the freedom to murder with impunity. This theory suggests that Lucci is a pure psychopath who found the perfect position in CP9 where he can indulge his violent tendencies legally. His entire philosophy of 'Necessary Evil' and 'Dark Justice' is just rationalization for what he truly wants: to kill. This is supported by his backstory where at age 13, he killed 500 hostages not because it was the only option, but because he wanted to.",
    "author": "Worstgen Forum Users",
    "source": {
      "url": "https://worstgen.alwaysdata.net/forum/threads/akainu%E2%80%99s-thorough-justice-is-not-rob-lucci%E2%80%99s-dark-justice-or-even-exactly-absolute-justice-the-biggest-misconception-about-akainu.20561/page-2",
      "title": "Discussion about Rob Lucci's Dark Justice",
      "platform": "Worstgen Forum",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2020-01-01",
    "episodeRange": [269, 309],
    "minEpisode": 269,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 309
    },
    "popularity": {},
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["rob-lucci", "spandam"],
    "relatedLocations": ["enies-lobby"],
    "relatedEvents": ["ep269-event-002"],
    "tags": ["rob-lucci", "cp9", "dark-justice", "character-motivation"]
  },
  {
    "id": "theory-ep269-003",
    "title": "The Buster Call as World Government's Ultimate Cover-Up Tool",
    "summary": "A theory that the Buster Call is primarily used not for military purposes, but to destroy evidence and silence witnesses to the World Government's secrets.",
    "fullText": "Fans theorize that the Buster Call's true purpose isn't military dominance but information control. Both Ohara (destroyed for researching the Void Century) and later Enies Lobby (to prevent CP9's defeat from being known) faced Buster Calls not because of military threats, but to erase evidence. The theory suggests that the World Government uses this devastating weapon primarily to maintain their control over history and information. Episode 269's reference to both Spandam's Buster Call authority and Robin's traumatic memories of Ohara highlights this pattern - the weapon is consistently used against those who know too much, not those who pose military threats.",
    "author": "One Piece Community",
    "source": {
      "url": "https://gamerant.com/one-piece-buster-call/",
      "title": "One Piece: What is the Buster Call?",
      "platform": "GameRant",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2023-01-01",
    "episodeRange": [269, 312],
    "minEpisode": 269,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 312
    },
    "popularity": {},
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["robin", "spandam"],
    "relatedLocations": ["ohara", "enies-lobby"],
    "relatedEvents": ["ep269-event-003", "ep269-event-004"],
    "tags": ["buster-call", "world-government", "cover-up", "ohara"]
  }
]
