[
  {
    "id": "chiqicheetah",
    "name": "Chiqicheetah",
    "japaneseName": "チキチータ",
    "romanizedName": "Chikichīta",
    "debut": {
      "episode": 213,
      "chapter": null
    },
    "episodeAppearances": [213],
    "isCanon": false,
    "characterType": "ANTAGONIST",
    "affiliations": [
      {
        "type": "CREW",
        "id": "foxy-pirates",
        "name": "Foxy Pirates",
        "role": "Member",
        "startEpisode": 213
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 213,
        "timestamp": "08:00",
        "eventId": "ep213-event-003",
        "title": "Debut as Foxy Devils Team Member",
        "description": "Chiqicheetah is introduced as a specialized member of the Foxy Devils roller racing team, characterized by cheetah-themed appearance and speed-focused racing abilities.",
        "significance": "First appearance of this anime-original character created specifically for the roller race filler arc."
      },
      {
        "episodeNumber": 213,
        "timestamp": "21:00",
        "eventId": "ep213-event-008",
        "title": "Defeated by Zoro and Sanji's Teamwork",
        "description": "Chiqicheetah is countered when Sanji uses his culinary knowledge to identify ingredients that help defeat the speedster, with Zoro retrieving a long kiwi fruit at the critical moment.",
        "significance": "Demonstrates how the Straw Hats use their unique skills and teamwork to overcome specialized opponents."
      }
    ],
    "abilities": [],
    "relationships": []
  },
  {
    "id": "mashikaku",
    "name": "Mashikaku",
    "japaneseName": "マシカク",
    "romanizedName": "Mashikaku",
    "debut": {
      "episode": 213,
      "chapter": null
    },
    "episodeAppearances": [213],
    "isCanon": false,
    "characterType": "ANTAGONIST",
    "affiliations": [
      {
        "type": "CREW",
        "id": "foxy-pirates",
        "name": "Foxy Pirates",
        "role": "Member",
        "startEpisode": 213
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 213,
        "timestamp": "08:00",
        "eventId": "ep213-event-003",
        "title": "Debut as Foxy Devils Team Member",
        "description": "Mashikaku is introduced as one of the specialized members of the Foxy Devils roller racing team competing in the anime-original roller race event.",
        "significance": "First appearance of this anime-original character created for the Long Ring Long Land Arc filler content."
      }
    ],
    "abilities": [],
    "relationships": []
  },
  {
    "id": "jube",
    "name": "Jube",
    "japaneseName": "ジュベ",
    "romanizedName": "Jube",
    "debut": {
      "episode": 213,
      "chapter": null
    },
    "episodeAppearances": [213],
    "isCanon": false,
    "characterType": "ANTAGONIST",
    "affiliations": [
      {
        "type": "CREW",
        "id": "foxy-pirates",
        "name": "Foxy Pirates",
        "role": "Member",
        "startEpisode": 213
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 213,
        "timestamp": "08:00",
        "eventId": "ep213-event-003",
        "title": "Debut as Foxy Devils Team Member",
        "description": "Jube is introduced as one of the specialized members of the Foxy Devils roller racing team competing in the roller race competition.",
        "significance": "First appearance of this anime-original character created for the extended Davy Back Fight arc."
      }
    ],
    "abilities": [],
    "relationships": []
  },
  {
    "id": "girarin",
    "name": "Girarin",
    "japaneseName": "ギララン",
    "romanizedName": "Giraran",
    "debut": {
      "episode": 213,
      "chapter": null
    },
    "episodeAppearances": [213],
    "isCanon": false,
    "characterType": "ANTAGONIST",
    "affiliations": [
      {
        "type": "CREW",
        "id": "foxy-pirates",
        "name": "Foxy Pirates",
        "role": "Member",
        "startEpisode": 213
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 213,
        "timestamp": "08:00",
        "eventId": "ep213-event-003",
        "title": "Debut as Foxy Devils Team Member",
        "description": "Girarin is introduced as one of the specialized members of the Foxy Devils roller racing team selected for the anime-original roller race event.",
        "significance": "First appearance of this anime-original character created specifically for the roller race competition."
      }
    ],
    "abilities": [],
    "relationships": []
  },
  {
    "id": "robin",
    "episodeAppearances": [213],
    "keyMoments": [
      {
        "episodeNumber": 213,
        "timestamp": "11:00",
        "eventId": "ep213-event-004",
        "title": "Devises Creative Solution for Luffy's Skating Problem",
        "description": "Robin uses her Hana Hana no Mi powers to roll Luffy around the roller race track, compensating for his complete inability to roller skate while maintaining his effectiveness as the point runner.",
        "significance": "Demonstrates Robin's problem-solving abilities and creative application of her Devil Fruit powers in non-combat situations."
      },
      {
        "episodeNumber": 213,
        "timestamp": "19:30",
        "eventId": "ep213-event-007",
        "title": "Strategic Counter to Noro Noro Beam",
        "description": "Robin analyzes Foxy's Noro Noro Beam limitations and implements a multi-faceted counter-strategy: deliberately leaving the course when hit by the beam to wait out the thirty-second duration, and using her powers to physically prevent Foxy from forming the beam gesture by holding his hands apart.",
        "significance": "Showcases Robin's analytical intelligence and tactical prowess, demonstrating her value as the crew's strategist beyond her combat abilities."
      }
    ]
  },
  {
    "id": "luffy",
    "episodeAppearances": [213],
    "keyMoments": [
      {
        "episodeNumber": 213,
        "timestamp": "05:30",
        "eventId": "ep213-event-002",
        "title": "Luffy's Inability to Roller Skate Revealed",
        "description": "Despite his incredible strength, agility, and combat prowess, Luffy proves completely unable to roller skate, repeatedly falling and unable to even stand on skates. This creates a major obstacle for the Straw Hats in the roller race competition.",
        "significance": "Rare instance of Luffy's physical capabilities completely failing him, demonstrating that raw strength doesn't translate to every situation and highlighting the importance of teamwork."
      }
    ]
  },
  {
    "id": "foxy",
    "episodeAppearances": [213],
    "keyMoments": [
      {
        "episodeNumber": 213,
        "timestamp": "17:00",
        "eventId": "ep213-event-006",
        "title": "Uses Noro Noro Beam to Cheat in Race",
        "description": "Foxy deploys his signature Noro Noro Beam during the roller race to slow down the Straw Hat racers, demonstrating his willingness to use his Devil Fruit powers to gain an unfair advantage in what should be a fair competition.",
        "significance": "Reinforces Foxy's deceptive and underhanded nature, showing he will use any means necessary to win the Davy Back Fight."
      },
      {
        "episodeNumber": 213,
        "timestamp": "14:30",
        "eventId": "ep213-event-005",
        "title": "Falls for Psychological Manipulation",
        "description": "Foxy's massive ego makes him vulnerable to Nami and Usopp's psychological tactics as they alternate between insults and compliments to distract and confuse him during the race.",
        "significance": "Reveals Foxy's character weakness and shows how the Straw Hats can exploit personality flaws even when facing powerful Devil Fruit abilities."
      }
    ]
  },
  {
    "id": "nami",
    "episodeAppearances": [213],
    "keyMoments": [
      {
        "episodeNumber": 213,
        "timestamp": "14:30",
        "eventId": "ep213-event-005",
        "title": "Employs Psychological Warfare Against Foxy",
        "description": "Nami, alongside Usopp, attempts to exploit Foxy's massive ego through strategic psychological manipulation, alternating between insults and compliments to throw off his concentration during the race.",
        "significance": "Demonstrates Nami's cunning and understanding of human psychology, showing her willingness to use any tactical advantage available."
      }
    ]
  },
  {
    "id": "usopp",
    "episodeAppearances": [213],
    "keyMoments": [
      {
        "episodeNumber": 213,
        "timestamp": "14:30",
        "eventId": "ep213-event-005",
        "title": "Teams Up for Psychological Tactics",
        "description": "Usopp works with Nami to psychologically manipulate Foxy during the race, using his understanding of the opponent's personality to create tactical advantages for the Straw Hats.",
        "significance": "Shows that Usopp's value to the crew extends beyond his marksmanship to include tactical thinking and psychological warfare."
      }
    ]
  },
  {
    "id": "zoro",
    "episodeAppearances": [213],
    "keyMoments": [
      {
        "episodeNumber": 213,
        "timestamp": "21:00",
        "eventId": "ep213-event-008",
        "title": "Cooperates with Sanji Successfully",
        "description": "In a rare moment of genuine cooperation, Zoro works effectively with Sanji to support the racing team, retrieving a long kiwi fruit at a critical moment while Sanji uses his culinary knowledge to help defeat Chiqicheetah.",
        "significance": "Demonstrates that despite their constant rivalry, Zoro and Sanji can work together when it matters, showcasing the underlying bond within the crew."
      }
    ]
  },
  {
    "id": "sanji",
    "episodeAppearances": [213],
    "keyMoments": [
      {
        "episodeNumber": 213,
        "timestamp": "21:00",
        "eventId": "ep213-event-008",
        "title": "Uses Culinary Knowledge in Competition",
        "description": "Sanji applies his extensive culinary and ingredient knowledge to help defeat Chiqicheetah during the roller race, demonstrating how his chef expertise extends beyond cooking to provide tactical advantages.",
        "significance": "Shows that every crew member's unique skills contribute to the team's success, even in unexpected ways."
      }
    ]
  }
]
