[
  {
    "id": "rosy-life-riders",
    "name": {
      "english": "Rosy Life Riders",
      "japanese": "人生バラ色ライダーズ",
      "romanized": "Jinsei Barairo Raidāzu"
    },
    "type": "PIRATE_CREW",
    "debutEpisode": 399,
    "episodeAppearances": [512],
    "leader": "duval",
    "members": [],
    "keyEvents": [
      {
        "episodeNumber": 512,
        "eventId": "ep512-event-006",
        "title": "Defend the Thousand Sunny from Coffee Monkeys",
        "description": "Duval and the Rosy Life Riders successfully fight off the Coffee Monkeys who attempted to capture the Thousand Sunny for a Marine reward at Sabaody Archipelago Grove 44.",
        "significance": "Demonstrates the crew's loyalty to the Straw Hat Pirates and their role as protectors of the Thousand Sunny during the two-year separation.",
        "timestamp": "09:30"
      }
    ],
    "description": "A crew of former bounty hunters and criminals who became loyal allies to the Straw Hat Pirates after Sanji fixed Duval's face. They protect the Thousand Sunny at Sabaody Archipelago during the crew's two-year separation.",
    "baseOfOperations": "Sabaody Archipelago"
  },
  {
    "id": "coffee-monkeys",
    "name": {
      "english": "Coffee Monkeys",
      "japanese": "コーヒーモンキーズ",
      "romanized": "Kōhī Monkīzu"
    },
    "type": "CRIMINAL_ORGANIZATION",
    "debutEpisode": 512,
    "episodeAppearances": [512],
    "leader": "unknown",
    "members": [],
    "keyEvents": [
      {
        "episodeNumber": 512,
        "eventId": "ep512-event-005",
        "title": "Attempt to Capture the Thousand Sunny",
        "description": "The Coffee Monkeys, a gang of human traffickers, demand that Duval's Rosy Life Riders hand over the Thousand Sunny, hoping to receive a large reward from the Marines.",
        "significance": "Establishes the immediate danger facing the Straw Hat Pirates' ship while they are separated and introduces a new antagonistic organization at Sabaody.",
        "timestamp": "08:00"
      },
      {
        "episodeNumber": 512,
        "eventId": "ep512-event-006",
        "title": "Defeated by Rosy Life Riders",
        "description": "The Coffee Monkeys are easily defeated by Duval and his crew, failing in their attempt to capture the Thousand Sunny for the Marines.",
        "significance": "Demonstrates that despite being well-known on Sabaody, they are no match for Duval's crew.",
        "timestamp": "09:30"
      }
    ],
    "description": "A gang of human traffickers active at Sabaody Archipelago. They are well-known on the archipelago and previously caught the giant Stansen for auction. They attempted to capture the Thousand Sunny for a Marine reward but were defeated by Duval's Rosy Life Riders.",
    "baseOfOperations": "Sabaody Archipelago"
  },
  {
    "id": "kuja-pirates",
    "name": {
      "english": "Kuja Pirates",
      "japanese": "九蛇海賊団",
      "romanized": "Kuja Kaizokudan"
    },
    "type": "PIRATE_CREW",
    "debutEpisode": 411,
    "episodeAppearances": [512],
    "leader": "hancock",
    "members": [],
    "keyEvents": [
      {
        "episodeNumber": 512,
        "eventId": "ep512-event-007",
        "title": "Transport Luffy to Training Location",
        "description": "The Kuja Pirates, following Hancock's orders, transport Luffy, Rayleigh, and Jinbe to Luffy's training location. They ensure Luffy rests properly during the journey.",
        "significance": "Shows the Kuja Pirates' continued support for Luffy and Hancock's care for him through her crew.",
        "timestamp": "11:00"
      }
    ],
    "description": "The all-female pirate crew from Amazon Lily, led by Boa Hancock. They assist in transporting Luffy to his training location.",
    "baseOfOperations": "Amazon Lily"
  }
]
