[
  {
    "id": "theory-ep078-001",
    "title": "Bon Clay Was Originally Planned to Join the Straw Hats",
    "summary": "A theory that Bon Clay was originally planned to become a Straw Hat crew member, but Oda changed his mind by the time Franky was introduced.",
    "fullText": "This theory suggests that Mr. 2 Bon Kurei was originally intended to join the Straw Hat Pirates, but this plan changed during the story's development. The evidence cited is that Bon Clay and Franky share the same Japanese voice actor (Kazuki Yao), which is unusual in One Piece. The voice actor reuse could indicate that someone (likely Oda or the voice director) knew the characters would stay far apart in the story, effectively preventing Bon Clay from ever joining despite his strong friendship with Luffy. This would explain why Bon Clay became such a beloved character who repeatedly sacrifices himself for Luffy, as he represents what could have been an alternate crew member path.",
    "author": "Various One Piece Fans",
    "source": {
      "url": "https://www.cbr.com/one-piece-theory-bon-clay-cant-join-straw-hats-because-franky-voice-actor/",
      "title": "One Piece Theory: Bon Clay Can't Join the Straw Hats Because of Franky",
      "platform": "CBR",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "Unknown",
    "episodeRange": [78, 1000],
    "minEpisode": 78,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 600
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["mr-2-bon-kurei", "luffy", "franky"],
    "relatedLocations": [],
    "relatedEvents": ["ep078-event-001"],
    "tags": ["bon-clay", "straw-hats", "voice-actor", "production", "what-if"]
  },
  {
    "id": "theory-ep078-002",
    "title": "Dr. Hiriluk is Rocks D. Xebec",
    "summary": "A theory proposing that Dr. Hiriluk is actually the infamous pirate Rocks D. Xebec, who survived the God Valley Incident and devoted his remaining life to saving people instead of hurting them.",
    "fullText": "This bold theory suggests that Dr. Hiriluk, the adoptive father of Tony Tony Chopper, is actually Rocks D. Xebec, the legendary pirate captain who supposedly died at the God Valley Incident. The theory proposes that after God Valley, Rocks made an escape and lived away from the spotlight, eventually taking on the alias of Dr. Hiriluk. He devoted the remainder of his life to saving people instead of hurting them, seeking redemption for his past. Supporting evidence includes: (1) Both Dr. Hiriluk and Blackbeard believe strongly in miracles and dreams, thinking that anything can happen - Blackbeard's belief could have been inspired by Hiriluk; (2) Blackbeard has a deep connection to Rocks D. Xebec, even naming his ship after him, showing respect for the man who aimed to become king of the world; (3) Dr. Hiriluk believed in the power of dreams and miracles, claimed to have had a big change of heart after seeing beautiful cherry blossoms which miraculously cured his seemingly incurable illness, and had a fascination with pirates; (4) The timing and his mysterious past before arriving at Drum Island are never fully explained. While highly speculative, this theory attempts to connect Drum Island's emotional core to One Piece's larger mythology.",
    "author": "The Birds of Hermes",
    "source": {
      "url": "https://birdsofherme.wordpress.com/2023/11/01/one-piece-10th-theory-dr-hiriluk-was-rocks-d-xebec-contains-spoilers-1096/",
      "title": "One Piece; 10th Theory; Dr. Hiriluk WAS Rocks D. Xebec",
      "platform": "WordPress Blog",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2023-11-01",
    "episodeRange": [78, 1096],
    "minEpisode": 78,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1096
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["hiriluk", "chopper", "blackbeard", "rocks-d-xebec"],
    "relatedLocations": ["drum-island"],
    "relatedEvents": [],
    "tags": ["hiriluk", "rocks-d-xebec", "identity-theory", "drum-island", "god-valley", "d-clan"]
  },
  {
    "id": "theory-ep078-003",
    "title": "Dr. Hiriluk is a Member of the D. Clan",
    "summary": "A theory suggesting that Dr. Hiriluk's behavior, beliefs, and manner of death indicate he may be a lost member of the mysterious D. Clan.",
    "fullText": "This theory proposes that Dr. Hiriluk is a member of the Will of D. clan based on several behavioral and thematic similarities to confirmed D. clan members. The main evidence includes: (1) Hiriluk's behavior and philosophy sound remarkably similar to Luffy's - his unwavering belief in dreams, his reckless selflessness, and his infectious optimism; (2) The circumstances of his death mirror the D. clan's tendency to die with a smile and without regret, facing death defiantly; (3) His speech about when a man truly dies ('When he is forgotten') echoes the themes of inherited will that are central to the D. clan's mythology; (4) His belief that miracles can be created through willpower and determination aligns with the D. clan's seemingly supernatural ability to change the world; (5) His mysterious past before arriving at Drum Island is never fully explained, leaving room for a hidden lineage. While his full name 'Hiriluk' doesn't contain a 'D.', it's possible he abandoned or hid his true name. This theory attempts to explain why Hiriluk's character resonates so strongly with One Piece's central themes about inherited will and the power of dreams.",
    "author": "Various One Piece Fans",
    "source": {
      "url": "https://gamerant.com/one-piece-this-character-may-be-a-member-of-the-d-clan/",
      "title": "One Piece: How This Character May Be A Member of the D. Clan",
      "platform": "Game Rant",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "Unknown",
    "episodeRange": [78, 1000],
    "minEpisode": 78,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 500
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["hiriluk", "chopper", "luffy"],
    "relatedLocations": ["drum-island"],
    "relatedEvents": [],
    "tags": ["hiriluk", "d-clan", "will-of-d", "drum-island", "inherited-will"]
  },
  {
    "id": "theory-ep078-004",
    "title": "Drum Island as Anarchist Metaphor - Hiriluk's Political Message",
    "summary": "A theory interpreting Dr. Hiriluk as an anarchist figure whose suicide represents the symbolic 'death of nations' and rejection of governing bodies.",
    "fullText": "This literary analysis theory suggests that Dr. Hiriluk's character and actions serve as an anarchist political metaphor within the One Piece narrative. The theory argues that Hiriluk represents anarchist ideals and is therefore portrayed as a 'madman' within the story's paradigm of kingdoms and governance. Key points include: (1) His deeds and philosophy inspired Dalton to formally reject King Wapol, representing the rejection of tyrannical authority; (2) Insofar as Hiriluk is interpreted as an anarchist, his suicide gesture advocates the 'suicide of nations' - the internally driven removal of the head of state, the rejection of governing bodies from within rather than through external revolution; (3) His famous quote about when a man dies ('A man dies when he is forgotten') suggests that hierarchical power structures only exist as long as people believe in and support them; (4) The imagery of the cherry blossoms (sakura) he created represents beauty and hope that can exist without centralized control; (5) His influence on Chopper - teaching him to value freedom and make his own choices - continues this anti-authoritarian theme. This theory positions Drum Island Arc as one of One Piece's early explorations of themes about freedom, governance, and the right to self-determination that become central to the series' larger political commentary.",
    "author": "mmmmalo on Tumblr",
    "source": {
      "url": "https://www.tumblr.com/mmmmalo/616343055840296960/thoughts-on-drum-island-forgive-me-if-i-bury-my",
      "title": "Thoughts on Drum Island - mmmmalo on Tumblr",
      "platform": "Tumblr",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "Unknown",
    "episodeRange": [78, 91],
    "minEpisode": 78,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 91
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "ANALYSIS",
    "relatedCharacters": ["hiriluk", "chopper", "dalton", "wapol"],
    "relatedLocations": ["drum-island"],
    "relatedEvents": [],
    "tags": ["hiriluk", "political-theory", "anarchism", "literary-analysis", "drum-island", "themes"]
  }
]
