[
  {
    "name": {
      "english": "Sea Train Tracks",
      "japanese": "海列車の線路",
      "romanized": "Umi Ressha no Senro"
    },
    "type": "TRANSPORTATION_ROUTE",
    "episodeAppearances": [261],
    "keyEvents": [
      {
        "episodeNumber": 261,
        "eventId": "ep261-event-001",
        "title": "Zoro Confronts T Bone",
        "description": "Zoro encounters Marine Captain T Bone on the sea train tracks after seeing the sliced Sea King.",
        "significance": "The location of the battle between Zoro and T Bone.",
        "timestamp": "02:30"
      },
      {
        "episodeNumber": 261,
        "eventId": "ep261-event-004",
        "title": "Zoro Defeats T Bone",
        "description": "T Bone is defeated and sent into the water from the sea train tracks.",
        "significance": "Zoro's victory clears the path for the Rocketman to continue pursuit.",
        "timestamp": "06:00"
      }
    ],
    "description": "The railway tracks connecting Water 7 to Enies Lobby via sea train. These tracks run across the ocean and are the path used by the Puffing Tom and Rocketman during the pursuit to rescue Robin.",
    "firstMention": 255,
    "significance": "Critical transportation route used during the Water 7/Enies Lobby arc for the Straw Hats' pursuit of CP9."
  },
  {
    "name": {
      "english": "Rocketman",
      "japanese": "ロケットマン",
      "romanized": "Rokettoman"
    },
    "type": "VEHICLE",
    "episodeAppearances": [261],
    "keyEvents": [
      {
        "episodeNumber": 261,
        "eventId": "ep261-event-004",
        "title": "Zoro Boards the Rocketman",
        "description": "After defeating T Bone, Zoro boards the Rocketman to continue the pursuit with the rest of the crew.",
        "significance": "Zoro rejoins the main group for the journey to Enies Lobby.",
        "timestamp": "06:00"
      }
    ],
    "description": "A prototype sea train known for its incredible speed but lack of brakes. Used by Luffy, the Straw Hats, and the Franky Family to pursue the Puffing Tom to Enies Lobby. The train is piloted by Kokoro and carries the main rescue force.",
    "firstMention": 255,
    "significance": "The Straw Hats' primary mode of transportation during the chase to rescue Robin from CP9.",
    "currentStatus": "In use during pursuit to Enies Lobby"
  },
  {
    "name": {
      "english": "Puffing Tom",
      "japanese": "パッフィング・トム",
      "romanized": "Paffingu Tomu"
    },
    "type": "VEHICLE",
    "episodeAppearances": [261],
    "keyEvents": [
      {
        "episodeNumber": 261,
        "eventId": "ep261-event-005",
        "title": "Sanji vs Wanze Battle",
        "description": "Sanji continues his fight against Wanze aboard the Puffing Tom.",
        "significance": "One of the main battle locations in the episode.",
        "timestamp": "08:45"
      },
      {
        "episodeNumber": 261,
        "eventId": "ep261-event-010",
        "title": "Sanji Defeats Wanze",
        "description": "Wanze is defeated and sent crashing into the CP9 car on the Puffing Tom.",
        "significance": "Sanji clears his path toward Robin.",
        "timestamp": "16:00"
      },
      {
        "episodeNumber": 261,
        "eventId": "ep261-event-011",
        "title": "Franky vs Nero on the Roof",
        "description": "Franky battles Nero on the roof of the Puffing Tom.",
        "significance": "Another major battle location in the episode.",
        "timestamp": "17:30"
      },
      {
        "episodeNumber": 261,
        "eventId": "ep261-event-014",
        "title": "Franky Defeats Nero",
        "description": "Nero is smashed through the roof into the CP9 car.",
        "significance": "Brings Franky into direct contact with CP9.",
        "timestamp": "20:15"
      },
      {
        "episodeNumber": 261,
        "eventId": "ep261-event-015",
        "title": "Lucci Executes Nero",
        "description": "Rob Lucci executes Nero for being too weak and throws him from the train into the ocean.",
        "significance": "Demonstrates CP9's ruthless nature and raises the stakes.",
        "timestamp": "21:00"
      },
      {
        "episodeNumber": 261,
        "eventId": "ep261-event-016",
        "title": "Sanji and Franky Face CP9",
        "description": "Both Sanji and Franky confront the CP9 agents in their car on the Puffing Tom.",
        "significance": "First direct confrontation between the rescuers and CP9.",
        "timestamp": "22:30"
      }
    ],
    "description": "The regular sea train traveling from Water 7 to Enies Lobby. CP9 has commandeered this train to transport Nico Robin and Franky to Enies Lobby. The train features multiple cars including passenger cars, a kitchen car, and the CP9 agents' car.",
    "firstMention": 250,
    "significance": "The location where Robin is being held captive and the primary target of the Straw Hats' pursuit. Multiple battles take place on this train.",
    "currentStatus": "En route to Enies Lobby with CP9, Robin, and infiltrators Sanji and Franky"
  }
]
