[
  {
    "name": {
      "english": "Venom-Venom Fruit",
      "japanese": "ドクドクの実",
      "romanized": "Doku Doku no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 425,
    "debutChapter": 528,
    "description": "Grants the user the ability to produce and control all different types of poison, as well as absolute immunity to poison. The user's entire body becomes made of poison.",
    "episodeAppearances": [435],
    "users": [
      {
        "characterId": "magellan",
        "episodeStart": 425,
        "episodeEnd": "present",
        "circumstances": "Magellan ate the fruit at some point before becoming Chief Warden of Impel Down"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Hydra",
        "episodeRevealed": 435,
        "description": "Creates a multi-headed poison hydra from the user's body that pursues and envelops opponents in lethal poison. The poison is so corrosive it melts everything it touches.",
        "severity": "MAJOR",
        "firstUseContext": "Magellan uses Hydra to attack Luffy on Level 4, forcing him to flee across the chasm."
      },
      {
        "abilityName": "Chloro Ball",
        "episodeRevealed": 435,
        "description": "Launches a ball of poisonous gas at opponents from a distance. The gas attack allows the user to attack without direct contact.",
        "severity": "MAJOR",
        "firstUseContext": "Magellan uses Chloro Ball when Luffy crosses a chasm to escape the Hydra."
      },
      {
        "abilityName": "Venom Road",
        "episodeRevealed": 435,
        "description": "Allows the user to travel through their own poison at high speed, moving across the battlefield with unprecedented mobility.",
        "severity": "MAJOR",
        "firstUseContext": "Magellan uses Venom Road to close the distance to Luffy by traveling through his poison."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 425,
        "severity": "MAJOR"
      },
      {
        "weakness": "User can be damaged by direct physical attacks if opponent is willing to accept poisoning",
        "episodeRevealed": 435,
        "description": "Luffy demonstrates that Magellan can be hurt by direct hits, though the attacker will be poisoned in the process.",
        "severity": "MAJOR"
      },
      {
        "weakness": "Causes severe chronic diarrhea from consuming poisoned food",
        "episodeRevealed": 425,
        "severity": "MINOR"
      }
    ],
    "strengths": [
      {
        "strength": "Complete immunity to all poisons",
        "episodeRevealed": 425,
        "description": "User cannot be poisoned by any substance.",
        "severity": "MAJOR"
      },
      {
        "strength": "Body made of poison makes direct combat nearly impossible",
        "episodeRevealed": 435,
        "description": "Anyone who touches Magellan's body is instantly poisoned with lethal toxins.",
        "severity": "CRITICAL"
      },
      {
        "strength": "Can produce various types of poison ranging from mild to lethal",
        "episodeRevealed": 425,
        "description": "User has complete control over the type and potency of poison created.",
        "severity": "MAJOR"
      },
      {
        "strength": "Poison affects even non-organic materials",
        "episodeRevealed": 435,
        "description": "The poison spreads like a disease over everything it touches, even melting stone and metal.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "VERY_HIGH"
  }
]
