[
  {
    "name": {
      "english": "Gray Terminal",
      "japanese": "グレイ・ターミナル",
      "romanized": "Gurei Tāminaru"
    },
    "type": "JUNKYARD",
    "debutEpisode": 497,
    "debutChapter": 585,
    "episodeAppearances": [500],
    "keyEvents": [
      {
        "episodeNumber": 500,
        "eventId": "ep500-event-002",
        "eventType": "LOCATION_ARRIVAL",
        "title": "Brothers Search Gray Terminal for Materials",
        "description": "Ace, Luffy, and Sabo venture into Gray Terminal to scavenge materials to rebuild their destroyed hideout, unknowingly walking into a trap.",
        "significance": "Sets up the brothers' capture and the revelation of the nobles' genocidal plot to burn Gray Terminal.",
        "timestamp": "04:15"
      },
      {
        "episodeNumber": 500,
        "eventId": "ep500-event-004",
        "eventType": "BATTLE_START",
        "title": "Bluejam Pirates Capture the Three Brothers",
        "description": "The Bluejam Pirates, hired by Outlook III, capture Sabo, Ace, and Luffy in Gray Terminal.",
        "significance": "Marks the point where the nobles' plans intersect with the brothers' fate.",
        "timestamp": "07:30"
      },
      {
        "episodeNumber": 500,
        "eventId": "ep500-event-009",
        "eventType": "BACKSTORY_REVEAL",
        "title": "Gray Terminal Burning Plot Revealed",
        "description": "Sterry reveals that the nobles plan to burn down Gray Terminal the next day to hide it from visiting World Nobles, intending to kill everyone who lives there.",
        "significance": "Exposes the planned genocide and the nobles' view of Gray Terminal residents as disposable.",
        "timestamp": "17:00"
      },
      {
        "episodeNumber": 500,
        "eventId": "ep500-event-013",
        "eventType": "PROPHECY_FORESHADOWING",
        "title": "Explosives and Oil Distributed Throughout Gray Terminal",
        "description": "Ace and Luffy unknowingly help Bluejam distribute cargo boxes containing explosives and oil to marked locations throughout Gray Terminal, setting up the planned fire.",
        "significance": "The incendiary materials are positioned throughout the location, preparing for the massacre in the next episode.",
        "timestamp": "13:45"
      }
    ],
    "parentLocation": "Dawn Island",
    "geography": "A massive junkyard located outside the great wall surrounding Goa Kingdom. It's filled with trash collected from throughout the world, dumped every two days. The area is surrounded by mountains beyond the junkyard.",
    "population": "Thousands of impoverished people who have been expelled from or rejected by Goa Kingdom society",
    "governance": "Lawless - not officially governed by Goa Kingdom despite being on its territory. The Bluejam Pirates and other criminal groups hold de facto power.",
    "culture": "A survival-oriented society of outcasts living among refuse. Residents scavenge and trade to survive. Despite poverty, communities form among the residents.",
    "economy": "Scavenging and salvage-based. Residents search through the constant influx of trash for anything valuable or useful.",
    "status": "ACTIVE",
    "statusHistory": [
      {
        "status": "ACTIVE",
        "episodeStart": 497,
        "episodeEnd": 500,
        "description": "Gray Terminal exists as a junkyard slum outside Goa Kingdom's walls"
      }
    ],
    "significance": "Gray Terminal represents the dark underside of Goa Kingdom's supposed perfection - the place where the kingdom dumps both its trash and its unwanted people. It exposes the class divide and dehumanization inherent in the kingdom's structure. The nobles' plan to burn it reveals their genocidal willingness to erase poverty rather than address it.",
    "images": [],
    "sources": [
      {
        "url": "https://onepiece.fandom.com/wiki/Gray_Terminal",
        "title": "Gray Terminal - One Piece Wiki",
        "platform": "Fandom",
        "accessedAt": "2025-12-15"
      }
    ]
  },
  {
    "name": {
      "english": "High Town",
      "japanese": "ハイタウン",
      "romanized": "Hai Taun"
    },
    "type": "CITY_DISTRICT",
    "debutEpisode": 497,
    "debutChapter": 585,
    "episodeAppearances": [500],
    "keyEvents": [
      {
        "episodeNumber": 500,
        "eventId": "ep500-event-007",
        "eventType": "LOCATION_ARRIVAL",
        "title": "Sabo Forced to Return to High Town",
        "description": "Sabo is taken from Gray Terminal back to High Town by his father, returning to the luxurious noble district he had fled from.",
        "significance": "Represents Sabo's loss of freedom and forced return to the gilded cage of noble society.",
        "timestamp": "14:00"
      },
      {
        "episodeNumber": 500,
        "eventId": "ep500-event-011",
        "eventType": "WORLD_LORE",
        "title": "High Town's Complicity in Genocide Revealed",
        "description": "Sabo discovers that everyone in High Town knows about the plan to burn Gray Terminal but shows complete indifference. They actively keep it quiet to prevent outsiders from learning about it.",
        "significance": "Shows that the corruption isn't limited to a few nobles but is systemic throughout High Town's society. All are complicit through their silence.",
        "timestamp": "19:30"
      }
    ],
    "parentLocation": "Goa Kingdom",
    "geography": "The richest district within Goa Kingdom's walls, located in the innermost area. Contains the Royal Palace and the mansions of noble families. Separated from Gray Terminal by the great wall.",
    "population": "Members of the royal family and nobility of Goa Kingdom",
    "governance": "Governed by noble families under the king's authority",
    "culture": "Aristocratic society obsessed with appearances, status, and maintaining class divisions. Values refinement and elegance while showing complete indifference to those outside their class.",
    "economy": "Wealth-based economy supported by exploitation of lower classes and control of resources",
    "status": "ACTIVE",
    "statusHistory": [
      {
        "status": "ACTIVE",
        "episodeStart": 497,
        "episodeEnd": "present",
        "description": "High Town serves as the noble district of Goa Kingdom"
      }
    ],
    "significance": "High Town represents the facade of civilization built on systematic oppression. Its beauty and order are maintained through the exploitation and dehumanization of Gray Terminal's residents. The nobles' plan to burn Gray Terminal to hide it before the World Nobles' visit exposes how this 'civilized' society is willing to commit genocide for appearances.",
    "images": [],
    "sources": [
      {
        "url": "https://onepiece.fandom.com/wiki/Goa_Kingdom",
        "title": "Goa Kingdom - One Piece Wiki",
        "platform": "Fandom",
        "accessedAt": "2025-12-15"
      }
    ]
  }
]
