[
  {
    "id": "horo-horo-no-mi",
    "name": {
      "english": "Hollow-Hollow Fruit",
      "japanese": "ホロホロの実",
      "romanized": "Horo Horo no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 343,
    "description": "A Devil Fruit that allows the user to conjure ghosts, making them a Ghost Human. The user can create various types of ghosts with different abilities, from explosive ghosts to those that drain willpower.",
    "episodeAppearances": [355],
    "users": [
      {
        "characterId": "perona",
        "episodeStart": 343,
        "episodeEnd": "present",
        "circumstances": "Perona ate the fruit at an unknown time before her debut"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Negative Hollow",
        "episodeRevealed": 355,
        "description": "Perona sends out ghosts that drain the will of any person they pass through, causing extreme negativity and self-loathing. Victims collapse and express deeply pessimistic thoughts about themselves.",
        "severity": "MAJOR",
        "firstUseContext": "Used against Luffy and Sanji to completely neutralize them despite their physical strength. Luffy wished to be reborn as a mosquito, while Sanji lamented his soul being as bad as his curly eyebrows."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Negative Hollows cannot affect people who are already extremely pessimistic about themselves",
        "episodeRevealed": 356,
        "severity": "MAJOR"
      },
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 343,
        "severity": "MAJOR"
      }
    ],
    "strengths": [
      {
        "strength": "Can neutralize even the strongest physical fighters through psychological attacks",
        "episodeRevealed": 355,
        "description": "Successfully stopped both Luffy and Sanji's assault completely.",
        "severity": "MAJOR"
      },
      {
        "strength": "Multiple ghost types with different abilities (explosive, negative, etc.)",
        "episodeRevealed": 347,
        "description": "Versatile combat and utility applications.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "UNCOMMON",
    "powerTier": "HIGH"
  },
  {
    "id": "kage-kage-no-mi",
    "name": {
      "english": "Shadow-Shadow Fruit",
      "japanese": "カゲカゲの実",
      "romanized": "Kage Kage no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 343,
    "description": "A Devil Fruit that allows the user to steal and manipulate shadows. Stolen shadows can be implanted into corpses to create zombies, or into living beings to enhance their power.",
    "episodeAppearances": [355],
    "users": [
      {
        "characterId": "gecko-moria",
        "episodeStart": 343,
        "episodeEnd": "present",
        "circumstances": "Moria consumed the fruit at an unknown time, becoming a Warlord of the Sea and creating his zombie army"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Shadow Transfer - Personality Inheritance",
        "episodeRevealed": 355,
        "description": "When a shadow is implanted into a corpse, the zombie gains the personality, memories, and combat style of the person whose shadow was stolen. However, Devil Fruit abilities are NOT transferred, as they are tied to the body, not the shadow.",
        "severity": "MAJOR",
        "firstUseContext": "Demonstrated through Oars possessing Luffy's personality and memories but being unable to use his stretching abilities."
      },
      {
        "abilityName": "Control Difficulty with Strong Shadows",
        "episodeRevealed": 355,
        "description": "Zombies animated with shadows from strong-willed individuals can resist Moria's control and act independently. Moria must 'break' them first before they can be properly controlled.",
        "severity": "MAJOR",
        "firstUseContext": "Oars acts independently due to Luffy's strong-willed shadow, requiring Moria to break the zombie's will."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Salt can purify zombies, extracting the shadow and returning it to its original owner",
        "episodeRevealed": 355,
        "severity": "CRITICAL",
        "description": "Sea salt contains trace amounts of ocean that neutralize Devil Fruit powers, disrupting the shadow-animation process."
      },
      {
        "weakness": "Strong-willed shadows resist control and require breaking before they obey",
        "episodeRevealed": 355,
        "severity": "MAJOR"
      },
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 343,
        "severity": "MAJOR"
      }
    ],
    "strengths": [
      {
        "strength": "Can create powerful zombie armies from legendary corpses",
        "episodeRevealed": 350,
        "description": "Allows user to build an army without recruiting living followers.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "VERY_HIGH"
  },
  {
    "id": "gomu-gomu-no-mi",
    "name": {
      "english": "Gum-Gum Fruit",
      "japanese": "ゴムゴムの実",
      "romanized": "Gomu Gomu no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 1,
    "description": "Grants the user's body the properties of rubber, allowing them to stretch and become immune to blunt attacks and electricity.",
    "episodeAppearances": [355],
    "users": [
      {
        "characterId": "luffy",
        "episodeStart": 1,
        "episodeEnd": "present",
        "circumstances": "Luffy accidentally ate the fruit as a child"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Devil Fruit Powers Don't Transfer with Shadows",
        "episodeRevealed": 355,
        "description": "When Luffy's shadow was implanted in Oars, the zombie gained Luffy's personality and memories but could not use his rubber stretching abilities, proving Devil Fruit powers are tied to the physical body, not the shadow.",
        "severity": "MAJOR",
        "firstUseContext": "Oars attempted to stretch his arms and legs like Luffy but his corpse body didn't respond, establishing this crucial limitation of shadow transfer."
      }
    ],
    "weaknesses": [],
    "strengths": [],
    "awakening": null,
    "rarity": "COMMON",
    "powerTier": "HIGH"
  }
]
