[
  {
    "id": "theory-ep355-001",
    "title": "Sanji's Super Saiyan Mode as Foreshadowing",
    "summary": "Fans theorized that Sanji's intense fiery rage in Episode 355, dubbed 'Super Saiyan mode,' was intentional foreshadowing by the anime staff for his future Hell Memories technique.",
    "fullText": "In Episode 355, Sanji's rage over Nami's forced wedding manifested as literal flames surrounding his body, which fans immediately compared to Dragon Ball's Super Saiyan transformation. This became known as 'Sanji's Super Saiyan mode' in the community. Years later, when Sanji debuted his Hell Memories technique in Episode 566 (which involves him literally bursting into flames from passionate memories), many fans theorized that the anime staff had been foreshadowing this ability all the way back in Thriller Bark. The theory suggests the extended animation of Sanji's rage in Episode 355 was a deliberate hint at his future power development, even though the manga didn't emphasize it as heavily.",
    "author": "One Piece Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_355",
      "title": "Episode 355 - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-11-25"
    },
    "postedDate": "2008-2016",
    "episodeRange": [355, 566],
    "minEpisode": 355,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 566
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["sanji"],
    "relatedLocations": ["thriller-bark"],
    "relatedEvents": ["ep355-event-004"],
    "tags": ["sanji", "foreshadowing", "hell-memories", "anime-enhancement"]
  },
  {
    "id": "theory-ep355-002",
    "title": "Oars' Nation Still Exists in One Piece World",
    "summary": "A theory that the nation Oars the Continent-Puller created 500 years ago still exists somewhere in the One Piece world and may play a role in future arcs.",
    "fullText": "According to the lore revealed in the Thriller Bark arc, about 500 years ago, Oars was known as the Continent-Puller and created an entire nation that he ruled over with help from his villainous underlings. While this hasn't been confirmed in the story, fans have theorized that the nation Oars created might still exist in the present day. Some speculate it could be related to Elbaf (the giant warrior nation) or another yet-to-be-revealed location. The theory suggests that discovering Oars' legacy nation could provide important historical context about the Void Century, ancient giants, or other mysteries of the One Piece world. Given Oda's tendency to reference early-series elements in later arcs, fans believe this detail wasn't mentioned randomly.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://www.ranker.com/list/things-you-didnt-know-about-thriller-bark-one-piece/anna-lindwasser",
      "title": "20 Things You Didn't Know About Thriller Bark",
      "platform": "Ranker",
      "accessedAt": "2025-11-25"
    },
    "postedDate": "2008-2025",
    "episodeRange": [355, 1200],
    "minEpisode": 355,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1200
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["oars"],
    "relatedLocations": [],
    "relatedEvents": ["ep355-event-007"],
    "tags": ["oars", "world-building", "ancient-history", "elbaf", "giants"]
  },
  {
    "id": "theory-ep355-003",
    "title": "Shadow Transfer Limitations Hint at Devil Fruit Soul Theory",
    "summary": "The revelation that Devil Fruit powers don't transfer with shadows supports the theory that Devil Fruits bind to the soul/body, not just personality.",
    "fullText": "Episode 355 establishes a crucial piece of world-building: when Luffy's shadow is implanted in Oars, the zombie gains Luffy's personality and memories but NOT his rubber abilities. This proves that Devil Fruit powers are tied to the physical body (or soul), not to the shadow/personality. This revelation has led to extensive fan theorizing about the true nature of Devil Fruits. Some fans theorize this is evidence that Devil Fruits house 'devil souls' that bind to the user's body permanently, which would explain why powers don't transfer with shadows and why users lose their abilities when they die. This also connects to theories about Blackbeard's ability to steal Devil Fruit powers - if fruits are bound to bodies/souls, Blackbeard might have a unique ability to extract souls or merge multiple souls in one body. The shadow mechanics in Thriller Bark provided early evidence for these later theories about Devil Fruit mechanics.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_355",
      "title": "Episode 355 - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-11-25"
    },
    "postedDate": "2008-2025",
    "episodeRange": [355, 1200],
    "minEpisode": 355,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1200
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["oars", "luffy", "gecko-moria", "blackbeard"],
    "relatedLocations": ["thriller-bark"],
    "relatedEvents": ["ep355-event-009"],
    "tags": ["devil-fruits", "world-building", "kage-kage-no-mi", "blackbeard", "mechanics"]
  }
]
