[
  {
    "name": {
      "english": "Jewel Ice Sheet",
      "japanese": "宝石氷山",
      "romanized": "Hōseki Hyōzan",
      "aliases": ["Crystal Ice Sheet"]
    },
    "debutEpisode": 649,
    "debutChapter": 719,
    "episodeAppearances": [649],
    "locationType": "ICE_CONTINENT",
    "region": "Unknown",
    "sea": "Unknown",
    "island": "Unknown",
    "keyMoments": [
      {
        "episodeNumber": 649,
        "eventId": "ep649-event-002",
        "momentType": "FIRST_APPEARANCE",
        "title": "Jewel Ice Sheet Revealed in Flashback",
        "description": "The Jewel Ice Sheet is shown in flashback as a massive ice continent that protects Don Chinjao's clan treasure vault. Only Chinjao's drill-shaped head was capable of piercing through the thick ice.",
        "significance": "Establishes this location as the repository of the Chinjao family's accumulated wealth spanning several hundred years.",
        "timestamp": "05:30",
        "quote": "The key to getting into the room is my drill head."
      },
      {
        "episodeNumber": 649,
        "eventId": "ep649-event-004",
        "momentType": "LOCATION_ARRIVAL",
        "title": "Chinjao's Failed Return",
        "description": "After his drill head is flattened by Garp, Chinjao returns to the Jewel Ice Sheet but can no longer break through the ice to access his treasure.",
        "significance": "Demonstrates the unique properties of this ice formation and how it requires specific abilities to penetrate.",
        "timestamp": "11:20",
        "quote": ""
      }
    ],
    "affiliatedCrews": ["happo-navy"],
    "residents": [],
    "historicalEvents": [
      {
        "event": "Chinjao used his drill head to access treasure vault",
        "episodeNumber": 649,
        "description": "For years, Chinjao would pierce the Jewel Ice Sheet with his drill head to access his clan's accumulated treasure."
      },
      {
        "event": "Chinjao loses access after defeat by Garp",
        "episodeNumber": 649,
        "description": "After Garp flattened his head, Chinjao could no longer penetrate the ice, losing access to his treasure forever."
      }
    ],
    "geography": "A massive ice continent or ice formation that protects a treasure vault beneath it. The ice is extremely thick and durable, requiring tremendous force to penetrate.",
    "culture": "Serves as the treasure repository for the Chinjao family and the Happo Navy.",
    "climate": "Frozen, icy environment",
    "status": "ACTIVE",
    "statusHistory": [],
    "specialProperties": [
      "Extremely thick and durable ice that requires specialized abilities to penetrate",
      "Contains a treasure vault with several hundred years of accumulated wealth",
      "The ice appears to reseal or maintain its structure even after being pierced"
    ],
    "trivia": [
      "The exact location of the Jewel Ice Sheet has not been revealed in the series",
      "The treasure vault beneath it contains several hundred years worth of the Chinjao family's accumulated wealth"
    ]
  },
  {
    "name": {
      "english": "Corrida Colosseum",
      "japanese": "コリーダコロシアム",
      "romanized": "Korīda Koroshiamu",
      "aliases": []
    },
    "debutEpisode": 632,
    "debutChapter": 704,
    "episodeAppearances": [649],
    "locationType": "ARENA",
    "region": "Dressrosa",
    "sea": "New World",
    "island": "Dressrosa",
    "keyMoments": [
      {
        "episodeNumber": 649,
        "eventId": "ep649-event-007",
        "momentType": "BATTLE_END",
        "title": "Block C Concludes",
        "description": "The Block C battle of the Corrida Colosseum tournament concludes with Lucy (Luffy) defeating Don Chinjao. The platform breaks into two pieces from the impact of Chinjao's fall.",
        "significance": "Marks the completion of Block C and advances the tournament to its next phase.",
        "timestamp": "19:45",
        "quote": "Lucy is declared the winner of Block C!"
      }
    ],
    "affiliatedCrews": [],
    "residents": [],
    "historicalEvents": [],
    "geography": "A large circular gladiatorial arena with spectator stands surrounding the central fighting platform.",
    "culture": "Host to tournaments and gladiatorial combat, including the current tournament for the Mera Mera no Mi.",
    "climate": "Tropical",
    "status": "ACTIVE",
    "statusHistory": [],
    "specialProperties": [
      "Large fighting platform that can be damaged or destroyed during intense battles",
      "Capable of holding thousands of spectators"
    ],
    "trivia": []
  }
]
