[
  {
    "id": "ep438-worldbuilding-001",
    "category": "LOCATION",
    "title": "Level 5.5 - A Hidden Floor in Impel Down",
    "description": "Reveals the existence of Level 5.5 (New Kama Land), a secret level between Level 5 and Level 6 of Impel Down that has existed for over 100 years. It was created by a prisoner with the Push-Push Fruit and has secret passageways to every level above it.",
    "episodeNumber": 438,
    "significance": "Demonstrates that even the World Government's most secure facility has massive blind spots. Shows that prisoners have been escaping Impel Down's detection for over a century, undermining the prison's reputation as inescapable.",
    "relatedLocations": ["impel-down-level-5-5", "impel-down"],
    "relatedCharacters": ["emporio-ivankov", "inazuma"],
    "relatedEvents": ["ep438-event-007", "ep438-event-009"],
    "worldImpact": "Changes the understanding of Impel Down's security and reveals that the 'demoned away' prisoners were actually rescued by the New Kama Land community."
  },
  {
    "id": "ep438-worldbuilding-002",
    "category": "CREATURE",
    "title": "Army Wolves of Level 5",
    "description": "The Army Wolves are vicious predators that were moved from Level 2 to Level 5 because they were too dangerous - they hunted and ate the other guardian beasts including the Basilisk and Sphinx.",
    "episodeNumber": 438,
    "significance": "Expands the understanding of Impel Down's security system and the dangerous creatures that guard different levels.",
    "relatedLocations": ["impel-down-level-5", "impel-down-level-2"],
    "relatedCharacters": ["luffy", "bentham"],
    "relatedEvents": ["ep438-event-004", "ep438-event-005"],
    "worldImpact": "Shows the extreme measures Impel Down takes to prevent escapes, and the hierarchy of dangerous creatures within the prison."
  },
  {
    "id": "ep438-worldbuilding-003",
    "category": "ORGANIZATION",
    "title": "Revolutionary Army Presence in Impel Down",
    "description": "Reveals that the Revolutionary Army has had a presence in Impel Down through Emporio Ivankov and Inazuma, who have been operating New Kama Land as a sanctuary.",
    "episodeNumber": 438,
    "significance": "Shows the Revolutionary Army's reach and influence, operating a hidden base within the World Government's most secure prison.",
    "relatedLocations": ["impel-down-level-5-5"],
    "relatedCharacters": ["emporio-ivankov", "inazuma"],
    "relatedOrganizations": ["revolutionary-army"],
    "relatedEvents": ["ep438-event-008"],
    "worldImpact": "Establishes that the Revolutionary Army has been undermining the World Government's prison system for years, harboring escaped prisoners."
  },
  {
    "id": "ep438-worldbuilding-004",
    "category": "SOCIETY",
    "title": "Okama/Newkama Culture in One Piece",
    "description": "New Kama Land serves as a haven for the okama/newkama community, with its own culture, society, and support system. It's ruled by Emporio Ivankov, the 'Okama King' and former Queen of Kamabakka Kingdom.",
    "episodeNumber": 438,
    "significance": "Expands the understanding of gender and sexuality in the One Piece world, showing diverse communities and identities.",
    "relatedLocations": ["impel-down-level-5-5"],
    "relatedCharacters": ["emporio-ivankov", "bentham", "inazuma", "francois", "tsunokkov", "usakkov"],
    "relatedEvents": ["ep438-event-007", "ep438-event-010"],
    "worldImpact": "Establishes the okama/newkama as an important cultural group in One Piece with their own kingdoms, leaders, and communities."
  },
  {
    "id": "ep438-worldbuilding-005",
    "category": "POWER_SYSTEM",
    "title": "Conqueror's Haki Manifestation While Unconscious",
    "description": "Demonstrates that Conqueror's Haki can manifest even when the user is unconscious and severely weakened, triggered by emotional desperation and the will to protect others.",
    "episodeNumber": 438,
    "significance": "Expands understanding of how Haki works, showing it's deeply connected to willpower and can activate instinctively.",
    "relatedCharacters": ["luffy"],
    "relatedEvents": ["ep438-event-005"],
    "worldImpact": "Reinforces that Conqueror's Haki is an innate quality tied to a person's fundamental nature and willpower, not just a consciously controlled ability."
  }
]
