[
  {
    "id": "theory-ep391-001",
    "title": "The D. Clan Were Former Slaves of the Celestial Dragons",
    "summary": "The 'D' initial may represent the Japanese word for 'slave' (奴隷, dorei), suggesting that the Will of D. carriers descend from people who were enslaved during the Void Century and stood against the Celestial Dragons.",
    "fullText": "This theory proposes that the D. initial represents a group of people in the Void Century who stood against the Celestial Dragons, and that Eiichiro Oda used the D. to signify the Japanese word for 'slave' (奴隷, dorei). This would mean those who hold the Will of D continuously carry a reminder of what their ancestors once were, to remind them to endlessly strive for freedom. The theory gains support from the fact that D. clan members have frequently demonstrated animosity toward the World Nobles and an inclination to oppose them despite their great status, and the Celestial Dragons' stated goal includes destroying the Will of D. once and for all.",
    "author": "Various One Piece fans",
    "source": {
      "url": "https://www.cbr.com/one-piece-theory-d-clan-former-slaves-celestial-dragons/",
      "title": "One Piece Theory: The D. Clan Were Former Slaves of the Celestial Dragons",
      "platform": "CBR",
      "accessedAt": "2025-12-04"
    },
    "postedDate": "2024-01-01",
    "episodeRange": [1, 1100],
    "minEpisode": 391,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["luffy", "devil-dias", "saint-rosward", "saint-shalria"],
    "relatedLocations": ["sabaody-archipelago"],
    "relatedEvents": ["ep391-event-003", "ep391-event-006"],
    "tags": ["will-of-d", "slavery", "celestial-dragons", "void-century", "etymology"]
  },
  {
    "id": "theory-ep391-002",
    "title": "The D. Clan Are Breakaway Celestial Dragons",
    "summary": "An alternative theory suggesting that the original people of the D. were a branch of the Celestial Dragons who broke away to stand against their peers when they became hypocrites and cruel.",
    "fullText": "This theory posits that the original people of the D. could be a branch of the Celestial Dragons themselves. Once the alliance was formed and the royals began to act like hypocrites and cruel people, a section of the Celestial Dragons could have broken off in order to stand against their peers. This would explain why D. clan members are considered 'natural enemies' of the Celestial Dragons - they were once part of the same group but chose to oppose the corruption and cruelty. The theory also explains why the Celestial Dragons specifically target the Will of D. for destruction.",
    "author": "FandomWire Editorial",
    "source": {
      "url": "https://fandomwire.com/one-piece-theory-luffy-is-a-celestial-dragon/",
      "title": "One Piece Theory: Luffy Is a Celestial Dragon",
      "platform": "FandomWire",
      "accessedAt": "2025-12-04"
    },
    "postedDate": "2023-01-01",
    "episodeRange": [1, 1100],
    "minEpisode": 391,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["luffy", "saint-rosward", "saint-shalria"],
    "relatedLocations": [],
    "relatedEvents": ["ep391-event-005"],
    "tags": ["will-of-d", "celestial-dragons", "void-century", "origins"]
  },
  {
    "id": "theory-ep391-003",
    "title": "Luffy's Punch Foreshadows Kuma's Faith and Future Actions",
    "summary": "The foreshadowing in Episode 391 of Luffy's inability to restrain himself sets up his eventual punch of Saint Charlos, which becomes the moment Kuma believes Luffy can save the world.",
    "fullText": "This theory examines how Episode 391's scene where Hatchan stops Luffy from attacking the Celestial Dragons serves as crucial foreshadowing. When Luffy eventually does punch Saint Charlos in Episode 396, it becomes a pivotal moment not just for the story but for Kuma's faith in Luffy. According to chapter #1102, Kuma started to believe that Luffy could become a hero capable of saving the world after witnessing Luffy punch Saint Charlos - someone willing to stand up to the greatest power in the world for what's right. The tension built in Episode 391, where Luffy wants to intervene but is stopped, makes the eventual punch even more significant. This moment also parallels when Luffy punched Arlong, suggesting Oda intentionally draws parallels between Luffy standing up to oppressors.",
    "author": "u/Comprehensive_Cup497 and ScreenRant Analysis",
    "source": {
      "url": "https://screenrant.com/one-piece-kuma-punch-saturn-luffy-celestial-dragon-sabaody/",
      "title": "The Perfect Callback - Luffy's Biggest One Piece Moment Returns With an Epic Twist",
      "platform": "ScreenRant",
      "accessedAt": "2025-12-04"
    },
    "postedDate": "2024-01-15",
    "episodeRange": [391, 1103],
    "minEpisode": 391,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1103
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["luffy", "hatchan", "saint-shalria"],
    "relatedLocations": ["sabaody-archipelago"],
    "relatedEvents": ["ep391-event-007"],
    "tags": ["foreshadowing", "kuma", "character-development", "callbacks", "luffy"]
  },
  {
    "id": "theory-ep391-004",
    "title": "The Hoof of the Soaring Dragon Connects Multiple Characters",
    "summary": "The slave branding introduced in this arc connects various characters throughout the series and reveals hidden backstories of major characters.",
    "fullText": "The 'Hoof of the Soaring Dragon' slave brand introduced when we see Devil Dias and other slaves in Episode 391 becomes a crucial plot element that connects multiple storylines. The brand marks slaves as 'less than human' and is used by Celestial Dragons to mark their property. This same brand later reveals that several major characters, including Boa Hancock and her sisters, were former slaves of the Celestial Dragons. The brand serves as both a symbol of oppression and a motivation for characters to fight against the World Government. Fans theorize that the brand's design and symbolism may have deeper meaning related to the ancient history of the world and the origins of the Celestial Dragons' power.",
    "author": "Various One Piece Wiki Contributors and Fans",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Slavery",
      "title": "Slavery - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-04"
    },
    "postedDate": "2023-01-01",
    "episodeRange": [391, 900],
    "minEpisode": 391,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 521
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["devil-dias", "jean-bart", "saint-rosward"],
    "relatedLocations": ["sabaody-archipelago"],
    "relatedEvents": ["ep391-event-003", "ep391-event-008"],
    "tags": ["slavery", "hoof-of-the-soaring-dragon", "backstory", "celestial-dragons", "symbolism"]
  }
]
