[
  {
    "name": {
      "english": "Pet-Pet Fruit",
      "japanese": "ペトペトの実",
      "romanized": "Peto Peto no Mi"
    },
    "type": "Paramecia",
    "debutEpisode": 626,
    "debutChapter": null,
    "episodeAppearances": [626],
    "currentUser": "breed",
    "previousUsers": [],
    "status": "ACTIVE",
    "canon": false,
    "abilities": [
      {
        "abilityName": "Living Creature Control",
        "description": "Allows the user to create green gel-like collars that can be placed on any living creature, granting absolute control over them through verbal commands.",
        "episodeFirstShown": 626,
        "limitations": [
          "Victims must be able to hear the user's commands for the control to work",
          "Victims retain consciousness and awareness while under control",
          "Strong-willed individuals may be able to resist commands",
          "All collars disappear if the user loses consciousness",
          "Collars can be dodged by fast opponents"
        ]
      },
      {
        "abilityName": "Power Amplification",
        "description": "The collars can unlock and amplify the full potential of controlled creatures, forcing them to use their maximum power.",
        "episodeFirstShown": 626,
        "limitations": []
      },
      {
        "abilityName": "Self-Enhancement",
        "description": "The user can place a collar on themselves to enhance their own physical abilities. When self-applied, the collar glows bright red.",
        "episodeFirstShown": 626,
        "limitations": []
      }
    ],
    "weaknesses": [
      {
        "weakness": "Auditory Dependency",
        "description": "Commands only work if victims can hear them. Earplugs or soundproof barriers can completely nullify the control.",
        "episodeRevealed": 626
      },
      {
        "weakness": "User Consciousness",
        "description": "If the user loses consciousness, all active collars immediately shatter and disappear, freeing all controlled victims.",
        "episodeRevealed": 627
      },
      {
        "weakness": "Standard Devil Fruit Weaknesses",
        "description": "The user is vulnerable to seawater and Seastone, though the collars themselves can function underwater.",
        "episodeRevealed": 626
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 626,
        "eventId": "ep626-event-004",
        "title": "Peto Peto no Mi Powers Revealed",
        "description": "Breed demonstrates his Devil Fruit ability for the first time by placing control collars on Chopper and forcing him into Monster Point.",
        "significance": "Establishes the primary threat of the Caesar Retrieval Arc."
      },
      {
        "episodeNumber": 626,
        "eventId": "ep626-event-007",
        "title": "Controls Multiple Powerful Fighters",
        "description": "Breed successfully places collars on both Luffy and Law, demonstrating his ability to control even strong opponents.",
        "significance": "Shows that the fruit's power can affect even high-level combatants."
      }
    ],
    "trivia": [
      "The name 'Peto Peto' comes from the Japanese onomatopoeia for the sound of patting or petting an animal.",
      "Luffy mistakenly identifies this power as belonging to a 'slime human' because it sounds like 'petopeto' (sticky), which coincidentally foreshadows Trebol's Beta Beta no Mi.",
      "This is an anime-only Devil Fruit and is not considered canon to the manga storyline.",
      "Despite being a Paramecia fruit about controlling pets, it works equally well on humans, making its name somewhat misleading."
    ]
  }
]
