[
  {
    "id": "theory-ep626-001",
    "title": "Animals Can Achieve Haki Through Strong Will",
    "summary": "The Kung Fu Dugong's mastery of Armament Haki suggests that any living being with sufficient willpower and training can learn Haki, not just humanoids.",
    "fullText": "Episode 626 reveals that the Kung Fu Dugong has learned Armament Haki, making it the second animal shown using this ability in the series. This has led fans to theorize that Haki is not limited to humanoid species but can be achieved by any creature with sufficient intelligence and willpower. The dugong's motivation came from being inspired by Luffy's words about freedom and pursuing dreams. This suggests that the mental and emotional components of Haki training may be more important than physical humanoid characteristics. Some fans speculate that this could mean other intelligent animals like Sea Kings might also be capable of using Haki, which could have implications for the series' endgame revelations about ancient weapons and the Voice of All Things.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Sea_Animal_Pirates",
      "title": "Sea Animal Pirates - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2026-01-10"
    },
    "postedDate": "2013-12-22",
    "episodeRange": [626, 628],
    "minEpisode": 626,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 628
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["kung-fu-dugong", "luffy"],
    "relatedLocations": [],
    "relatedEvents": ["ep626-event-003", "ep626-event-011"],
    "tags": ["haki", "animals", "kung-fu-dugong", "willpower", "anime-original"]
  },
  {
    "id": "theory-ep626-002",
    "title": "Breed's Devil Fruit Foreshadows Control Themes",
    "summary": "The Peto Peto no Mi's control abilities in this filler arc may have been created to foreshadow later canon storylines involving mind control and loss of free will.",
    "fullText": "Some fans theorize that the anime staff created Breed's Peto Peto no Mi ability as subtle foreshadowing for future canon storylines involving control and manipulation of others. The themes of forced obedience while retaining consciousness mirrors elements that appear in later arcs, such as Sugar's Hobi Hobi no Mi (which erases memories while keeping victims aware), Big Mom's ability to control homies, and potentially Imu's mysterious powers. The arc's emphasis on the value of freedom and the horror of losing autonomy despite being conscious could have been an intentional thematic setup by the anime team. Additionally, Luffy's mistaken identification of Breed's power as 'slime' accidentally foreshadowed Trebol's sticky Beta Beta no Mi, suggesting the anime staff may have had advance knowledge of upcoming manga content.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Peto_Peto_no_Mi",
      "title": "Peto Peto no Mi - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2026-01-10"
    },
    "postedDate": "2014-01-15",
    "episodeRange": [626, 900],
    "minEpisode": 626,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 900
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["breed", "luffy"],
    "relatedLocations": [],
    "relatedEvents": ["ep626-event-004", "ep626-event-013"],
    "tags": ["devil-fruit", "foreshadowing", "themes", "control", "freedom"]
  },
  {
    "id": "theory-ep626-003",
    "title": "The Kung Fu Dugong Will Return in Canon Story",
    "summary": "Fans hope that the Kung Fu Dugong's growth and Haki mastery shown in this filler arc will eventually be acknowledged or incorporated into the main canon storyline.",
    "fullText": "After seeing the Kung Fu Dugong's impressive development from a simple desert creature in Alabasta to a Haki-using pirate captain in the New World, many fans have expressed hope that this character growth will somehow be acknowledged in the canon manga or future anime episodes. The character represents one of the most successful anime-original continuations of a canon character's story. Some fans theorize that if Oda ever returns to Alabasta or needs to show the growth of Luffy's influence on the world, he might incorporate elements of this story, perhaps having the dugongs defend Alabasta using Haki or appearing as allies during a major battle. The character has become popular enough that fans consider it one of the best examples of anime filler done right, and many believe it deserves to be canonized.",
    "author": "CBR and Fan Community",
    "source": {
      "url": "https://www.cbr.com/one-piece-haki-users-fans-wish-canon/",
      "title": "Haki Users One Piece Fans Wish Were Canon",
      "platform": "CBR",
      "accessedAt": "2026-01-10"
    },
    "postedDate": "2023-06-20",
    "episodeRange": [96, 626],
    "minEpisode": 96,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 628
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "FAN_WISH",
    "relatedCharacters": ["kung-fu-dugong", "luffy"],
    "relatedLocations": [],
    "relatedEvents": ["ep626-event-003", "ep626-event-011"],
    "tags": ["kung-fu-dugong", "canonization", "fan-favorite", "character-development"]
  }
]
