[
  {
    "id": "theory-ep036-001",
    "title": "Bellemere's Sacrifice Was a Mistake",
    "summary": "Some fans argue that Bellemere's decision to acknowledge Nami and Nojiko was foolish because Arlong didn't know about them, and by revealing their existence, she condemned them to a worse fate than if she had hidden them.",
    "fullText": "A controversial theory among fans is that Bellemere made the wrong choice. The argument goes: Arlong didn't know Nami and Nojiko existed. If Bellemere had hidden them or temporarily denied them, she could have paid for herself, survived, and protected them afterwards. Instead, by going out of her way to tell Arlong she had two daughters, she not only got herself killed but also marked the beginning of the worst phase in Nami's life - eight years of servitude to her mother's murderer. While the sacrifice shows her love, the practical outcome was devastating for everyone involved. Critics argue that protecting them quietly would have been more loving than a public declaration that led to trauma and imprisonment.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://www.indiatodaygaming.com/anime/story/bellemeres-sacrifice-in-one-piece-still-brings-confusions-among-fans-9500",
      "title": "Bellemere's Sacrifice in One Piece Still Brings Confusions Among Fans",
      "platform": "India Today Gaming",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "Unknown",
    "episodeRange": [36, 44],
    "minEpisode": 36,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 44
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "DEBATED",
    "relatedCharacters": ["bellemere", "nami", "nojiko", "arlong"],
    "relatedLocations": ["bellemere-house", "cocoyasi-village"],
    "relatedEvents": ["ep036-event-003", "ep036-event-005"],
    "tags": ["bellemere", "sacrifice", "controversial", "morality", "parenting"]
  },
  {
    "id": "theory-ep036-002",
    "title": "Bellemere's Sacrifice Was About Identity and Love",
    "summary": "Defenders argue that Bellemere's decision, while tragic, was the only choice that honored her daughters' existence and gave them the knowledge that they were truly loved and valued as family.",
    "fullText": "The counter-argument to criticism of Bellemere is that her sacrifice was fundamentally about love and identity, not tactical survival. By sacrificing herself and accepting Nami and Nojiko as her daughters even in the face of death, Bellemere made sure her daughters realized their significance in her life. It wasn't a foolish act; it was her way to show love and acceptance to the girls she called her family. If she had denied them to survive, what message would that have sent? That family is only real when it's convenient? That their bond could be erased for money? Bellemere chose to validate their family bond even at the cost of her life, giving Nami and Nojiko an unshakeable foundation of knowing they were truly loved. This knowledge became their strength through the dark years that followed. While she couldn't protect them from pain, she gave them something more important - the certainty that they mattered, that they were family, no matter what.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://fandomwire.com/one-piece-the-hate-against-namis-mother-bellemere-is-unjustified/",
      "title": "One Piece: The Hate Against Nami's Mother Bellemere is Unjustified",
      "platform": "FandomWire",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "Unknown",
    "episodeRange": [36, 44],
    "minEpisode": 36,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 44
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "DEBATED",
    "relatedCharacters": ["bellemere", "nami", "nojiko"],
    "relatedLocations": ["bellemere-house"],
    "relatedEvents": ["ep036-event-003", "ep036-event-005"],
    "tags": ["bellemere", "sacrifice", "love", "family", "identity", "themes"]
  },
  {
    "id": "theory-ep036-003",
    "title": "Arlong Always Planned to Betray Nami",
    "summary": "The fact that Nezumi arrives to steal Nami's treasure in episode 36 suggests Arlong never intended to honor his deal, and planned from the beginning to keep Nami enslaved forever.",
    "fullText": "Episode 36 strongly implies that Arlong's promise to sell the village back for 100 million berries was always a lie. The fact that he tips off the corrupt Marine Captain Nezumi to confiscate Nami's savings just as she's about to reach her goal proves this wasn't a one-time betrayal - it was premeditated. Arlong likely planned from the moment he recruited young Nami that he would never let her go. She was too valuable as a cartographer. The '100 million berries' deal was just a way to keep her motivated and working hard for him. Every time she got close, he could manufacture a reason to take it away and reset the counter. The corruption of Nezumi wasn't a backup plan; it was always part of Arlong's system of control. This makes Bellemere's sacrifice even more tragic - no matter what choice she made, Arlong was going to destroy their family.",
    "author": "One Piece Analysts",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_36",
      "title": "Episode 36 | One Piece Wiki | Fandom",
      "platform": "Fandom",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "Unknown",
    "episodeRange": [36, 37],
    "minEpisode": 36,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 44
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "WIDELY_ACCEPTED",
    "relatedCharacters": ["arlong", "nami", "nezumi"],
    "relatedLocations": ["arlong-park", "cocoyasi-village"],
    "relatedEvents": ["ep036-event-006", "ep036-event-009", "ep036-event-010"],
    "tags": ["arlong", "betrayal", "manipulation", "nami", "nezumi", "corruption"]
  }
]
