[
  {
    "theoryTitle": "Hiriluk's Cherry Blossoms Were on God Valley",
    "theoryText": "Dr. Hiriluk stated he was cured of his deadly disease by seeing cherry blossoms on a mountain in 'a faraway land in the West.' Since Chapter 1095 confirmed that God Valley was in the West Blue, the theory proposes that Hiriluk witnessed cherry blossoms on God Valley. Furthermore, cherry blossoms may symbolize liberation/revolution in One Piece, as Chapter 1095 is titled 'Skull and Cherry Blossoms' and introduces Dragon and the Revolutionary Army. The miraculous 'cure' Hiriluk experienced may have been witnessing an act of liberation or revolution that cleansed his soul and changed his life path from thief to healer.",
    "theorist": "Multiple fans on Worstgen forum and other platforms",
    "source": "https://worstgen.alwaysdata.net/forum/threads/god-valley-was-the-island-of-hiriluks-cherry-blossoms.55488/",
    "platform": "Worstgen Forum",
    "dateProposed": "Unknown",
    "episodeRange": [85, 1095],
    "spoilerWarning": true,
    "spoilersUpToEpisode": 1095,
    "popularity": "MODERATE",
    "supportingEvidence": [
      "Hiriluk specifically mentions the cherry blossoms were in the West",
      "God Valley was confirmed to be in West Blue in Chapter 1095",
      "Chapter 1095 is titled 'Skull and Cherry Blossoms' and introduces Revolutionary themes",
      "Cherry blossoms appear to have symbolic importance beyond simple flowers in the One Piece world",
      "The 'cure' Hiriluk experienced transformed him from a criminal to someone dedicated to healing others"
    ],
    "counterArguments": [
      "God Valley was destroyed/disappeared after the incident, so timeline may not match",
      "The connection may be coincidental rather than intentional",
      "Other islands in West Blue could have cherry blossoms"
    ],
    "relatedCharacters": ["hiriluk"],
    "relatedLocations": ["god-valley"],
    "tags": ["symbolism", "God Valley", "cherry blossoms", "Revolutionary Army", "West Blue"]
  },
  {
    "theoryTitle": "Rocks D. Xebec Became Dr. Hiriluk",
    "theoryText": "An extreme theory proposing that Rocks D. Xebec survived the God Valley Incident and, after experiencing something transformative (possibly related to cherry blossoms), completely changed his way of life. According to this theory, Rocks abandoned his ambitions of conquest and became Dr. Hiriluk, a man dedicated to healing people's hearts on Drum Island. The theory points to both characters having similar philosophies about legacy and dreams, and suggests that Hiriluk's statements about death and being forgotten reflect someone who faked their death and took a new identity.",
    "theorist": "Birds of Hermes blog",
    "source": "https://birdsofherme.wordpress.com/2023/11/01/one-piece-10th-theory-dr-hiriluk-was-rocks-d-xebec-contains-spoilers-1096/",
    "platform": "WordPress Blog",
    "dateProposed": "2023-11-01",
    "episodeRange": [85, 1096],
    "spoilerWarning": true,
    "spoilersUpToEpisode": 1096,
    "popularity": "LOW",
    "supportingEvidence": [
      "Both characters have strong philosophies about legacy and being remembered",
      "Hiriluk's past as a thief could align with a reformed pirate",
      "Timeline could potentially work if Rocks survived God Valley",
      "Hiriluk's famous quote about death could reference someone who faked their death"
    ],
    "counterArguments": [
      "No concrete evidence connecting the two characters",
      "Hiriluk's age and appearance don't match what Rocks would likely be",
      "The theory requires massive assumptions about Rocks' survival",
      "Hiriluk's character arc works perfectly well without this connection",
      "Oda has not hinted at any connection between these characters"
    ],
    "relatedCharacters": ["hiriluk", "rocks-d-xebec"],
    "relatedLocations": ["god-valley", "drum-island"],
    "tags": ["identity theory", "Rocks", "God Valley", "extreme theory"]
  },
  {
    "theoryTitle": "Cherry Blossoms as Revolutionary Symbolism",
    "theoryText": "Cherry blossoms in One Piece represent more than just flowers - they symbolize revolution, liberation, and the transformation of society. Hiriluk's 30-year dream to make cherry blossoms bloom in Drum Kingdom's eternal winter represents a revolutionary desire to liberate the country from its frozen, oppressed state under Wapol's tyranny. The theory suggests that cherry blossoms consistently appear in One Piece at moments of liberation or revolutionary change, and that Hiriluk understood this symbolism from his own transformative experience. When the cherry blossom powder finally fills the sky in Episode 90, it represents not just Hiriluk's dream but the liberation of Drum Kingdom itself.",
    "theorist": "Multiple fan analysts across platforms",
    "source": "https://medium.com/@antiel.art/the-mystery-of-the-d-and-the-cherry-blossoms-symbolic-and-esoteric-analysis-of-one-piece-volume-321926f53b91",
    "platform": "Medium",
    "dateProposed": "Unknown",
    "episodeRange": [85, 90],
    "spoilerWarning": false,
    "spoilersUpToEpisode": 91,
    "popularity": "HIGH",
    "supportingEvidence": [
      "Hiriluk explicitly states cherry blossoms can 'cure the hearts' of people",
      "The cherry blossoms bloom immediately after Wapol is defeated and the kingdom is liberated",
      "Drum Kingdom is renamed Sakura Kingdom (Cherry Blossom Kingdom) after gaining freedom",
      "Cherry blossoms in Japanese culture represent renewal and the transient nature of life",
      "The visual of pink snow filling the sky represents transformation of the entire kingdom"
    ],
    "counterArguments": [
      "Cherry blossoms have traditional Japanese symbolism that may not extend to revolutionary themes",
      "The connection may be thematic rather than a deliberate symbolic system",
      "Not all instances of liberation in One Piece involve cherry blossoms"
    ],
    "relatedCharacters": ["hiriluk", "chopper", "wapol"],
    "relatedLocations": ["drum-island", "sakura-kingdom"],
    "tags": ["symbolism", "cherry blossoms", "revolution", "liberation", "themes"]
  },
  {
    "theoryTitle": "Hiriluk as Anarchist Revolutionary Figure",
    "theoryText": "A Tumblr analysis proposes that Dr. Hiriluk represents an anarchist revolutionary figure whose ideas about healing society and rejecting authority inspire others to resist tyranny. According to this theory, Hiriluk's medical practice outside the system, his rejection of payment, and his philosophy about curing hearts rather than just bodies all represent anarchist principles. The theory notes that Hiriluk's death and ideals directly inspire Dalton to formally reject King Wapol, suggesting that revolutionary ideas are portrayed as 'infectious' threats to authoritarian systems. Chopper carrying on Hiriluk's will represents the spread of revolutionary consciousness across generations.",
    "theorist": "Tumblr user mmmmalo",
    "source": "https://www.tumblr.com/mmmmalo/616343055840296960/thoughts-on-drum-island-forgive-me-if-i-bury-my",
    "platform": "Tumblr",
    "dateProposed": "Unknown",
    "episodeRange": [85, 90],
    "spoilerWarning": false,
    "spoilersUpToEpisode": 91,
    "popularity": "MODERATE",
    "supportingEvidence": [
      "Hiriluk operates outside the medical establishment and refuses payment",
      "His philosophy challenges the idea that only the powerful deserve medical care",
      "Dalton's revolution against Wapol is directly inspired by Hiriluk's example",
      "Hiriluk's death becomes more powerful than his life, spreading his ideals",
      "The X mark on Chopper's hat can be seen as a symbol of resistance"
    ],
    "counterArguments": [
      "Hiriluk is portrayed more as a compassionate eccentric than a deliberate revolutionary",
      "His incompetence as a doctor complicates reading him as a purely positive figure",
      "The anarchist interpretation may impose modern political frameworks on the story"
    ],
    "relatedCharacters": ["hiriluk", "chopper", "dalton", "wapol"],
    "relatedLocations": ["drum-island"],
    "tags": ["political theory", "anarchism", "revolution", "symbolism", "character analysis"]
  }
]
