[
  {
    "name": {
      "english": "Isshi-20",
      "japanese": "医師20",
      "romanized": "Isshi-Nijū"
    },
    "organizationType": "MEDICAL_GROUP",
    "debutEpisode": 85,
    "debutChapter": 141,
    "description": "A group of twenty doctors in Drum Kingdom who were captured and forced into servitude during Wapol's Doctor Hunt. These physicians were imprisoned in Drum Castle and made to serve exclusively the royal family and nobility, leaving ordinary citizens without medical care. Despite their captivity, they continued perfecting their medical skills.",
    "episodeAppearances": [85],
    "leaderIds": ["wapol"],
    "knownMembers": [],
    "keyMoments": [
      {
        "episodeNumber": 85,
        "eventId": "ep085-event-004",
        "momentType": "WORLD_LORE",
        "title": "Isshi-20 Formation During Doctor Hunt",
        "description": "The episode reveals that Wapol captured the kingdom's doctors and forced them to serve only him at the castle, creating the Isshi-20.",
        "significance": "Establishes the oppressive medical situation in Drum Kingdom and explains why citizens had no access to doctors.",
        "timestamp": "08:20"
      }
    ],
    "structure": {
      "hierarchy": ["King Wapol (Captor)", "Twenty Imprisoned Doctors"],
      "purpose": "Serve exclusively the royal family and nobility of Drum Kingdom"
    },
    "baseLocations": ["drum-castle"],
    "goals": [
      {
        "goal": "Perfect medical skills while in captivity",
        "episodeRevealed": 85,
        "description": "Despite being imprisoned, the doctors continued to advance their medical knowledge for the betterment of the people."
      }
    ],
    "allies": [],
    "enemies": [],
    "status": "ACTIVE",
    "statusHistory": [
      {
        "status": "ACTIVE",
        "episodeStart": 85,
        "episodeEnd": "present",
        "description": "Group is imprisoned in Drum Castle serving Wapol"
      }
    ],
    "secrets": [],
    "context": {
      "formation": "Created during the Doctor Hunt when Wapol ordered the capture of all doctors in Drum Kingdom",
      "purpose": "Wapol's strategy to control the population by monopolizing medical care",
      "resistance": "Only two doctors escaped the hunt: Dr. Hiriluk and Dr. Kureha",
      "laterDevelopment": "After Wapol's defeat, the Isshi-20 would later expand to become the Isshi-100"
    },
    "images": []
  }
]
