[
  {
    "id": "theory-ep421-001",
    "title": "Kuma's Intentional Placement Theory",
    "theory": "Bartholomew Kuma didn't randomly send the Straw Hats to different locations. He specifically chose places where each member could grow stronger and survive. Sending Zoro to Kuraigana Island (where Mihawk lives) and Perona (who can weaken opponents) was strategic for Zoro's development.",
    "author": "One Piece Fan Community",
    "platform": "General Fan Theory",
    "episodeRange": [405, 421, 517],
    "spoilerSeverity": "MAJOR",
    "containsSpoilersBeyond": 421,
    "maxEpisodeSpoiled": 517,
    "evidence": [
      "Kuma knew about Zoro's goal to become the world's greatest swordsman",
      "Kuraigana Island is Mihawk's residence, the current greatest swordsman",
      "Each Straw Hat ended up in a location that helped them develop their skills during the timeskip"
    ],
    "status": "CONFIRMED",
    "popularity": "HIGH",
    "dateProposed": "2009-10-11",
    "sources": [
      {
        "url": "https://onepiece.fandom.com/wiki/Bartholomew_Kuma",
        "title": "Bartholomew Kuma - One Piece Wiki",
        "platform": "Fandom"
      }
    ]
  },
  {
    "id": "theory-ep421-002",
    "title": "Garp Could Have Saved Ace Theory",
    "theory": "Some fans theorize that Garp could have saved Ace if he truly wanted to, given his legendary status and power. The scene in episode 421 where Garp refuses to kill Ace sparked debates about whether Garp's loyalty to the Marines outweighed his love for his grandson, or if he knew killing Ace wouldn't stop the war.",
    "author": "One Piece Fan Community",
    "platform": "Reddit, Forums",
    "episodeRange": [421, 483],
    "spoilerSeverity": "CRITICAL",
    "containsSpoilersBeyond": 421,
    "maxEpisodeSpoiled": 483,
    "evidence": [
      "Garp is known as 'The Hero of the Marines' with immense power",
      "Garp's statement that killing Ace wouldn't stop the war",
      "Garp's internal conflict shown throughout the arc"
    ],
    "status": "DEBATED",
    "popularity": "HIGH",
    "dateProposed": "2009-10-11",
    "sources": []
  },
  {
    "id": "theory-ep421-003",
    "title": "Hancock's Love Sickness Won't Fade Theory",
    "theory": "Based on Hancock's behavior in episode 421, fans theorized that her 'love sickness' for Luffy (which killed previous Kuja empresses) would be a permanent condition rather than temporary infatuation. This theory suggested Hancock would remain devoted to Luffy throughout the series.",
    "author": "One Piece Fan Community",
    "platform": "Forums, YouTube",
    "episodeRange": [411, 421],
    "spoilerSeverity": "MINOR",
    "containsSpoilersBeyond": false,
    "maxEpisodeSpoiled": 421,
    "evidence": [
      "Hancock's jealousy over Nami and Robin in episode 421",
      "Previous Kuja empresses died from love sickness",
      "Hancock's willingness to risk everything for Luffy"
    ],
    "status": "CONFIRMED",
    "popularity": "MEDIUM",
    "dateProposed": "2009-10-11",
    "sources": []
  }
]
