[
  {
    "name": {
      "english": "Flame-Flame Fruit",
      "japanese": "メラメラの実",
      "romanized": "Mera Mera no Mi"
    },
    "type": "LOGIA",
    "debutEpisode": 94,
    "debutChapter": 159,
    "description": "A Logia-type Devil Fruit that allows the user to create, control, and transform into fire. The user becomes a fire human with complete control over flames.",
    "episodeAppearances": [629],
    "users": [
      {
        "characterId": "ace",
        "episodeStart": 94,
        "episodeEnd": 483,
        "circumstances": "Ace ate the fruit and used it until his death at Marineford"
      }
    ],
    "abilityReveals": [],
    "keyMoments": [
      {
        "episodeNumber": 629,
        "eventId": "ep629-event-011",
        "momentType": "POWER_REVEAL",
        "title": "Mera Mera no Mi Reappears in Doflamingo's Possession",
        "description": "After Ace's death, the Mera Mera no Mi reincarnated and was acquired by Donquixote Doflamingo. He reveals he possesses it and plans to use it as the prize in the Corrida Colosseum tournament.",
        "significance": "This is the first time we see a Devil Fruit reappear after its user's death. It becomes a major emotional plot point as Luffy must decide whether to pursue his brother's fruit or continue his mission.",
        "timestamp": "20:30"
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim and vulnerability to Sea-Prism Stone",
        "episodeRevealed": 629,
        "severity": "MAJOR"
      }
    ],
    "strengths": [
      {
        "strength": "Complete control over fire, can create and manipulate flames at will",
        "episodeRevealed": 94,
        "description": "As a Logia-type, allows the user to become intangible fire and create devastating flame attacks.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "HIGH",
    "reveals": [
      {
        "infoType": "REINCARNATION",
        "information": "The fruit reincarnated after Ace's death and was obtained by Doflamingo",
        "episodeRevealed": 629,
        "severity": "CRITICAL"
      },
      {
        "infoType": "STATUS",
        "information": "Will be used as prize in Corrida Colosseum tournament",
        "episodeRevealed": 629,
        "severity": "MAJOR"
      }
    ]
  }
]
