[
  {
    "id": "theory-ep455-001",
    "title": "Tequila Wolf's True Purpose: Preparing for Rising Sea Levels",
    "summary": "A theory that the World Government's 700-year construction of massive bridges like Tequila Wolf is preparation for the world's rising sea levels, as later confirmed by Vegapunk's revelations.",
    "fullText": "Fans theorized that the massive bridge construction projects ordered by the World Nobles (Tequila Wolf, Vodka Wolf, Rum Wolf, and Bourbon Wolf) were not arbitrary cruelty but preparation for a global catastrophe. The 700-year timeline suggests the World Government has known about rising sea levels since the Void Century. This theory gained credibility when Emporio Ivankov connected these mega-structures to Vegapunk's discoveries about the world sinking. The bridges may serve as evacuation routes or safe passages between islands as sea levels rise, though the cruel irony is that they're built by enslaved people who may never benefit from them.",
    "author": "One Piece Community",
    "source": {
      "url": "https://gamerant.com/one-piece-oda-finally-reveals-reason-behind-creation-tequila-wolf/",
      "title": "One Piece: Oda Finally Reveals The Reason Behind The Creation Of Tequila Wolf",
      "platform": "GameRant",
      "accessedAt": "2025-12-13"
    },
    "postedDate": "2024-01-01",
    "episodeRange": [420, 1100],
    "minEpisode": 420,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["robin", "vegapunk", "dragon"],
    "relatedLocations": ["tequila-wolf", "vodka-wolf", "rum-wolf", "bourbon-wolf"],
    "relatedEvents": ["ep455-event-003"],
    "tags": ["world-lore", "tequila-wolf", "world-government", "void-century", "rising-sea-levels"]
  },
  {
    "id": "theory-ep455-002",
    "title": "Revolutionary Army's Interest in Robin: Ancient Weapons and World History",
    "summary": "A theory explaining why the Revolutionary Army specifically sought out Robin - they need her ability to read Poneglyphs to uncover the true history and potentially locate ancient weapons to fight the World Government.",
    "fullText": "When Bunny Joe reveals the Revolutionary Army has been searching for Robin, it raises questions about their motives. Fans theorized that Dragon and the Revolutionary Army recognize Robin's unique ability to read Poneglyphs makes her invaluable for their cause. Understanding the true history of the Void Century could expose the World Government's crimes and rally more people to the revolutionary cause. Additionally, the knowledge of ancient weapons' locations could provide the Revolutionary Army with the power needed to challenge the World Government directly. This theory is supported by Robin's later activities during the timeskip, where she learned about the Revolutionary Army's operations and the true nature of the World Government.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Revolutionary_Army",
      "title": "Revolutionary Army - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-13"
    },
    "postedDate": "2010-06-13",
    "episodeRange": [455, 544],
    "minEpisode": 455,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 600
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["robin", "dragon", "bunny-joe"],
    "relatedLocations": ["tequila-wolf", "baltigo"],
    "relatedEvents": ["ep455-event-004"],
    "tags": ["revolutionary-army", "robin", "poneglyphs", "void-century", "ancient-weapons"]
  },
  {
    "id": "theory-ep455-003",
    "title": "The Separation Serial's Purpose: Each Straw Hat's Ideal Training Ground",
    "summary": "A theory that Bartholomew Kuma deliberately sent each Straw Hat to a location that would help them grow stronger, suggesting he was helping them prepare for the New World.",
    "fullText": "Fans have theorized that Bartholomew Kuma's actions at Sabaody Archipelago weren't random attacks but a calculated effort to help the Straw Hats survive. Each crew member was sent to a location perfectly suited to their growth: Robin to the Revolutionary Army to learn world history, Usopp to the Boin Archipelago to master Pop Greens and survival skills, Sanji to Kamabakka Kingdom to learn Attack Cuisine, Zoro to Kuraigana Island to train with Mihawk, etc. This theory suggests Kuma, as a Revolutionary and former ally of Dragon, recognized the Straw Hats' potential role in changing the world and chose to protect them by forcing them to grow stronger. The fact that Robin ended up with the Revolutionary Army - an organization actively seeking her - seems too convenient to be coincidence.",
    "author": "One Piece Fandom",
    "source": {
      "url": "https://tvtropes.org/pmwiki/pmwiki.php/Recap/OnePieceTheStrawHatsSeparationSerial",
      "title": "One Piece - The Straw Hat's Separation Serial Recap",
      "platform": "TV Tropes",
      "accessedAt": "2025-12-13"
    },
    "postedDate": "2010-06-13",
    "episodeRange": [405, 517],
    "minEpisode": 405,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 517
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "STRONGLY_SUPPORTED",
    "relatedCharacters": ["bartholomew-kuma", "robin", "usopp", "luffy", "zoro", "sanji", "nami", "franky", "brook", "chopper"],
    "relatedLocations": ["tequila-wolf", "boin-archipelago", "kamabakka-kingdom", "kuraigana-island", "weatheria", "karakuri-island"],
    "relatedEvents": ["ep455-event-004", "ep455-event-006"],
    "tags": ["bartholomew-kuma", "straw-hats-separation", "training", "timeskip", "foreshadowing"]
  }
]
