[
  {
    "theoryTitle": "Enel's Prediction Accuracy and Mantra Limits",
    "theoryText": "Enel predicts exactly 5 survivors from the 81 participants in his survival game. This raises the question: Can Enel's Mantra actually see the future with perfect accuracy, or is he manipulating events to ensure his prediction comes true? Some fans theorize that Enel's confidence comes not just from observation haki, but from his ability to actively eliminate participants using his lightning powers, effectively engineering the outcome he predicts.",
    "author": "One Piece Fan Community",
    "sourceUrl": null,
    "sourceType": "GENERAL_DISCUSSION",
    "episodeSpan": [169, 182],
    "spoilerStatus": true,
    "spoilsEpisodesUpTo": 182,
    "popularity": "MEDIUM",
    "status": "RESOLVED",
    "resolutionEpisode": 182,
    "tags": ["enel", "mantra", "observation-haki", "skypiea"]
  },
  {
    "theoryTitle": "The Reject Dial's True Origin",
    "theoryText": "The Reject Dial is described as an 'ancient' weapon that's thought to be extinct. Some fans theorize that the Reject Dial might be connected to the advanced technology of the Ancient Kingdom or the civilization that created the Poneglyphs. The fact that it exists on Sky Island (which was part of Jaya 400 years ago) suggests it might have connections to the Void Century and the city of Shandora.",
    "author": "One Piece Theory Community",
    "sourceUrl": null,
    "sourceType": "GENERAL_DISCUSSION",
    "episodeSpan": [169, null],
    "spoilerStatus": false,
    "spoilsEpisodesUpTo": 195,
    "popularity": "LOW",
    "status": "UNRESOLVED",
    "resolutionEpisode": null,
    "tags": ["reject-dial", "ancient-weapons", "void-century", "shandora"]
  },
  {
    "theoryTitle": "Wyper's Superhuman Endurance Explained",
    "theoryText": "Wyper is able to use the Reject Dial three times without dying, when normal people die after just one use. Fans have theorized about the source of this incredible endurance. Some suggest it's simply his exceptional physical conditioning and warrior training. Others theorize that the Shandia people, having lived in harsh conditions for 400 years fighting to reclaim their homeland, may have developed unique physical adaptations or techniques to withstand extreme punishment.",
    "author": "Power Scaling Community",
    "sourceUrl": null,
    "sourceType": "GENERAL_DISCUSSION",
    "episodeSpan": [169, 182],
    "spoilerStatus": true,
    "spoilsEpisodesUpTo": 182,
    "popularity": "MEDIUM",
    "status": "PARTIALLY_RESOLVED",
    "resolutionEpisode": 182,
    "tags": ["wyper", "shandia", "power-scaling", "reject-dial"]
  }
]
