[
  {
    "name": {
      "english": "Upper Yard",
      "japanese": "神の島（アッパーヤード）",
      "romanized": "Appā Yādo",
      "alternativeNames": ["God's Island", "Vearth"]
    },
    "type": "ISLAND",
    "debutEpisode": 153,
    "debutChapter": 237,
    "episodeAppearances": [169],
    "description": "The sacred land of Skypiea, originally part of Jaya before being knocked up into the sky 400 years ago. It contains the ruins of the ancient city of Shandora and is the subject of conflict between the Skypieans, Shandians, and Enel.",
    "keyEvents": [
      {
        "episodeNumber": 169,
        "eventId": "ep169-event-006",
        "eventType": "BATTLE_START",
        "description": "Wyper battles Shura in the Upper Yard forest after the Shandia warriors are trapped in the Ordeal of String.",
        "significance": "The site of a major battle that eliminates one of Enel's priests from the survival game."
      },
      {
        "episodeNumber": 169,
        "eventId": "ep169-event-008",
        "eventType": "BATTLE_END",
        "description": "Wyper defeats Shura using the Reject Dial, marking the first use of this ancient weapon in the series.",
        "significance": "A turning point in the survival game as Enel's forces are weakened."
      },
      {
        "episodeNumber": 169,
        "eventId": "ep169-event-011",
        "eventType": "FIRST_APPEARANCE",
        "description": "Luffy encounters Wyper in the Upper Yard forest, setting up their confrontation.",
        "significance": "The location where two major forces in the survival game come into conflict."
      }
    ],
    "status": "ACTIVE",
    "controlledBy": "enel",
    "significance": "Upper Yard is the primary battleground for Enel's survival game and the ancestral homeland that the Shandia are fighting to reclaim."
  },
  {
    "name": {
      "english": "Going Merry",
      "japanese": "ゴーイングメリー号",
      "romanized": "Gōingu Merī-gō"
    },
    "type": "SHIP",
    "debutEpisode": 17,
    "debutChapter": 41,
    "episodeAppearances": [169],
    "description": "The Straw Hat Pirates' first ship, a caravel given to them by Kaya. Currently docked in the Milky Road near Upper Yard during the Skypiea arc.",
    "keyEvents": [
      {
        "episodeNumber": 169,
        "eventId": "ep169-event-003",
        "eventType": "WORLD_LORE",
        "description": "Gan Fall explains Impact Dial technology to Sanji, Nami, and Usopp aboard the Going Merry.",
        "significance": "The ship serves as a safe location for the crew to learn about Sky Island combat mechanics."
      },
      {
        "episodeNumber": 169,
        "eventId": "ep169-event-004",
        "eventType": "POWER_REVEAL",
        "description": "Gan Fall reveals information about the deadly Reject Dial to the Straw Hats.",
        "significance": "The crew gains crucial knowledge about the most dangerous weapon in the Sky Island arsenal."
      }
    ],
    "status": "ACTIVE",
    "controlledBy": "straw-hat-pirates",
    "significance": "Serves as the Straw Hats' base of operations and safe haven during the Skypiea conflict."
  },
  {
    "name": {
      "english": "God's Shrine",
      "japanese": "神の社",
      "romanized": "Kami no Yashiro",
      "alternativeNames": ["Enel's Palace"]
    },
    "type": "BUILDING",
    "debutEpisode": 167,
    "debutChapter": 254,
    "episodeAppearances": [169],
    "description": "Enel's throne room and base of operations in Upper Yard, where he observes and controls events across Skypiea using his Mantra ability.",
    "keyEvents": [
      {
        "episodeNumber": 169,
        "eventId": "ep169-event-005",
        "eventType": "PROPHECY_FORESHADOWING",
        "description": "From his throne, Enel predicts that only 5 of 81 participants will survive his survival game.",
        "significance": "Demonstrates Enel's god-like command center where he orchestrates the survival game."
      }
    ],
    "status": "ACTIVE",
    "controlledBy": "enel",
    "significance": "The seat of Enel's power and the location from which he monitors and controls all events in Upper Yard."
  }
]
