[
  {
    "name": {
      "english": "International Gourmet Organization",
      "japanese": "国際グルメ機関",
      "romanized": "Kokusai Gurume Kikan",
      "abbreviation": "IGO"
    },
    "debutEpisode": 590,
    "debutChapter": null,
    "episodeAppearances": [590],
    "organizationType": "GOVERNMENT_AGENCY",
    "description": "An international organization from the Toriko universe dedicated to food and gourmet affairs. In this crossover episode, the IGO hosts a food tournament that serves as a cover to gather powerful fighters to help capture the dangerous creature Akami.",
    "purpose": "Regulate and promote gourmet food culture, protect rare ingredients, and handle dangerous food-related threats",
    "headquarters": "Unknown",
    "founded": "Unknown",
    "leader": "Mansam (Director)",
    "notableMembers": [
      "Mansam (Director)",
      "Toriko (Gourmet Hunter)",
      "Komatsu (Chef)"
    ],
    "keyEvents": [
      {
        "episodeNumber": 590,
        "eventId": "ep590-event-001",
        "eventType": "CULTURAL_MOMENT",
        "title": "Hosts Food Tournament",
        "description": "The IGO organizes a no-rules Food Tournament with the Carat Sizzled Cattle as the prize, attracting competitors from three different anime universes.",
        "significance": "Creates the premise for the crossover event.",
        "timestamp": "02:00"
      },
      {
        "episodeNumber": 590,
        "eventId": "ep590-event-005",
        "eventType": "WORLD_LORE",
        "title": "Reveals Tournament's True Purpose",
        "description": "IGO Director Mansam reveals the tournament was a ruse to lure out and capture Akami, the Deep Sea Glutton, by gathering the world's strongest fighters.",
        "significance": "Transforms the competition into a cooperative mission against a common threat.",
        "timestamp": "16:00"
      }
    ],
    "allies": [
      "Toriko and his companions",
      "Straw Hat Pirates (temporary alliance in crossover)",
      "Goku and Dragon Ball Z characters (temporary alliance in crossover)"
    ],
    "enemies": [
      "Akami (Deep Sea Glutton)"
    ],
    "currentStatus": "ACTIVE",
    "trivia": [
      "The IGO is from the Toriko universe and does not exist in the One Piece canon",
      "This marks the organization's first interaction with One Piece characters",
      "The IGO's plan successfully gathered three of the strongest fighters from different anime universes"
    ]
  }
]
