[
  {
    "id": "theory-ep640-001",
    "title": "Usopp's Tontatta Heritage",
    "theoryText": "Usopp may be a distant relative of the Tontatta tribe, making him not just human but also part Tontatta. Evidence includes: (1) Usopp's iconic nose comes from his mother Banchina's side of the family, and her nose looks exactly like the Tontattas' noses - smaller than Usopp's but coming to a strange point; (2) The Tontattas quickly referred to Usopp as a hero after first meeting him, suggesting a special bond; (3) Like the Tontattas, Usopp has a natural affinity for gardening and botany, utilizing these skills in unique ways since his post-time skip training; (4) This would explain the instant close relationship between Usopp and the Tontatta tribe.",
    "theorist": "Game Rant / One Piece Community",
    "postedDate": "Unknown",
    "platform": "Game Rant / Reddit",
    "url": "https://gamerant.com/one-piece-theory-usopp-part-tontatta/",
    "episodesReferenced": [640, 641],
    "minEpisodeToAvoidSpoilers": 640,
    "maxEpisodeSpoiled": 700,
    "spoilerSeverity": "MAJOR",
    "communityReception": {
      "popularity": "MODERATE",
      "plausibility": "LOW_TO_MODERATE",
      "evidenceStrength": "MODERATE"
    },
    "status": "UNCONFIRMED",
    "tags": ["character-heritage", "usopp", "tontattas", "bloodline-theory"],
    "relatedCharacters": ["usopp", "banchina", "leo"],
    "relatedLocations": ["green-bit", "tontatta-kingdom"]
  },
  {
    "id": "theory-ep640-002",
    "title": "Green Bit Bridge and Forced Labor Connection",
    "theoryText": "The destroyed bridge connecting Dressrosa to Green Bit may have been built by the enslaved Tontatta dwarves during the original Don Quixote dynasty's rule 900 years ago. This theory draws parallels to Tequila Wolf, where masses were forced to work day and night to build a giant bridge under the Celestial Dragons' orders. The Tontatta suffered greatly under the Don Quixote dynasty and were subjected to the cruelest of forced labor, and the bridge might have been one of the structures they were forced to build. This would connect it to the broader history of the Void Century and forced construction projects ordered by the World Government. The bridge's destruction 200 years ago by Fighting Fish could be seen as nature reclaiming what was built through suffering.",
    "theorist": "One Piece Community",
    "postedDate": "Unknown",
    "platform": "One Piece Wiki Forums",
    "url": "https://onepiece.fandom.com/f/p/3258895044706336715",
    "episodesReferenced": [640, 641],
    "minEpisodeToAvoidSpoilers": 640,
    "maxEpisodeSpoiled": 650,
    "spoilerSeverity": "MAJOR",
    "communityReception": {
      "popularity": "LOW_TO_MODERATE",
      "plausibility": "MODERATE",
      "evidenceStrength": "LOW"
    },
    "status": "UNCONFIRMED",
    "tags": ["void-century", "tontattas", "dressrosa-history", "forced-labor", "world-government"],
    "relatedCharacters": ["doflamingo"],
    "relatedLocations": ["green-bit", "dressrosa", "tequila-wolf"]
  },
  {
    "id": "theory-ep640-003",
    "title": "Doflamingo's Celestial Dragon Connection Through Tontatta History",
    "theoryText": "The conflict between the Tontatta tribe and the Donquixote family that started 900 years ago during the Void Century dramatically increases the likelihood of Doflamingo being connected to the Tenryuubito (Celestial Dragons). The 900-year timeframe specifically links to the founding of the World Government and suggests the original Donquixote family were among the original 20 kingdoms' royalty who became Celestial Dragons. The fact that this history is being revealed through the Tontattas' suffering provides evidence that Doflamingo's family has deep roots in the World Government's founding, explaining his knowledge of sensitive information and his special status.",
    "theorist": "One Piece Community",
    "postedDate": "Unknown",
    "platform": "Various Forums",
    "url": "https://onepiece.fandom.com/wiki/Tontatta_Kingdom",
    "episodesReferenced": [640, 641],
    "minEpisodeToAvoidSpoilers": 640,
    "maxEpisodeSpoiler": 700,
    "spoilerSeverity": "CRITICAL",
    "communityReception": {
      "popularity": "HIGH",
      "plausibility": "HIGH",
      "evidenceStrength": "HIGH"
    },
    "status": "CONFIRMED",
    "tags": ["doflamingo", "celestial-dragons", "void-century", "world-government", "donquixote-family"],
    "relatedCharacters": ["doflamingo"],
    "relatedLocations": ["dressrosa", "green-bit", "mariejois"]
  }
]
