[
  {
    "id": "alubarna-tomb-of-kings",
    "name": "Tomb of the Kings",
    "nameJapanese": "王家の墓",
    "nameRomanized": "Ōke no Haka",
    "type": "Underground Chamber",
    "episodeAppearances": [126],
    "keyEvents": [
      {
        "episodeNumber": 126,
        "timestamp": "03:30",
        "title": "Final Battle Location",
        "description": "The ancient underground tomb beneath Alubarna serves as the arena for the climactic final battle between Luffy and Crocodile.",
        "significance": "This sacred burial chamber witnesses the defeat of Crocodile and the end of his conspiracy."
      },
      {
        "episodeNumber": 126,
        "timestamp": "13:00",
        "title": "Ceiling Destroyed",
        "description": "Luffy's Gomu Gomu no Storm punches Crocodile through several feet of solid bedrock ceiling, creating a massive hole from the tomb to the surface above.",
        "significance": "The destruction symbolizes breaking through the darkness of Crocodile's conspiracy into the light of liberation."
      }
    ],
    "description": "An ancient underground chamber beneath Alubarna containing the tombs of Arabasta's past rulers and a Poneglyph. The chamber has stone pillars and architecture dating back centuries."
  },
  {
    "id": "alubarna-bell-tower",
    "name": "Alubarna Bell Tower",
    "nameJapanese": "アルバーナの鐘楼",
    "nameRomanized": "Arubāna no Shōrō",
    "type": "Tower",
    "episodeAppearances": [126],
    "keyEvents": [
      {
        "episodeNumber": 126,
        "timestamp": "17:00",
        "title": "Vivi Stops the War",
        "description": "Princess Vivi uses the bell tower as a platform to make her desperate pleas for peace heard across the battlefield. As rain falls, her voice finally reaches the fighting citizens.",
        "significance": "The bell tower becomes the symbol of Vivi's voice being elevated above the chaos, allowing truth to reach her people."
      }
    ],
    "description": "A tall tower in Alubarna's capital plaza from which important announcements are made to the citizens. Provides a commanding view of the city and battlefield."
  },
  {
    "id": "alubarna",
    "name": "Alubarna",
    "nameJapanese": "アルバーナ",
    "nameRomanized": "Arubāna",
    "type": "Capital City",
    "episodeAppearances": [126],
    "keyEvents": [
      {
        "episodeNumber": 126,
        "timestamp": "13:00",
        "title": "Earthquake from Luffy's Attack",
        "description": "The force of Luffy's final attack creates a massive earthquake throughout the capital city, with buildings shaking and Crocodile's body launching into the sky above.",
        "significance": "The entire city witnesses Crocodile's defeat as he's launched into the air."
      },
      {
        "episodeNumber": 126,
        "timestamp": "15:30",
        "title": "Rain Returns to the Capital",
        "description": "Rain falls on Alubarna for the first time in three years, causing the warring factions on the battlefield to pause and look to the sky.",
        "significance": "The capital experiences the miracle that ends the drought and signals the end of Crocodile's influence."
      },
      {
        "episodeNumber": 126,
        "timestamp": "18:30",
        "title": "Civil War Ends",
        "description": "Both the rebel army and royal forces lay down their arms in Alubarna as the rain falls and Vivi's pleas are heard.",
        "significance": "Marks the end of the three-year civil war and the beginning of Arabasta's healing."
      }
    ],
    "description": "The royal capital of Arabasta, featuring grand architecture, a palace, and a central plaza with a bell tower. Site of the climactic battle between rebel and royal forces."
  },
  {
    "id": "arabasta",
    "name": "Arabasta Kingdom",
    "nameJapanese": "アラバスタ王国",
    "nameRomanized": "Arabasuta Ōkoku",
    "type": "Kingdom",
    "episodeAppearances": [126],
    "keyEvents": [
      {
        "episodeNumber": 126,
        "timestamp": "15:30",
        "title": "Rain Returns After Three Years",
        "description": "Rain falls across Arabasta for the first time in three years when Crocodile is defeated and his Devil Fruit influence is neutralized.",
        "significance": "Marks the liberation of the entire kingdom from Crocodile's environmental manipulation and the end of the devastating drought."
      },
      {
        "episodeNumber": 126,
        "timestamp": "18:30",
        "title": "Kingdom Saved from Civil War",
        "description": "The entire kingdom is saved as the civil war ends, preventing the destruction that would have torn Arabasta apart.",
        "significance": "The successful resolution of Crocodile's conspiracy allows the kingdom to begin healing and rebuilding."
      }
    ],
    "description": "A desert kingdom suffering from a three-year drought and civil war engineered by Crocodile. Liberation comes when Luffy defeats the Warlord and rain returns to the land."
  }
]
