[
  {
    "id": "gomu-gomu-no-mi",
    "name": {
      "english": "Gum-Gum Fruit",
      "japanese": "ゴムゴムの実",
      "romanized": "Gomu Gomu no Mi",
      "meaning": "Rubber Rubber Fruit"
    },
    "debutEpisode": 1,
    "episodeAppearances": [205],
    "type": "PARAMECIA",
    "currentUser": "luffy",
    "keyMoments": [
      {
        "episodeNumber": 205,
        "eventId": "ep205-event-006",
        "title": "Luffy's Weakness to Seastone Demonstrated",
        "description": "Luffy is trapped in a seastone net which completely drains his strength and nullifies his Devil Fruit powers, rendering him helpless.",
        "significance": "Clearly demonstrates one of the three fundamental weaknesses of all Devil Fruit powers: seastone (kairouseki), which has the same effect as seawater.",
        "timestamp": "18:30"
      }
    ],
    "abilities": [],
    "weaknesses": [
      {
        "weakness": "Seastone (Kairouseki)",
        "description": "Contact with seastone immediately drains the user's strength and nullifies their Devil Fruit abilities.",
        "episodeRevealed": 205,
        "demonstration": "Luffy was completely immobilized by a seastone net in Jonathan's quarters."
      }
    ],
    "description": "The Gomu Gomu no Mi grants the user's body the properties of rubber, allowing them to stretch, bounce, and become immune to blunt force and electricity. However, this episode demonstrates its vulnerability to seastone."
  },
  {
    "id": "hana-hana-no-mi",
    "name": {
      "english": "Flower-Flower Fruit",
      "japanese": "ハナハナの実",
      "romanized": "Hana Hana no Mi",
      "meaning": "Flower Flower Fruit"
    },
    "debutEpisode": 67,
    "episodeAppearances": [205],
    "type": "PARAMECIA",
    "currentUser": "robin",
    "keyMoments": [
      {
        "episodeNumber": 205,
        "eventId": "ep205-event-004",
        "title": "Robin Defeats Shepherd with His Own Weapon",
        "description": "Robin uses her Hana Hana no Mi powers to redirect Shepherd's advanced bazooka, turning it against him and blasting open fortress doors.",
        "significance": "Demonstrates tactical combat applications of Robin's powers, showing she can manipulate enemy weapons and turn them against their users.",
        "timestamp": "14:20"
      }
    ],
    "abilities": [
      {
        "abilityName": "Weapon Redirection",
        "episodeFirstUsed": 205,
        "description": "Robin can sprout her limbs on enemies or objects to redirect weapons, forcing them to fire in unintended directions or at their own users."
      }
    ],
    "description": "The Hana Hana no Mi allows the user to sprout replicas of their body parts on any surface. Robin demonstrates tactical use of this power to manipulate enemy weapons."
  }
]
