[
  {
    "hakiType": "CONQUERORS",
    "firstMentionedEpisode": 389,
    "firstDemonstratedEpisode": 397,
    "episodeAppearances": [397],
    "usersIntroduced": [
      {
        "characterId": "silvers-rayleigh",
        "episodeRevealed": 397,
        "masteryLevel": "MASTER",
        "description": "Rayleigh demonstrates precise control over Conqueror's Haki, able to selectively knock out specific targets while leaving others conscious."
      }
    ],
    "significantMoments": [
      {
        "episodeNumber": 397,
        "eventId": "ep397-event-009",
        "timestamp": "18:15",
        "description": "Rayleigh uses Conqueror's Haki with surgical precision to knock out Shalria and guards",
        "significance": "First clear demonstration of precise Conqueror's Haki control, showing it can be wielded with accuracy rather than as an indiscriminate area effect. This establishes the concept of Haki mastery levels.",
        "userCharacterId": "silvers-rayleigh",
        "targetCharacterIds": ["shalria"],
        "witnessCharacterIds": ["luffy", "zoro", "sanji", "nami", "usopp", "robin", "chopper", "franky", "brook", "eustass-kid", "trafalgar-law"],
        "effectDescription": "Knocked out Shalria and all remaining guards/weak-willed people while leaving the Straw Hats, Kid Pirates, and Heart Pirates conscious, demonstrating selective targeting.",
        "visualDescription": "A powerful invisible wave emanates from Rayleigh, causing those with weak willpower to collapse unconscious while stronger individuals remain unaffected."
      }
    ],
    "mechanicsRevealed": [
      {
        "mechanic": "Selective Targeting",
        "episodeRevealed": 397,
        "description": "Conqueror's Haki can be controlled precisely to affect only intended targets, sparing those the user wishes to remain conscious.",
        "significance": "Reveals that mastery of Conqueror's Haki involves more than raw power - it requires precision and control."
      },
      {
        "mechanic": "Willpower Resistance",
        "episodeRevealed": 397,
        "description": "Individuals with strong willpower (like the Supernova pirates) can resist or remain unaffected by Conqueror's Haki.",
        "significance": "Establishes that Conqueror's Haki effectiveness depends on the target's willpower and the user's strength."
      }
    ],
    "culturalSignificance": "This episode's demonstration of Conqueror's Haki is considered one of the most iconic moments in the series, as it's the first time viewers see it used with precision control rather than as a blunt instrument. It establishes the power hierarchy and foreshadows Luffy's future training.",
    "powerScaling": "Rayleigh's demonstration shows master-level control, far beyond the unconscious bursts previously seen. His ability to selectively target individuals showcases decades of experience and mastery."
  }
]
