[
  {
    "name": {
      "english": "Gum-Gum Fruit",
      "japanese": "ゴムゴムの実",
      "romanized": "Gomu Gomu no Mi"
    },
    "type": "PARAMECIA",
    "episodeAppearances": [537],
    "abilityReveals": [
      {
        "abilityName": "Gomu Gomu no Jet Hammer",
        "episodeRevealed": 537,
        "description": "A Gear Second technique where Luffy wraps his legs around his opponent at extreme speed and smashes them into the ground with tremendous force. The Gear Second version of Gomu Gomu no Ozuchi (Gum-Gum Mallet).",
        "severity": "MAJOR",
        "firstUseContext": "Luffy uses this technique while tied up to defeat Vander Decken IX, smashing him headfirst into the ground."
      }
    ],
    "users": [
      {
        "characterId": "luffy",
        "episodeStart": 1,
        "episodeEnd": "present",
        "circumstances": "Luffy accidentally ate the fruit as a child"
      }
    ]
  },
  {
    "name": {
      "english": "Mark-Mark Fruit",
      "japanese": "マトマトの実",
      "romanized": "Mato Mato no Mi"
    },
    "type": "PARAMECIA",
    "description": "Allows the user to mark any target by touching them with their bare hand. Any object the user throws from that same hand will lock onto the target and chase it until the target is hit or the object is stopped by an obstacle.",
    "episodeAppearances": [537],
    "abilityReveals": [
      {
        "abilityName": "Target Marking",
        "episodeRevealed": 537,
        "description": "The user can mark someone as a target by touching them with their bare hand. Thrown objects will track the target indefinitely, with momentum increasing based on distance.",
        "severity": "MAJOR",
        "firstUseContext": "Referenced as the reason Vander Decken has been able to throw objects at Shirahoshi for years, no matter where she is."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Abilities are nullified if the user falls unconscious or dies",
        "episodeRevealed": 537,
        "severity": "MAJOR"
      },
      {
        "weakness": "Cannot mark inanimate objects as targets, only living beings",
        "episodeRevealed": 537,
        "severity": "MINOR"
      },
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 537,
        "severity": "MAJOR"
      }
    ],
    "strengths": [
      {
        "strength": "Can send objects of any size flying at targets",
        "episodeRevealed": 537,
        "description": "The user can throw anything from small weapons to massive objects like ships, and they will all track the target.",
        "severity": "MAJOR"
      },
      {
        "strength": "Attack momentum increases with distance",
        "episodeRevealed": 537,
        "description": "The farther the object travels, the more momentum and force it gains, making long-range attacks potentially lethal.",
        "severity": "MAJOR"
      }
    ],
    "users": [
      {
        "characterId": "vander-decken-ix",
        "episodeStart": null,
        "episodeEnd": "present",
        "circumstances": "Vander Decken IX consumed the Mato Mato no Mi at an unknown time"
      }
    ],
    "rarity": "RARE",
    "powerTier": "MEDIUM"
  }
]
