[
  {
    "id": "sham",
    "name": "Sham",
    "nameJapanese": "シャム",
    "nameRomanized": "Shamu",
    "aliases": ["Nyaban Brother", "Meowban Brother"],
    "debut": {
      "episode": 13,
      "chapter": 31
    },
    "episodeAppearances": [13],
    "age": null,
    "birthday": null,
    "height": "201 cm",
    "bounty": null,
    "affiliation": ["black-cat-pirates"],
    "occupation": ["Pirate", "Ship Guardian"],
    "devilFruit": null,
    "keyMoments": [
      {
        "episodeNumber": 13,
        "title": "First Appearance and Deceptive Introduction",
        "description": "Sham debuts as one of the Nyaban Brothers, officers of the Black Cat Pirates. He initially feigns weakness and cowardice to deceive Zoro before revealing his true combat abilities.",
        "significance": "Introduces Sham as a tactical fighter who uses deception as a weapon."
      },
      {
        "episodeNumber": 13,
        "title": "Battle Against Zoro Begins",
        "description": "Working in perfect coordination with his brother Buchi, Sham engages Zoro in combat using cat-themed techniques and clawed gloves.",
        "significance": "Demonstrates Sham's role as the speed-based half of the Nyaban Brothers duo."
      },
      {
        "episodeNumber": 13,
        "title": "Disarms Zoro with Neko Baba",
        "description": "Using his signature technique Neko Baba, Sham swiftly steals one of Zoro's katanas during combat, putting the swordsman at a disadvantage.",
        "significance": "Shows Sham's tactical fighting style focused on equipment theft and opponent debilitation."
      }
    ],
    "abilities": [
      {
        "name": "Neko Baba",
        "nameJapanese": "ネコババ",
        "description": "A swift theft technique where Sham uses his cat-like speed and reflexes to steal weapons or equipment from opponents during combat.",
        "debutEpisode": 13,
        "debutChapter": 31
      },
      {
        "name": "Nekoze",
        "nameJapanese": "猫背",
        "description": "Sham uses his naturally hunched posture to avoid attacks, dodging by bending his flexible spine.",
        "debutEpisode": 13,
        "debutChapter": 31
      },
      {
        "name": "Neko-Yanagi Daikoshin",
        "nameJapanese": "猫柳大行進",
        "description": "A combined rapid slashing attack performed with Buchi, where both brothers coordinate their clawed strikes in a devastating barrage.",
        "debutEpisode": 13,
        "debutChapter": 31
      }
    ],
    "relationships": [
      {
        "characterId": "buchi",
        "relationType": "Partner",
        "description": "Sham's fighting partner and fellow Nyaban Brother. They work in perfect coordination, with Sham's speed complementing Buchi's power.",
        "establishedInEpisode": 13
      },
      {
        "characterId": "jango",
        "relationType": "Crewmate",
        "description": "Fellow officer of the Black Cat Pirates. Jango summons the Nyaban Brothers to battle.",
        "establishedInEpisode": 13
      },
      {
        "characterId": "kuro",
        "relationType": "Captain",
        "description": "Sham serves as an officer under Captain Kuro in the Black Cat Pirates.",
        "establishedInEpisode": 13
      }
    ],
    "physicalDescription": "A very tall (201 cm), extremely thin man with a hunched back and green cat-like eyes. He has green parted hair, cat ears protruding from his head, and wears a navy shirt with a magenta bow tie. He fights with brown gloves equipped with protruding claws.",
    "personality": "Deceptive and strategic. Sham employs psychological tactics by feigning weakness to lower opponents' guards before revealing his true abilities. He is sneaky and devious, working in perfect coordination with his brother Buchi.",
    "voiceActorJP": "Masaya Onosaka",
    "voiceActorEN": "Todd Haberkorn"
  },
  {
    "id": "buchi",
    "name": "Buchi",
    "nameJapanese": "ブチ",
    "nameRomanized": "Buchi",
    "aliases": ["Nyaban Brother", "Meowban Brother"],
    "debut": {
      "episode": 13,
      "chapter": 31
    },
    "episodeAppearances": [13],
    "age": 21,
    "birthday": null,
    "height": "216 cm",
    "bounty": null,
    "affiliation": ["black-cat-pirates"],
    "occupation": ["Pirate", "Ship Guardian"],
    "devilFruit": null,
    "keyMoments": [
      {
        "episodeNumber": 13,
        "title": "First Appearance with Deceptive Cowardice",
        "description": "Buchi debuts alongside Sham as one of the Nyaban Brothers. He initially pretends to be weak and frightened before revealing his true strength and combat prowess.",
        "significance": "Establishes Buchi as a deceptive fighter who uses psychological tactics."
      },
      {
        "episodeNumber": 13,
        "title": "Demonstrates Destructive Power",
        "description": "Buchi showcases his technique Cat the Funjyatta, a powerful flying stomp capable of cracking stone, demonstrating his role as the powerhouse of the duo.",
        "significance": "Shows Buchi's combat style focused on overwhelming strength and destructive force."
      },
      {
        "episodeNumber": 13,
        "title": "Coordinated Assault on Zoro",
        "description": "Working in perfect synchronization with Sham, Buchi helps overwhelm Zoro through teamwork and complementary fighting styles.",
        "significance": "Demonstrates the effectiveness of the Nyaban Brothers' coordinated combat approach."
      }
    ],
    "abilities": [
      {
        "name": "Cat the Funjyatta",
        "nameJapanese": "キャット・ザ・踏んじゃった",
        "description": "A devastating flying leap stomp attack where Buchi jumps high and crashes down with enough force to shatter stone. His considerable weight makes this technique extremely destructive.",
        "debutEpisode": 13,
        "debutChapter": 31
      },
      {
        "name": "Neko-Yanagi Daikoshin",
        "nameJapanese": "猫柳大行進",
        "description": "A combined rapid slashing attack performed with Sham, where both brothers coordinate their clawed strikes in a devastating barrage.",
        "debutEpisode": 13,
        "debutChapter": 31
      }
    ],
    "relationships": [
      {
        "characterId": "sham",
        "relationType": "Partner",
        "description": "Buchi's fighting partner and fellow Nyaban Brother. They fight as a coordinated unit, with Buchi's power complementing Sham's speed.",
        "establishedInEpisode": 13
      },
      {
        "characterId": "jango",
        "relationType": "Crewmate",
        "description": "Fellow officer of the Black Cat Pirates. Jango summons the Nyaban Brothers into battle.",
        "establishedInEpisode": 13
      },
      {
        "characterId": "kuro",
        "relationType": "Captain",
        "description": "Buchi serves as an officer under Captain Kuro in the Black Cat Pirates.",
        "establishedInEpisode": 13
      }
    ],
    "physicalDescription": "An overweight man standing 216 cm tall with pale skin, sharp teeth, and tiny eyes. He wears a black and white cat costume with cat ears on his head, striped pants, and pale blue clawed gloves. His appearance is based on a black and white cat.",
    "personality": "Acts cat-like and employs deceptive tactics by initially appearing weak and cowardly. Despite the act, Buchi is a confident fighter who uses his weight and strength to crush opponents. He works seamlessly with his brother Sham.",
    "voiceActorJP": "Yasuhiro Takato",
    "voiceActorEN": "Chris Rager"
  },
  {
    "id": "luffy",
    "episodeAppearances": [13],
    "keyMoments": [
      {
        "episodeNumber": 13,
        "title": "Accidentally Hypnotized to Enhanced Strength",
        "description": "Luffy is accidentally hypnotized by Jango while watching his pendulum with curiosity. The hypnotic enhancement dramatically increases his already formidable strength, causing chaos among the Black Cat Pirates.",
        "significance": "Demonstrates Luffy's susceptibility to mental manipulation when caught off-guard, showing both a vulnerability and how powerful he becomes with any enhancement."
      },
      {
        "episodeNumber": 13,
        "title": "Gomu Gomu no Gatling Debut",
        "description": "While under hypnotic enhancement, Luffy unleashes a new technique for the first time: Gomu Gomu no Gatling. He throws a rapid barrage of punches creating a blur that appears like multiple arms, devastating multiple opponents simultaneously.",
        "significance": "This is the debut of one of Luffy's signature techniques that becomes a staple finishing move throughout the entire series. It showcases his innovation in developing new Devil Fruit applications."
      },
      {
        "episodeNumber": 13,
        "title": "Tears Off Ship Figurehead",
        "description": "With hypnosis-enhanced strength, Luffy grabs and completely tears off the massive figurehead from the Black Cat Pirates' ship, the Bezan Black, demonstrating his amplified power.",
        "significance": "A visual display of Luffy's strength when enhanced, and causes damage to the enemy's ship."
      },
      {
        "episodeNumber": 13,
        "title": "Hypnotized to Sleep",
        "description": "Jango quickly uses another hypnotic command to put Luffy to sleep, neutralizing the enhanced threat. As Luffy falls unconscious, he drops the figurehead which crushes several Black Cat Pirates.",
        "significance": "Shows the double-edged nature of hypnosis and Jango's quick thinking, though the collateral damage still harms his own crew."
      }
    ],
    "abilities": [
      {
        "name": "Gomu Gomu no Gatling",
        "nameJapanese": "ゴムゴムの銃乱打",
        "description": "Luffy rapidly throws a barrage of punches using his stretching ability, creating a blur of fists that appears like having multiple arms. The technique delivers numerous powerful strikes in quick succession.",
        "debutEpisode": 13,
        "debutChapter": 31
      }
    ]
  },
  {
    "id": "zoro",
    "episodeAppearances": [13],
    "keyMoments": [
      {
        "episodeNumber": 13,
        "title": "Battle Against the Nyaban Brothers",
        "description": "Zoro engages in combat against Sham and Buchi, the Nyaban Brothers. This is his first fight against multiple coordinated opponents, testing his skills and adaptability.",
        "significance": "One of Zoro's first major challenges since joining the crew, showing that even skilled fighters can be overwhelmed by coordinated teamwork."
      },
      {
        "episodeNumber": 13,
        "title": "Disarmed of Two Swords",
        "description": "Through the Nyaban Brothers' coordinated tactics and Sham's Neko Baba technique, Zoro loses two of his three katanas. He is forced to continue fighting with only a single blade.",
        "significance": "A critical setback that puts Zoro at severe disadvantage and tests his ability to adapt when his signature three-sword style is compromised."
      },
      {
        "episodeNumber": 13,
        "title": "Receives Help from Nami",
        "description": "Despite being wounded, Nami retrieves and returns Zoro's stolen swords to him, allowing him to resume his three-sword fighting style.",
        "significance": "Demonstrates the importance of teamwork and shows Zoro learning to rely on his crewmates in battle."
      }
    ]
  },
  {
    "id": "nami",
    "episodeAppearances": [13],
    "keyMoments": [
      {
        "episodeNumber": 13,
        "title": "Wounded by Jango's Chakram",
        "description": "While attempting to help in the battle, Nami is struck in the shoulder by Jango's thrown chakram weapon, sustaining a painful wound.",
        "significance": "One of Nami's first serious injuries in the series, showing the real danger of combat and her vulnerability in direct fighting."
      },
      {
        "episodeNumber": 13,
        "title": "Recovers Zoro's Swords Despite Injury",
        "description": "Despite her shoulder wound, Nami demonstrates courage and resourcefulness by retrieving Zoro's two stolen katanas and returning them, allowing him to fight effectively again.",
        "significance": "A key moment showing Nami's growth from self-interested thief to loyal crew member willing to risk herself to help her companions."
      }
    ],
    "relationships": [
      {
        "characterId": "zoro",
        "relationType": "Crewmate",
        "description": "Nami demonstrates growing trust and teamwork with Zoro by helping him recover his swords despite being wounded herself.",
        "establishedInEpisode": 13
      }
    ]
  },
  {
    "id": "kaya",
    "episodeAppearances": [13],
    "keyMoments": [
      {
        "episodeNumber": 13,
        "title": "Discovers Wounded Merry",
        "description": "Kaya exits her bedroom to find Merry lying on the floor, gravely wounded and bleeding. This shocking discovery marks a turning point in her understanding of the danger surrounding her.",
        "significance": "The beginning of Kaya's transformation from a naive, sheltered girl to someone who understands the cruelty and deception in the world."
      },
      {
        "episodeNumber": 13,
        "title": "Learns the Truth About Klahadore",
        "description": "Merry reveals to Kaya that Klahadore is actually the pirate Captain Kuro and that Usopp's warnings were truthful. This devastating revelation shatters her trust in the man who cared for her for three years.",
        "significance": "A critical moment of betrayal that destroys Kaya's sense of security and validates Usopp's character. This revelation drives the emotional core of the arc."
      }
    ],
    "relationships": [
      {
        "characterId": "merry",
        "relationType": "Loyal Servant",
        "description": "Merry proves his loyalty to Kaya by warning her about Klahadore's betrayal despite being gravely wounded.",
        "establishedInEpisode": 13
      },
      {
        "characterId": "klahadore",
        "relationType": "Betrayer",
        "description": "Kaya learns that Klahadore, whom she trusted as a caretaker for three years, is actually Captain Kuro plotting to murder her for her fortune.",
        "establishedInEpisode": 13
      }
    ]
  },
  {
    "id": "merry",
    "episodeAppearances": [13],
    "keyMoments": [
      {
        "episodeNumber": 13,
        "title": "Survives Klahadore's Assassination Attempt",
        "description": "Despite being attacked with Kuro's Cat Claws and left in a pool of blood, Merry survives through the night with severe wounds.",
        "significance": "Demonstrates Merry's incredible resilience and will to survive in order to warn Kaya."
      },
      {
        "episodeNumber": 13,
        "title": "Reveals the Truth to Kaya",
        "description": "Despite his grave injuries, Merry musters the strength to inform Kaya that Klahadore is actually Captain Kuro and that Usopp was telling the truth about the danger.",
        "significance": "Merry's unwavering loyalty saves Kaya's life by warning her of the plot. His honesty contrasts sharply with Kuro's three years of deception."
      }
    ],
    "relationships": [
      {
        "characterId": "kaya",
        "relationType": "Loyal Servant",
        "description": "Merry demonstrates absolute loyalty to Kaya by risking his life to warn her about Klahadore's betrayal.",
        "establishedInEpisode": 13
      },
      {
        "characterId": "klahadore",
        "relationType": "Victim",
        "description": "Merry was attacked and nearly killed by Klahadore when he discovered the truth about the butler's identity as Captain Kuro.",
        "establishedInEpisode": 13
      }
    ]
  },
  {
    "id": "jango",
    "episodeAppearances": [13],
    "keyMoments": [
      {
        "episodeNumber": 13,
        "title": "Hypnotizes Crew for Enhanced Strength",
        "description": "Jango uses his hypnotic pendulum and signature 'One, Two, Jango!' command to enhance the strength of Black Cat Pirates, making them powerful enough to shatter rocks.",
        "significance": "Demonstrates the strategic application of Jango's hypnosis as a force multiplier in battle."
      },
      {
        "episodeNumber": 13,
        "title": "Accidentally Hypnotizes Luffy",
        "description": "Jango's hypnosis backfires when Luffy inadvertently watches the pendulum and becomes hypnotically enhanced, turning his boosted strength against the Black Cat Pirates.",
        "significance": "Shows both the power and the danger of hypnosis when it affects unintended targets. Creates comedic irony."
      },
      {
        "episodeNumber": 13,
        "title": "Hypnotizes Luffy to Sleep",
        "description": "Quickly adapting to his mistake, Jango uses another hypnotic command to put the enhanced Luffy to sleep, neutralizing the immediate threat.",
        "significance": "Demonstrates Jango's quick thinking and control over his hypnosis abilities."
      },
      {
        "episodeNumber": 13,
        "title": "Wounds Nami with Chakram",
        "description": "Jango throws his chakram weapon with deadly accuracy, striking Nami in the shoulder and causing her to bleed.",
        "significance": "Shows that Jango is dangerous beyond his hypnosis abilities and is competent with physical weapons."
      },
      {
        "episodeNumber": 13,
        "title": "Summons the Nyaban Brothers",
        "description": "After regular crew members fail, Jango calls upon the elite Nyaban Brothers, Sham and Buchi, to engage Zoro in combat.",
        "significance": "Escalates the battle by bringing in the Black Cat Pirates' officer-level fighters."
      }
    ]
  },
  {
    "id": "kuro",
    "episodeAppearances": [13],
    "keyMoments": [
      {
        "episodeNumber": 13,
        "title": "Arrives at the Northern Slope",
        "description": "Captain Kuro arrives at the battle site at the northern slope, observing the conflict with growing frustration at how long his crew is taking to execute his plan.",
        "significance": "Kuro's arrival signals an escalation in the conflict and sets up the climactic confrontation. His frustration foreshadows his ruthless and perfectionist nature."
      }
    ]
  },
  {
    "id": "tamanegi",
    "episodeAppearances": [13],
    "keyMoments": [
      {
        "episodeNumber": 13,
        "title": "Attempts to Enter Kaya's Mansion",
        "description": "Along with Ninjin and Piiman, Tamanegi tries to enter Kaya's mansion to warn her but finds Usopp's secret entrance sealed and the gates too high to climb.",
        "significance": "Shows the children's loyalty to Usopp and their determination to help despite their limitations."
      }
    ]
  },
  {
    "id": "ninjin",
    "episodeAppearances": [13],
    "keyMoments": [
      {
        "episodeNumber": 13,
        "title": "Attempts to Enter Kaya's Mansion",
        "description": "Along with Tamanegi and Piiman, Ninjin tries to enter Kaya's mansion to warn her but finds Usopp's secret entrance sealed and the gates too high to climb.",
        "significance": "Demonstrates the children's loyalty and their frustration at being unable to help their friend."
      }
    ]
  },
  {
    "id": "piiman",
    "episodeAppearances": [13],
    "keyMoments": [
      {
        "episodeNumber": 13,
        "title": "Attempts to Enter Kaya's Mansion",
        "description": "Along with Tamanegi and Ninjin, Piiman tries to enter Kaya's mansion to warn her but finds Usopp's secret entrance sealed and the gates too high to climb.",
        "significance": "Shows the children's determination to protect Kaya and support Usopp despite the danger."
      }
    ]
  }
]
