[
  {
    "fruitId": "yomi-yomi-no-mi",
    "name": {
      "english": "Revive-Revive Fruit",
      "japanese": "ヨミヨミの実",
      "romanized": "Yomi Yomi no Mi",
      "meaning": "Yomi (Japanese underworld) + Yomigaeru (to be resurrected)"
    },
    "debutEpisode": 337,
    "debutChapter": 442,
    "episodeAppearances": [337],
    "type": "PARAMECIA",
    "currentUser": {
      "characterId": "brook",
      "episodeConsumed": "unknown",
      "status": "ACTIVE"
    },
    "previousUsers": [],
    "abilities": [
      {
        "abilityId": "yomi-yomi-resurrection",
        "abilityName": "Resurrection",
        "description": "Grants the user's soul the power to resurrect after their first death, allowing them to return to life one time.",
        "episodeFirstUsed": "unknown",
        "limitations": "Only activates upon death; can only be used once; if the body has decomposed, the user returns as a skeleton."
      }
    ],
    "awakening": {
      "isAwakened": false,
      "awakeningEpisode": null,
      "awakeningAbilities": []
    },
    "weaknesses": [
      "Standard Devil Fruit weaknesses (seawater, Sea-Prism Stone)",
      "Primary resurrection power can only be used once",
      "Requires the soul to locate the original body after death"
    ],
    "keyMoments": [
      {
        "episodeNumber": 337,
        "eventId": "ep337-event-007",
        "momentType": "FIRST_APPEARANCE",
        "title": "Yomi Yomi no Mi's Effect Revealed",
        "description": "Brook appears as a living skeleton, demonstrating the result of the Yomi Yomi no Mi's resurrection power. Though the fruit may not be named in this episode, its effect is clearly visible.",
        "significance": "First visual evidence of one of One Piece's most unique Devil Fruit powers - the ability to return from death.",
        "timestamp": "16:00"
      }
    ],
    "appearance": {
      "shape": "Unknown",
      "color": "Unknown",
      "pattern": "Unknown"
    },
    "trivia": [
      "The Yomi Yomi no Mi is one of the few Devil Fruits whose primary power (resurrection) can only be used once",
      "The fruit's name references Yomi, the Japanese underworld from Shinto mythology",
      "Brook's afro mysteriously survived decomposition, which he attributes to his roots being strong"
    ],
    "culturalReferences": [
      {
        "reference": "Yomi - the land of the dead in Japanese mythology",
        "description": "The fruit's name directly references the Japanese underworld, connecting to its death-defying power"
      }
    ],
    "images": []
  }
]
