[
  {
    "id": "theory-ep550-001",
    "title": "Energy Steroids Are Failed Sulong Pills",
    "summary": "A theory proposing that Energy Steroids from the Fish-Man Island arc are botched attempts to replicate the Sulong transformation that Mink tribes can achieve under a full moon.",
    "fullText": "The theory connects Energy Steroids to the Minks' Sulong transformation, noting striking similarities like white hair transformation and powerful effects. When Hody Jones consumed Energy Steroids, he gained white hair and experienced what appears to be accelerated aging - similar to how Sulong users' hair/fur turns white and untrained users fight uncontrollably until they die of exhaustion. The theory suggests that Energy Steroids might be a failed attempt to replicate Sulong benefits artificially. The critical flaw is that Sulong has a built-in safety mechanism where covering the eyes prevents transformation, but artificially-induced Sulong through steroids would lack this control mechanism, making it dangerously uncontrollable and potentially fatal without external intervention like being knocked unconscious. The author speculates that unknown creators could develop improved versions or that Chopper might create safer alternatives.",
    "author": "samearl13",
    "source": {
      "url": "https://samearl13.wordpress.com/2018/03/17/one-piece-theoryare-energy-steroids-failed-sulong-pills/",
      "title": "One Piece Theory: Are Energy Steroids Failed Sulong Pills?",
      "platform": "WordPress Blog",
      "accessedAt": "2025-12-24"
    },
    "postedDate": "2018-03-17",
    "episodeRange": [550, 880],
    "minEpisode": 550,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 880
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": ["hody-jones", "carrot"],
    "relatedLocations": ["fish-man-island", "zou"],
    "relatedEvents": ["ep550-event-010"],
    "tags": ["energy-steroids", "sulong", "minks", "fish-men", "transformation", "scientific-theory"]
  },
  {
    "id": "theory-ep550-002",
    "title": "Energy Steroids Have a Deeper Connection to the Minks",
    "summary": "An extension of the Sulong theory that explores potential connections between fish-men and minks through the Energy Steroids.",
    "fullText": "This theory, discussed on Worstgen forums, suggests there might be a deeper connection between fish-men and minks beyond just the Energy Steroids resembling Sulong. The theory explores the possibility that someone or some organization attempted to study or replicate Mink abilities for use by fish-men, resulting in the flawed Energy Steroid pills. The theory notes that both races have unique physiological abilities tied to their species (fish-men with water manipulation, minks with Electro and Sulong), and the Energy Steroids might represent an attempt to cross-pollinate these racial abilities. Some theorists speculate this could be connected to larger world government experiments or ancient research from the Void Century.",
    "author": "Worstgen Community",
    "source": {
      "url": "https://worstgen.alwaysdata.net/forum/threads/the-energy-steroids-the-deeper-connection-between-the-fishmen-and-the-minks.3147/",
      "title": "The Energy Steroids The Deeper Connection between The Fishmen and the Minks",
      "platform": "Worstgen",
      "accessedAt": "2025-12-24"
    },
    "postedDate": "2020",
    "episodeRange": [550, 900],
    "minEpisode": 550,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 900
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": ["hody-jones"],
    "relatedLocations": ["fish-man-island", "zou"],
    "relatedEvents": ["ep550-event-010", "ep550-event-011"],
    "tags": ["energy-steroids", "minks", "fish-men", "world-government", "void-century", "scientific-experiments"]
  }
]
