[
  {
    "name": {
      "english": "Artificial Uo Uo no Mi, Model: Seiryu",
      "japanese": "人造ウオウオの実 モデル:青龍",
      "romanized": "Jinzō Uo Uo no Mi, Moderu: Seiryū"
    },
    "type": "ARTIFICIAL_ZOAN_MYTHICAL",
    "debutEpisode": 611,
    "debutChapter": 685,
    "description": "An artificial Devil Fruit created by Dr. Vegapunk using Kaido's lineage factor in an attempt to replicate the Uo Uo no Mi, Model: Seiryu. The fruit grants the user the ability to transform into an Azure Dragon, though the transformation produces a pink-bodied dragon with a yellow mane instead of the original's blue coloring. Vegapunk deemed it a 'failure' solely due to this color discrepancy, despite the fruit functioning perfectly otherwise.",
    "episodeAppearances": [611],
    "currentUser": {
      "characterId": "momonosuke",
      "episodeGained": 611,
      "method": "CONSUMED"
    },
    "previousUsers": [],
    "abilities": [
      {
        "abilityName": "Dragon Transformation",
        "description": "Allows the user to transform into a pink Azure Dragon with a yellow mane. The transformation is initially involuntary for inexperienced users.",
        "episodeFirstShown": 611,
        "limitations": "Early usage shows automatic transformations and difficulty reverting to human form, though these stem from the user's inexperience rather than fruit defects."
      },
      {
        "abilityName": "Flame Clouds",
        "description": "The user can generate flame clouds that serve as stepping stones for flight, similar to Kaido's abilities.",
        "episodeFirstShown": 612,
        "limitations": "Requires practice to master effectively."
      }
    ],
    "awakening": {
      "isAwakened": false,
      "awakeningEpisode": null,
      "awakeningAbilities": []
    },
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness to seawater and Seastone",
        "severity": "STANDARD"
      },
      {
        "weakness": "Deemed a 'failure' by Vegapunk due to incorrect coloring (pink instead of blue)",
        "severity": "COSMETIC"
      }
    ],
    "createdBy": "Dr. Vegapunk",
    "creationMethod": "Created using Kaido's lineage factor to replicate the Uo Uo no Mi, Model: Seiryu",
    "keyMoments": [
      {
        "episodeNumber": 611,
        "eventId": "ep611-event-006",
        "momentType": "FIRST_APPEARANCE",
        "title": "Artificial Devil Fruit Discovered",
        "description": "Momonosuke discovers the pink artificial fruit in a secret room of the research facility.",
        "significance": "First appearance of Vegapunk's artificial Mythical Zoan fruit in the series.",
        "timestamp": "11:30"
      },
      {
        "episodeNumber": 611,
        "eventId": "ep611-event-007",
        "momentType": "POWER_REVEAL",
        "title": "Momonosuke Consumes the Fruit",
        "description": "Driven by hunger after ten days without food, Momonosuke eats the artificial Devil Fruit and transforms into a dragon.",
        "significance": "The fruit's powers are activated, demonstrating that it functions despite being labeled a failure.",
        "timestamp": "13:00"
      },
      {
        "episodeNumber": 611,
        "eventId": "ep611-event-013",
        "momentType": "WORLD_LORE",
        "title": "Fruit's Origin Revealed",
        "description": "Caesar's subordinates reveal the fruit was created by Vegapunk using Kaido's lineage factor and was deemed a failure.",
        "significance": "First confirmation that artificial Mythical Zoan fruits can be created and connects to Kaido's powers.",
        "timestamp": "21:30"
      }
    ],
    "trivia": [
      "This is the first artificial Mythical Zoan Devil Fruit shown in the series",
      "Vegapunk considered it a failure only because of its pink coloring, not its functionality",
      "The fruit successfully replicates Kaido's Uo Uo no Mi abilities despite the color difference",
      "It was abandoned on Punk Hazard when Vegapunk left the facility"
    ]
  }
]
