[
  {
    "name": {
      "english": "Grand Jipangu",
      "japanese": "グランド・ジパング",
      "romanized": "Gurando Jipangu"
    },
    "type": "REGION",
    "debutEpisode": 406,
    "debutChapter": null,
    "episodeAppearances": [406],
    "keyEvents": [
      {
        "episodeNumber": 406,
        "eventId": "ep406-event-001",
        "description": "The mikoshi race is announced in Grand Jipangu, the alternate universe version of the Grand Line set in Edo period Japan.",
        "timestamp": "02:00"
      }
    ],
    "description": "An alternate universe version of the Grand Line reimagined as Edo period Japan. Grand Jipangu is the setting for the Boss Luffy Historical Special episodes, featuring traditional Japanese architecture, culture, and customs.",
    "geography": "A Japanese-style region with traditional towns, rivers, and cultural landmarks typical of the Edo period.",
    "climate": null,
    "culture": "Based on Edo period Japanese culture, featuring traditional festivals like mikoshi races, honorifics, and period-appropriate customs.",
    "inhabitants": ["Alternate universe versions of One Piece characters"],
    "politicalStatus": null,
    "reveals": [
      {
        "infoType": "SETTING",
        "information": "Grand Jipangu is an Edo period Japanese alternate universe version of the One Piece world",
        "episodeRevealed": 406,
        "severity": "MINOR"
      }
    ],
    "images": []
  },
  {
    "name": {
      "english": "Pinwheel Eatery",
      "japanese": "風車の食堂",
      "romanized": "Kazaguruma no Shokudō"
    },
    "type": "ESTABLISHMENT",
    "debutEpisode": 406,
    "debutChapter": null,
    "episodeAppearances": [406],
    "keyEvents": [
      {
        "episodeNumber": 406,
        "eventId": "ep406-event-007",
        "description": "Boss Luffy's crew returns to the Pinwheel Eatery to discover their mikoshi has been destroyed by the Thriller Company.",
        "timestamp": "16:45"
      },
      {
        "episodeNumber": 406,
        "eventId": "ep406-event-009",
        "description": "The crew gathers at the Pinwheel Eatery to plan their rebuild and prepare for the mikoshi race despite the sabotage.",
        "timestamp": "20:00"
      }
    ],
    "description": "A traditional Japanese eatery that serves as the base of operations for Boss Luffy and his crew in the alternate universe. The team representing the Pinwheel Eatery competes in the mikoshi race.",
    "geography": "A traditional Edo period establishment with dining areas and workspace for mikoshi construction.",
    "climate": null,
    "culture": "Functions as both a restaurant and gathering place for Boss Luffy's group.",
    "inhabitants": ["Boss Luffy", "Onami (Nami)", "Usopp", "Chopper", "Sanji"],
    "politicalStatus": null,
    "reveals": [],
    "images": []
  }
]
