[
  {
    "name": {
      "english": "Gum-Gum Fruit",
      "japanese": "ゴムゴムの実",
      "romanized": "Gomu Gomu no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 1,
    "debutChapter": 1,
    "description": "Grants the user's body the properties of rubber, allowing them to stretch and become immune to blunt attacks and electricity.",
    "episodeAppearances": [565],
    "users": [
      {
        "characterId": "luffy",
        "episodeStart": 1,
        "episodeEnd": "present",
        "circumstances": "Luffy ate the fruit as a child"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Gomu Gomu no Red Hawk",
        "episodeRevealed": 565,
        "description": "After activating Gear Second, Luffy coats his arm with Armament Haki and stretches it back before launching a high-speed punch that ignites into flames, dealing devastating damage.",
        "severity": "CRITICAL",
        "firstUseContext": "Luffy uses Red Hawk against Hody Jones at Gyoncorde Plaza, sending him flying to the Noah ship with overwhelming force. The technique is a tribute to his late brother Ace's Fire Fist attack."
      }
    ],
    "weaknesses": [],
    "strengths": [],
    "awakening": null,
    "rarity": "COMMON",
    "powerTier": "HIGH"
  },
  {
    "name": {
      "english": "Revive-Revive Fruit",
      "japanese": "ヨミヨミの実",
      "romanized": "Yomi Yomi no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 337,
    "debutChapter": 442,
    "description": "Strengthens the user's soul to the point where they resurrect after their first death, allowing them to live a second time and to use several soul-based abilities.",
    "episodeAppearances": [565],
    "users": [
      {
        "characterId": "brook",
        "episodeStart": 337,
        "episodeEnd": "present",
        "circumstances": "Brook ate the fruit before dying, allowing his soul to return to his body"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Soul Body Reassembly",
        "episodeRevealed": 565,
        "description": "Brook's soul can maintain corporeal existence even when his physical body is damaged or separated, allowing him to reassemble his skeletal structure.",
        "severity": "MAJOR",
        "firstUseContext": "During his fight with Zeo, Brook's head is severed but he reattaches it using his soul's power, demonstrating the true extent of the Yomi Yomi no Mi beyond simple resurrection."
      },
      {
        "abilityName": "Soul Solid",
        "episodeRevealed": 565,
        "description": "Brook can imbue his sword with his soul's energy, bringing the freezing cold of the underworld into the physical world. The blade becomes extremely cold and can freeze opponents' blood solid.",
        "severity": "MAJOR",
        "firstUseContext": "Brook uses Soul Solid against Zeo, demonstrating his ability to weaponize his soul energy through his sword."
      }
    ],
    "weaknesses": [],
    "strengths": [
      {
        "strength": "Soul Manipulation",
        "episodeRevealed": 565,
        "description": "The fruit allows the user to control and manipulate their own soul, enabling abilities beyond the initial resurrection power.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "MEDIUM"
  },
  {
    "name": {
      "english": "Human-Human Fruit",
      "japanese": "ヒトヒトの実",
      "romanized": "Hito Hito no Mi"
    },
    "type": "ZOAN",
    "debutEpisode": 81,
    "debutChapter": 134,
    "description": "Allows the user, if an animal, to transform into a human and human-hybrid form, gaining human intelligence and abilities.",
    "episodeAppearances": [565],
    "users": [
      {
        "characterId": "chopper",
        "episodeStart": 81,
        "episodeEnd": "present",
        "circumstances": "Chopper, a reindeer, ate the fruit and gained human-like intelligence"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Controlled Monster Point",
        "episodeRevealed": 565,
        "description": "Using a single Rumble Ball, Chopper can transform into his massive Monster Point form while maintaining full conscious control for three minutes, unlike the berserk state it previously caused.",
        "severity": "MAJOR",
        "firstUseContext": "Chopper demonstrates his controlled Monster Point transformation at Gyoncorde Plaza, showing he has mastered this previously uncontrollable form through his two-year training."
      }
    ],
    "weaknesses": [],
    "strengths": [],
    "awakening": null,
    "rarity": "COMMON",
    "powerTier": "MEDIUM"
  }
]
