[
  {
    "name": {
      "english": "Enies Lobby",
      "japanese": "エニエス・ロビー",
      "romanized": "Eniesu Robī"
    },
    "type": "Island",
    "debutEpisode": 263,
    "debutChapter": 375,
    "episodeAppearances": [294],
    "keyEvents": [
      {
        "episodeNumber": 294,
        "eventId": "ep294-event-001",
        "eventType": "WORLD_LORE",
        "title": "Buster Call Activated on Enies Lobby",
        "description": "Spandam accidentally triggers the Buster Call on Enies Lobby, condemning the entire island to destruction within 30 minutes.",
        "significance": "This marks Enies Lobby for complete annihilation, creating a time limit for all ongoing battles and forcing a mass evacuation of Marines and government agents.",
        "timestamp": "05:30"
      },
      {
        "episodeNumber": 294,
        "eventId": "ep294-event-003",
        "eventType": "MAJOR_DECISION",
        "title": "Marine Evacuation Begins",
        "description": "Marines and government agents begin evacuating Enies Lobby, abandoning allied forces like the Galley-La foremen and Franky Family members.",
        "significance": "Demonstrates the indiscriminate nature of the Buster Call and the World Government's willingness to sacrifice anyone, even their own allies.",
        "timestamp": "10:45"
      }
    ],
    "status": "ACTIVE",
    "statusHistory": [
      {
        "status": "ACTIVE",
        "episodeStart": 263,
        "episodeEnd": 294,
        "description": "Government judicial island operating normally"
      },
      {
        "status": "CONDEMNED",
        "episodeStart": 294,
        "episodeEnd": null,
        "description": "Buster Call activated, marked for destruction"
      }
    ],
    "description": "Enies Lobby is a government-controlled island that serves as a judicial facility. Known as the 'island that never sleeps' due to perpetual daylight, it houses the Gates of Justice and serves as one of three key World Government strongholds.",
    "geography": "Island with perpetual daylight, connected to the Gates of Justice",
    "significance": "One of three key World Government strongholds, serves as a judicial facility where criminals are processed before being sent to Impel Down or executed."
  },
  {
    "name": {
      "english": "Tower of Justice",
      "japanese": "司法の塔",
      "romanized": "Shihō no Tō"
    },
    "type": "Building",
    "debutEpisode": 264,
    "debutChapter": 375,
    "episodeAppearances": [294],
    "keyEvents": [
      {
        "episodeNumber": 294,
        "eventId": "ep294-event-004",
        "eventType": "BATTLE_START",
        "title": "Luffy vs Rob Lucci Begins",
        "description": "Luffy confronts Rob Lucci in a storage room within the Tower of Justice, beginning their climactic battle.",
        "significance": "The Tower of Justice becomes the battleground for the most important fight of the Enies Lobby arc.",
        "timestamp": "12:00"
      },
      {
        "episodeNumber": 294,
        "eventId": "ep294-event-005",
        "eventType": "POWER_REVEAL",
        "title": "Chopper's Monster Point Rampage",
        "description": "Monster Point Chopper rampages through the Tower of Justice, attacking friends and foes indiscriminately.",
        "significance": "The tower becomes a chaotic battleground with multiple simultaneous fights and an uncontrollable monster.",
        "timestamp": "14:20"
      }
    ],
    "status": "ACTIVE",
    "statusHistory": [],
    "description": "The central tower of Enies Lobby where the most important judicial proceedings take place. It contains multiple floors with various rooms and serves as the location where Robin is being held and escorted to the Gates of Justice.",
    "geography": "Multi-story tower structure at the center of Enies Lobby",
    "significance": "The main battleground for the Straw Hats' rescue of Robin, housing multiple simultaneous CP9 battles."
  }
]
