[
  {
    "id": "cola",
    "name": {
      "english": "Cola",
      "japanese": "コーラ",
      "romanized": "Kōra"
    },
    "itemType": "CONSUMABLE",
    "debutEpisode": 288,
    "description": "A carbonated beverage that serves as Franky's power source. Franky calls it 'the water of life' as it fuels his cyborg body and maintains his combat abilities and aggressive personality.",
    "episodeAppearances": [288],
    "keyMoments": [
      {
        "episodeNumber": 288,
        "eventId": "ep288-event-011",
        "momentType": "ITEM_USE",
        "title": "Cola Powers Up Franky",
        "description": "After receiving wrong beverages multiple times, Franky finally gets three bottles of cola from Chopper and powers back up to full strength.",
        "significance": "Establishes cola as essential to Franky's character and combat effectiveness - it's literally his life force.",
        "timestamp": "21:45"
      }
    ],
    "relatedCharacters": ["franky"],
    "significance": "Cola is fundamental to Franky's character design and abilities. It serves both as a power source for his cyborg body and as a recurring plot element and source of comedy.",
    "reveals": [
      {
        "infoType": "ITEM_PROPERTY",
        "information": "Cola is the only beverage that properly fuels Franky's cyborg body - other beverages cause personality changes and combat weakness",
        "episodeRevealed": 288,
        "severity": "MAJOR"
      }
    ]
  },
  {
    "id": "vegetable-juice",
    "name": {
      "english": "Vegetable Juice",
      "japanese": "野菜ジュース",
      "romanized": "Yasai Jūsu"
    },
    "itemType": "CONSUMABLE",
    "debutEpisode": 288,
    "description": "A healthy beverage that, when consumed by Franky instead of cola, transforms him into 'Fresh Franky' with onion-shaped hair and a health-conscious personality, rendering him combat-ineffective.",
    "episodeAppearances": [288],
    "keyMoments": [
      {
        "episodeNumber": 288,
        "eventId": "ep288-event-008",
        "momentType": "ITEM_USE",
        "title": "Franky Becomes Fresh Franky",
        "description": "Chopper mistakenly gives Franky vegetable juice instead of cola, causing him to transform into a vegetable-themed persona with no combat power.",
        "significance": "Demonstrates the comedic consequences of Franky using wrong fuel and establishes his beverage-dependent personality changes.",
        "timestamp": "18:00"
      }
    ],
    "relatedCharacters": ["franky", "chopper"],
    "significance": "Part of the comedic running gag about Franky's fuel requirements and personality changes.",
    "reveals": []
  },
  {
    "id": "tea",
    "name": {
      "english": "Tea",
      "japanese": "お茶",
      "romanized": "Ocha"
    },
    "itemType": "CONSUMABLE",
    "debutEpisode": 288,
    "description": "A calming beverage that, when consumed by Franky, gives him wavy hair and a refined, peaceful personality, making him want to stop fighting and have tea instead.",
    "episodeAppearances": [288],
    "keyMoments": [
      {
        "episodeNumber": 288,
        "eventId": "ep288-event-010",
        "momentType": "ITEM_USE",
        "title": "Tea-Powered Franky",
        "description": "Chopper gives Franky tea instead of cola, causing him to adopt a calm demeanor and suggest having tea with his opponent rather than fighting.",
        "significance": "Further demonstrates the comedic beverage personality changes.",
        "timestamp": "20:30"
      }
    ],
    "relatedCharacters": ["franky", "chopper"],
    "significance": "Part of the running gag about Franky's beverage-dependent personalities.",
    "reveals": []
  }
]
