[
  {
    "abilityName": "Gomu Gomu no Jet Pistol",
    "abilityType": "DEVIL_FRUIT",
    "debutEpisode": 307,
    "debutChapter": 425,
    "description": "A Gear Second-enhanced version of Luffy's signature Gomu Gomu no Pistol technique. By combining his rubber body's elasticity with the dramatically increased speed and power of Gear Second, Luffy delivers a devastating punch that can blast opponents backward with tremendous force.",
    "characterId": "luffy",
    "devilFruitId": "gomu-gomu-no-mi",
    "firstUsedAgainst": "Rob Lucci",
    "episodeAppearances": [307],
    "relatedAbilities": ["gomu-gomu-no-pistol", "gear-second"],
    "strengthLevel": "MAJOR",
    "limitations": "Requires Gear Second to be active, which puts strain on Luffy's body and has a time limit.",
    "evolutionNotes": "This technique represents Luffy's evolution from basic rubber attacks to speed-enhanced combat, developed specifically to match CP9's Rokushiki techniques."
  },
  {
    "abilityName": "Gomu Gomu no Jet Bullet",
    "abilityType": "DEVIL_FRUIT",
    "debutEpisode": 307,
    "debutChapter": 425,
    "description": "A Gear Second-enhanced concentrated strike where Luffy stretches his arm back and launches a powerful punch aimed at the opponent's torso. The increased velocity from Gear Second makes this attack devastating enough to hurt even the toughest opponents.",
    "characterId": "luffy",
    "devilFruitId": "gomu-gomu-no-mi",
    "firstUsedAgainst": "Rob Lucci",
    "episodeAppearances": [307],
    "relatedAbilities": ["gomu-gomu-no-bullet", "gear-second"],
    "strengthLevel": "MAJOR",
    "limitations": "Requires Gear Second to be active, which puts strain on Luffy's body. The concentrated nature of the attack also requires precise targeting.",
    "evolutionNotes": "Part of Luffy's growing arsenal of Gear Second techniques, showcasing his ability to adapt his existing moves to the enhanced form."
  },
  {
    "abilityName": "Gear Second",
    "abilityType": "DEVIL_FRUIT",
    "debutEpisode": 272,
    "debutChapter": 387,
    "description": "One of Luffy's most iconic power-ups, Gear Second accelerates his blood flow by using his rubber body as a pump, dramatically increasing his speed, power, and metabolism. Steam rises from his body as a visual indicator of the technique's activation. In this episode, Luffy uses it for the second time against Rob Lucci.",
    "characterId": "luffy",
    "devilFruitId": "gomu-gomu-no-mi",
    "firstUsedAgainst": "Blueno",
    "episodeAppearances": [307],
    "relatedAbilities": ["gomu-gomu-no-jet-pistol", "gomu-gomu-no-jet-bullet"],
    "strengthLevel": "CRITICAL",
    "limitations": "Puts significant strain on Luffy's body and cardiovascular system. Early uses had strict time limits and left Luffy exhausted afterward.",
    "evolutionNotes": "Luffy developed this technique after observing CP9's Soru (Shave) technique, demonstrating his combat genius and adaptability. This is the second activation against Lucci in their battle."
  }
]
