[
  {
    "theoryTitle": "Gear Second's Long-term Health Effects",
    "theoryText": "Some fans theorized during the Enies Lobby arc that Luffy's repeated use of Gear Second, which dramatically accelerates his blood flow and metabolism, could be shortening his lifespan or causing long-term damage to his body. The strain visible when he uses the technique suggested significant physical costs.",
    "author": "Multiple One Piece community members",
    "platform": "Various discussion forums",
    "publishDate": null,
    "url": null,
    "episodesSpanned": [272, 307, 309],
    "spoilerStatus": "SAFE_FOR_EPISODE_307",
    "containsSpoilersBeyond": false,
    "popularityMetrics": {
      "upvotes": null,
      "views": null,
      "engagement": "MEDIUM"
    },
    "theoryStatus": "PARTIALLY_CONFIRMED",
    "confirmationDetails": "Later revealed that Gear Second does put strain on Luffy's body and in early uses left him exhausted, though Luffy eventually masters it to reduce the negative effects. The series later confirms that Luffy's various power-ups do come with physical costs.",
    "relatedTheories": [],
    "notes": "This theory was common during the initial airing of the Enies Lobby arc when Gear Second was new and its limitations were unclear."
  },
  {
    "theoryTitle": "The Giants' Survival",
    "theoryText": "When Oimo and Kashii fell into the waterfall after being hit by the Buster Call, many fans immediately theorized they couldn't actually be dead. Given their size, durability, and the fact that Paulie had his ropes, fans predicted they would be revealed as survivors in upcoming episodes.",
    "author": "One Piece community consensus",
    "platform": "Various discussion forums",
    "publishDate": null,
    "url": null,
    "episodesSpanned": [307, 311],
    "spoilerStatus": "SAFE_FOR_EPISODE_307",
    "containsSpoilersBeyond": true,
    "popularityMetrics": {
      "upvotes": null,
      "views": null,
      "engagement": "HIGH"
    },
    "theoryStatus": "CONFIRMED",
    "confirmationDetails": "Confirmed in Episode 311 when it's revealed that Paulie's ropes saved everyone and the giants took the brunt of the damage but survived.",
    "relatedTheories": [],
    "notes": "Most fans correctly predicted this outcome based on One Piece's typical storytelling patterns and the importance of these characters."
  }
]
