[
  {
    "id": "theory-ep580-001",
    "title": "Dragon Number Thirteen's Connection to Ancient Dragons",
    "summary": "A theory that Vegapunk's artificial dragons, particularly Dragon Number Thirteen, were based on ancient dragon species or even related to the ancient weapons and the Void Century.",
    "fullText": "Fans have theorized that Vegapunk didn't create the dragons from scratch but rather studied ancient dragon DNA or blueprints from the Void Century. The fact that Dragon Number Thirteen can speak suggests it has intelligence beyond normal animals, possibly connected to ancient Zoan devil fruits or the legendary dragons mentioned in One Piece lore. This could explain why Vegapunk had twelve failed attempts before creating a successful dragon - he was trying to replicate something from the ancient past.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Dragon_Number_Thirteen",
      "title": "Dragon Number Thirteen - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2026-01-01"
    },
    "postedDate": "Unknown",
    "episodeRange": [580, 900],
    "minEpisode": 580,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 900
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": ["vegapunk", "dragon-number-thirteen"],
    "relatedLocations": ["punk-hazard"],
    "relatedEvents": ["ep580-event-001"],
    "tags": ["vegapunk", "ancient-dragons", "void-century", "artificial-creatures"]
  },
  {
    "id": "theory-ep580-002",
    "title": "Kin'emon's Dismemberment Was Intentional by Law",
    "summary": "A theory that Trafalgar Law intentionally dismembered Kin'emon and scattered his body parts to protect him or hide him from Caesar Clown's forces.",
    "fullText": "When Kin'emon's legs are discovered on Dragon Number Thirteen in episode 580, it raises the question of why Law would dismember and scatter the samurai. Some fans theorize that Law did this intentionally to either protect Kin'emon from Caesar's experiments or to hide his presence on the island. The fact that the legs ended up on the dragon and survived suggests Law may have calculated this outcome. This theory gained more credence later when it's revealed that Kin'emon survived a fatal blow during the Wano arc because Law's body separation was never fully 'healed.'",
    "author": "Reddit/One Piece Community",
    "source": {
      "url": "https://www.cbr.com/one-piece-chapter-1030-spoilers-kinemon/",
      "title": "One Piece: Kin'emon's Severed Legs Are Actually Pretty Messed Up",
      "platform": "CBR",
      "accessedAt": "2026-01-01"
    },
    "postedDate": "2021",
    "episodeRange": [580, 1030],
    "minEpisode": 580,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1030
    },
    "popularity": {},
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["kinemon", "trafalgar-law"],
    "relatedLocations": ["punk-hazard"],
    "relatedEvents": ["ep580-event-006"],
    "tags": ["kinemon", "trafalgar-law", "body-separation", "wano-connection"]
  },
  {
    "id": "theory-ep580-003",
    "title": "The Hazmat Figures Work for a Former Colleague of Vegapunk",
    "summary": "Fans theorized that the mysterious hazmat-suited figures with 'PH' markings work for someone connected to Vegapunk, possibly a former colleague conducting experiments on Punk Hazard.",
    "fullText": "When the hazmat-suited individuals appear at the end of episode 580 and capture the Straw Hats, fans immediately began theorizing about who their 'master' could be. Given the presence of Vegapunk's dragon on the island and the scientific nature of the sleeping gas attack, many theorized these were subordinates of a scientist, possibly Caesar Clown, who was later confirmed to be a former colleague of Vegapunk. The 'PH' marking on their suits was correctly theorized to stand for Punk Hazard, suggesting they were the island's current occupants.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_580",
      "title": "Episode 580 - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2026-01-01"
    },
    "postedDate": "2013",
    "episodeRange": [580, 585],
    "minEpisode": 580,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 585
    },
    "popularity": {},
    "status": "CONFIRMED",
    "relatedCharacters": ["caesar-clown", "vegapunk"],
    "relatedLocations": ["punk-hazard"],
    "relatedEvents": ["ep580-event-011"],
    "tags": ["caesar-clown", "vegapunk", "punk-hazard", "hazmat-suits"]
  }
]
