[
  {
    "id": "theory-ep561-001",
    "title": "Noah's True Purpose: World Flood Evacuation",
    "summary": "Noah was built not just as a promise to Joy Boy, but as an ark to evacuate Fish-Man Island when the world floods, similar to the biblical Noah's Ark story.",
    "fullText": "Fans theorize that the world of One Piece will soon be flooded, as Vegapunk revealed in later chapters, causing destruction on many islands. Noah, an ark gifted to Fish-men by Joy Boy, may have been specifically designed to save the Fish-Man Island population during this apocalyptic event. The ship's enormous size (nearly half the size of Fish-Man Island itself) supports this theory, as it would need to hold the entire population. The 'Ship of Promise' may refer to Joy Boy's promise to help the Fish-men and merfolk survive a global catastrophe. This theory gained traction after episode 561 showed Noah falling toward Fish-Man Island, highlighting the ship's immense scale and importance.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://screenrant.com/one-piece-noha-joyboy-foreshadowed-world-origin/",
      "title": "One Piece Foreshadowed its World's Real Origin Years Ago",
      "platform": "ScreenRant",
      "accessedAt": "2025-12-25"
    },
    "postedDate": "2024-01-01",
    "episodeRange": [561, 1113],
    "minEpisode": 561,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1113
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["joy-boy", "shirahoshi"],
    "relatedLocations": ["fish-man-island", "noah"],
    "relatedEvents": ["ep561-event-010"],
    "tags": ["noah", "joy-boy", "world-flood", "ancient-history", "prophecy"]
  },
  {
    "id": "theory-ep561-002",
    "title": "Joy Boy's Failed War and the Broken Promise",
    "summary": "Joy Boy made a deal with Fish-Men to create Noah for mass migration to the surface, but he lost a war during the Void Century and couldn't fulfill his promise.",
    "fullText": "This theory suggests that Joy Boy formed an alliance with different races including Fish-Men, Buccaneers, and Giants during the Void Century war. As part of this alliance, Joy Boy promised to help Fish-Men migrate to the surface using Noah and the power of Poseidon (the ancient weapon). However, Joy Boy's side lost the war against what would become the World Government, preventing him from fulfilling his promise. This explains why Joy Boy left an apology on the Poneglyph in the Sea Forest and why the Neptune royal family has protected Noah for centuries, waiting for Joy Boy's successor. The theory gained significance when episode 561 showed the crisis of Noah falling, emphasizing the unfulfilled nature of the ancient promise and the ship's importance to Fish-Man Island's future.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://www.fanverse.org/threads/now-we-know-why-ship-is-called-noah-and-why-joy-boy-failed-to-fulfil-his-promise.1318871/",
      "title": "Now we know why ship is called Noah and why Joy Boy failed to fulfil his promise",
      "platform": "FanVerse",
      "accessedAt": "2025-12-25"
    },
    "postedDate": "2023-01-01",
    "episodeRange": [528, 1100],
    "minEpisode": 528,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["joy-boy", "shirahoshi", "neptune"],
    "relatedLocations": ["fish-man-island", "noah"],
    "relatedEvents": ["ep561-event-010"],
    "tags": ["joy-boy", "noah", "void-century", "ancient-history", "poseidon"]
  },
  {
    "id": "theory-ep561-003",
    "title": "Luffy Will Destroy Fish-Man Island to Fulfill Prophecy and Promise",
    "summary": "Madam Shyarly's prophecy that Luffy will destroy Fish-Man Island will be fulfilled when Luffy helps use Noah to evacuate everyone before the Red Line falls and crushes the island.",
    "fullText": "This comprehensive theory connects multiple plot threads: Madam Shyarly prophesied that Luffy would destroy Fish-Man Island. However, rather than being villainous, Luffy will 'destroy' the island by helping evacuate everyone using Noah, with Shirahoshi's Poseidon powers controlling Sea Kings to pull the ship. The island's 'destruction' will occur when the Red Line is destroyed (possibly using Pluton), and since Fish-Man Island is directly beneath the Red Line, falling debris will crush the island. This would fulfill both Joy Boy's promise (using Noah to bring Fish-Men to the surface) and Shyarly's prophecy (Luffy being involved in the island's destruction). Episode 561's crisis of Noah falling foreshadows this future event, showing how the massive ship could indeed be used for mass evacuation. The theory suggests Luffy is Joy Boy's spiritual successor who will complete what Joy Boy couldn't.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://www.dexerto.com/anime/one-piece-the-mysteries-surrounding-fish-man-island-2161588/",
      "title": "One Piece: The mysteries surrounding Fish-Man Island",
      "platform": "Dexerto",
      "accessedAt": "2025-12-25"
    },
    "postedDate": "2023-01-01",
    "episodeRange": [528, 1200],
    "minEpisode": 528,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1200
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["luffy", "joy-boy", "shirahoshi", "madam-shyarly"],
    "relatedLocations": ["fish-man-island", "noah", "red-line"],
    "relatedEvents": ["ep561-event-010", "ep528-prophecy"],
    "tags": ["prophecy", "noah", "joy-boy", "luffy", "destruction", "red-line", "poseidon"]
  },
  {
    "id": "theory-ep561-004",
    "title": "Joy Boy Caused Fish-Men Slavery Through Failed Promise",
    "summary": "Joy Boy's failure to fulfill his promise may have indirectly led to centuries of Fish-Men slavery and discrimination by humans.",
    "fullText": "This darker theory proposes that Joy Boy's broken promise had severe consequences for Fish-Man Island. When Joy Boy lost the Void Century war and couldn't help migrate Fish-Men to the surface as promised, they remained trapped underwater and isolated. This isolation and the failed alliance may have contributed to Fish-Men being viewed as 'lesser' beings by surface dwellers, leading to centuries of slavery and discrimination. The theory suggests Joy Boy's apology on the Poneglyph isn't just for breaking a promise, but for the suffering his failure caused. Hody Jones's hatred of humans in episode 561 represents the long-lasting effects of this ancient betrayal, even though Hody himself wasn't directly affected. The Energy Steroids taken by the New Fish-Man Pirates officers in this episode symbolize the Fish-Men's desperation to gain power and recognition, stemming from their historical oppression.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://fandomwire.com/one-piece-joy-boy-apologizing-to-fish-men-in-the-poneglyph-might-have-hinted-he-was-the-reason-behind-their-brutal-slavery/",
      "title": "One Piece: Joy Boy Apologizing to Fish-Men in the Poneglyph Might Have Hinted He Was the Reason Behind Their Brutal Slavery",
      "platform": "FandomWire",
      "accessedAt": "2025-12-25"
    },
    "postedDate": "2024-01-01",
    "episodeRange": [528, 1100],
    "minEpisode": 528,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["joy-boy", "hody-jones", "neptune"],
    "relatedLocations": ["fish-man-island"],
    "relatedEvents": ["ep561-event-004", "ep561-event-006"],
    "tags": ["joy-boy", "slavery", "discrimination", "void-century", "hody-jones"]
  },
  {
    "id": "theory-ep561-005",
    "title": "Vander Decken Wasn't Crazy: Family Mission Theory",
    "summary": "Vander Decken IX's obsession with Shirahoshi wasn't just madness, but the culmination of his family's centuries-long search for someone with Poseidon's power.",
    "fullText": "This theory reframes Vander Decken IX's actions shown in episode 561 in a different light. Rather than being simply insane, Vander Decken IX was continuing his family's ancient mission to find someone who could communicate with Sea Kings - a trait unique to Poseidon, the ancient weapon. When he discovered Shirahoshi possessed this ability, he became obsessed because this was what generations of Vander Deckens had been seeking. His decision to throw Noah at her (shown falling in episode 561) was a desperate attempt to control or eliminate the one thing his family had searched for. The theory suggests the original Vander Decken may have been connected to Joy Boy's promise, and the family spent centuries trying to fulfill or exploit that connection. His 'craziness' was actually dedication to a multigenerational quest that he finally achieved, only to lose control of.",
    "author": "Worstgen Forum Community",
    "source": {
      "url": "https://worstgen.alwaysdata.net/forum/threads/vander-decken-didnt-go-crazy.42080/",
      "title": "Theory - Vander Decken didn't go Crazy",
      "platform": "Worstgen",
      "accessedAt": "2025-12-25"
    },
    "postedDate": "2023-01-01",
    "episodeRange": [528, 565],
    "minEpisode": 528,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 565
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["vander-decken-ix", "shirahoshi"],
    "relatedLocations": ["noah"],
    "relatedEvents": ["ep561-event-009", "ep561-event-010"],
    "tags": ["vander-decken", "poseidon", "shirahoshi", "ancient-weapon", "family-mission"]
  }
]
