[
  {
    "id": "theory-ep602-001",
    "title": "Devil Fruit Reincarnation Proximity Theory",
    "summary": "The theory suggests that Devil Fruits reincarnate into the nearest compatible fruit of the same type when their user dies, based on the apple transformation in episode 602.",
    "fullText": "When Smiley died in episode 602, its Devil Fruit (Sara Sara no Mi, Model: Axolotl) immediately reincarnated into an apple that was nearby on a sled. This suggests that Devil Fruits don't randomly reincarnate anywhere in the world, but rather seek out the closest fruit of a compatible type. Caesar Clown appears to have known about this mechanic, as he strategically placed a bag of apples near where Smiley would die. This raises questions about whether different Devil Fruits reincarnate into specific fruit types (e.g., does the Gomu Gomu no Mi always reincarnate into a melon?) and whether the proximity rule applies universally or only under certain conditions.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Sara_Sara_no_Mi,_Model:_Axolotl",
      "title": "Sara Sara no Mi, Model: Axolotl - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2026-01-04"
    },
    "postedDate": "2013-07-01",
    "episodeRange": [602, 1100],
    "minEpisode": 602,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 700
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["smiley", "caesar-clown"],
    "relatedLocations": ["punk-hazard"],
    "relatedEvents": ["ep602-event-004"],
    "tags": ["devil-fruit", "reincarnation", "mechanics", "lore"]
  },
  {
    "id": "theory-ep602-002",
    "title": "Ancient Kingdom Rebels Soul Theory",
    "summary": "A theory proposing that Devil Fruits contain the souls of Ancient Kingdom rebels who are trapped in an eternal cycle of reincarnation as punishment.",
    "fullText": "Building on the Devil Fruit reincarnation mechanics first shown in episode 602, this theory suggests that Devil Fruits are not just magical items but actually contain the souls of rebels from the Ancient Kingdom who opposed the World Government's predecessors. When a Devil Fruit user dies, the soul doesn't pass on but instead is forced to reincarnate into a new fruit, continuing an eternal cycle. This would explain why Devil Fruits grant such incredible powers - they're literally harnessing the willpower and abilities of ancient warriors. The theory gained traction after episode 602 showed the first on-screen reincarnation, proving that Devil Fruits do follow a cycle of death and rebirth. Some theorists suggest that when Luffy achieved Gear 5, he fully synchronized with his Devil Fruit's soul, which may have been Joy Boy himself.",
    "author": "2Spooky (YouTube)",
    "source": {
      "url": "https://fandomwire.com/one-piece-theory-devil-fruits-are-ancient-kingdom-rebels-trapped-in-eternal-reincarnation-cycle-luffy-gear-5-is-him-fully-syncing-with-his-devil-fruits-soul/",
      "title": "One Piece Theory: Devil Fruits Are Ancient Kingdom Rebels",
      "platform": "Fandom Wire",
      "accessedAt": "2026-01-04"
    },
    "postedDate": "2023-04-01",
    "episodeRange": [602, 1100],
    "minEpisode": 602,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["luffy", "smiley"],
    "relatedLocations": [],
    "relatedEvents": ["ep602-event-004"],
    "tags": ["devil-fruit", "ancient-kingdom", "joy-boy", "souls", "reincarnation", "gear-5"]
  },
  {
    "id": "theory-ep602-003",
    "title": "Monet's Devil Fruit in Nami's Tangerines Theory",
    "summary": "Theory that Monet's Yuki Yuki no Mi (Snow-Snow Fruit) reincarnated into one of Nami's tangerine trees on the Thousand Sunny after Monet's death in Punk Hazard.",
    "fullText": "After episode 602 demonstrated Devil Fruit reincarnation mechanics with Smiley's death, fans began theorizing about where other Devil Fruits from Punk Hazard might have reincarnated. One popular theory suggests that when Monet died later in the Punk Hazard arc, her Yuki Yuki no Mi reincarnated into one of the tangerines growing on Nami's trees aboard the Thousand Sunny. The proximity rule established in episode 602 would support this, as the Sunny was relatively close to Punk Hazard at the time. This theory has significant implications - if true, it means the Straw Hats unknowingly possess a powerful Logia-type Devil Fruit. Some fans speculate this could be a Chekhov's gun that will pay off later in the series, potentially allowing a crew member or ally to gain ice/snow powers.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://www.opfanpage.com/monets-devil-fruit-reincarnated-1n-namis-orange-trees-on-sunny/",
      "title": "Monet's Devil Fruit reincarnated in Nami's orange trees on Sunny?",
      "platform": "One Piece Fan Page",
      "accessedAt": "2026-01-04"
    },
    "postedDate": "2014-01-01",
    "episodeRange": [602, 625],
    "minEpisode": 602,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 625
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["monet", "nami"],
    "relatedLocations": ["punk-hazard", "thousand-sunny"],
    "relatedEvents": ["ep602-event-004"],
    "tags": ["devil-fruit", "monet", "nami", "yuki-yuki-no-mi", "reincarnation", "thousand-sunny"]
  },
  {
    "id": "theory-ep602-004",
    "title": "Caesar's Weapon Buyer Identity Theory",
    "summary": "Theory speculating about the identity of the underworld brokers watching Caesar's Shinokuni demonstration in episode 602.",
    "fullText": "In episode 602, Caesar demonstrates the Shinokuni weapon to various underworld brokers and buyers via video broadcast. Fans have theorized extensively about the identities of these buyers and what their interest in Shinokuni reveals about the larger political landscape of the One Piece world. Some theorists suggest that among the buyers were representatives of Kaido, Big Mom, or other Yonko seeking weapons of mass destruction. Others propose that certain World Government officials may have been secretly watching, interested in acquiring Caesar's technology despite his wanted status. The demonstration in episode 602 establishes that there's a thriving black market for weapons in the New World, and Caesar's willingness to sell to anyone raises questions about which major players might have acquired similar weapons or technology later in the series.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_602",
      "title": "Episode 602 - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2026-01-04"
    },
    "postedDate": "2013-07-15",
    "episodeRange": [602, 700],
    "minEpisode": 602,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 700
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["caesar-clown", "doflamingo"],
    "relatedLocations": ["punk-hazard"],
    "relatedEvents": ["ep602-event-005"],
    "tags": ["caesar-clown", "underworld", "weapons", "yonko", "conspiracy"]
  }
]
