[
  {
    "id": "theory-ep502-001",
    "title": "Sabo Survived the Celestial Dragon Attack",
    "summary": "Theory that Sabo survived Saint Jalmack's bazooka attack and was rescued, based on the fact that his body was never shown and only his hat was seen floating in the water.",
    "fullText": "When episode 502 aired in 2011, many fans theorized that Sabo survived the Celestial Dragon's attack despite the apparent death scene. The primary evidence was that Oda never showed Sabo's body - only his burning hat floating in the water. In One Piece, major character deaths are typically shown explicitly, and the absence of a body was a strong hint that Sabo lived. Fans speculated that someone, possibly Dragon who was in the area with the Revolutionary Army, rescued Sabo from the wreckage. This theory was confirmed in episode 663 when it was revealed that Dragon did indeed save Sabo, though Sabo lost his memories and became the Revolutionary Army's Chief of Staff.",
    "author": "One Piece Fan Community (2011-2015)",
    "source": {
      "url": "https://www.cbr.com/one-piece-giveaways-hints-sabo-still-alive/",
      "title": "One Piece: 6 Giveaways Sabo Was Still Alive",
      "platform": "CBR",
      "accessedAt": "2025-12-15"
    },
    "postedDate": "2011-06-12",
    "episodeRange": [502, 663],
    "minEpisode": 502,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 663
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["sabo", "dragon", "jalmack"],
    "relatedLocations": ["goa-kingdom"],
    "relatedEvents": ["ep502-event-007", "ep502-event-008"],
    "tags": ["sabo", "survival", "dragon", "revolutionary-army", "foreshadowing"]
  },
  {
    "id": "theory-ep502-002",
    "title": "Dragon Rescued Sabo Because He Knew Sabo Was Luffy's Brother",
    "summary": "Early fan theory suggesting Dragon specifically saved Sabo because he knew about Sabo's connection to Luffy.",
    "fullText": "When episode 502 showed Dragon rescuing Sabo, some fans initially theorized that Dragon knew about Sabo's connection to Luffy and specifically saved him for that reason. However, this theory was later proven false - Sabo lost his memories due to the severe injuries from the Celestial Dragon's attack, so he couldn't tell Dragon about his relationship with Luffy and Ace. Dragon rescued Sabo simply because he was saving all the oppressed people in the area, not because of any known connection to his son. The dramatic irony is that Dragon saved his son's sworn brother without either of them knowing their connection.",
    "author": "One Piece Fan Community (2011)",
    "source": {
      "url": "https://gamerant.com/one-piece-how-sabo-survived-explained/",
      "title": "One Piece: How Sabo Survived, Explained",
      "platform": "GameRant",
      "accessedAt": "2025-12-15"
    },
    "postedDate": "2011-06-12",
    "episodeRange": [502, 737],
    "minEpisode": 502,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 737
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "DEBUNKED",
    "relatedCharacters": ["sabo", "dragon", "luffy", "ace"],
    "relatedLocations": ["goa-kingdom"],
    "relatedEvents": ["ep502-event-008"],
    "tags": ["sabo", "dragon", "luffy", "family-connections", "debunked"]
  },
  {
    "id": "theory-ep502-003",
    "title": "Saint Jalmack Will Return as a Major Villain",
    "summary": "Theory that Saint Jalmack, the Celestial Dragon who shot Sabo, will return as a significant antagonist later in the series.",
    "fullText": "Saint Jalmack was introduced in episode 502 as one of the most despicable Celestial Dragons, casually murdering a child (Sabo) for the 'crime' of crossing in front of his ship. Given the emphasis placed on this character and his role in one of the most tragic moments in One Piece, some fans have theorized that Jalmack will return as a major villain. The theory suggests that Sabo, now the Revolutionary Army's Chief of Staff, will eventually confront Jalmack in a dramatic reunion where Sabo gets revenge for the attack that nearly killed him. As of current episodes, this theory remains unconfirmed, though Jalmack has been mentioned in later arcs.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://villains.fandom.com/wiki/Saint_Jalmack",
      "title": "Saint Jalmack - Villains Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-15"
    },
    "postedDate": "2011",
    "episodeRange": [502, 1100],
    "minEpisode": 502,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 502
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["jalmack", "sabo"],
    "relatedLocations": ["goa-kingdom"],
    "relatedEvents": ["ep502-event-006", "ep502-event-007"],
    "tags": ["jalmack", "celestial-dragons", "revenge", "sabo", "future-arc"]
  },
  {
    "id": "theory-ep502-004",
    "title": "Dragon's Wind Powers Are From a Mythical Zoan Devil Fruit",
    "summary": "Theory that Dragon's ability to manipulate wind, as shown when rescuing the Gray Terminal residents in episode 502, comes from a Mythical Zoan-type Devil Fruit.",
    "fullText": "In episode 502, Dragon creates a powerful wind that opens a path through the flames for the Gray Terminal residents to escape. This demonstration of wind manipulation has led to extensive fan speculation about the source of Dragon's powers. One prominent theory is that Dragon possesses a Mythical Zoan Devil Fruit related to wind, weather, or dragons. Some fans speculate it could be a Dragon-Dragon Fruit (matching his name), a Wind-Wind Logia, or even a fruit related to ancient mythological wind deities. The theory is supported by Dragon's epithet as 'The World's Worst Criminal' and the Revolutionary Army's strength, suggesting he would need a powerful Devil Fruit. However, as of current episodes, the source of Dragon's powers has not been confirmed.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Monkey_D._Dragon",
      "title": "Monkey D. Dragon - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-15"
    },
    "postedDate": "2011",
    "episodeRange": [502, 1100],
    "minEpisode": 502,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 502
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["dragon"],
    "relatedLocations": ["gray-terminal"],
    "relatedEvents": ["ep502-event-004"],
    "tags": ["dragon", "devil-fruit", "powers", "wind-manipulation", "mythical-zoan"]
  }
]
