[
  {
    "name": {
      "english": "Ordeal Gates",
      "japanese": "試練の門",
      "romanized": "Shiren no Mon"
    },
    "type": "STRUCTURE",
    "debutEpisode": 159,
    "episodeAppearances": [159],
    "description": "A massive mask-like gate structure in Upper Yard with four distinct entrances, each leading to a different Ordeal. The four paths are: Ordeal of Swamp, Ordeal of Iron, Ordeal of String, and Ordeal of Balls. Each trial is overseen by one of Enel's priests.",
    "geography": "Located in Upper Yard, accessed via the Milky Road from the Sacrificial Altar",
    "significance": "The Ordeal Gates serve as the gateway to Enel's priest trials, forcing anyone who wishes to proceed further into Upper Yard to choose their method of suffering. Each ordeal has a different survival rate.",
    "keyEvents": [
      {
        "episodeNumber": 159,
        "eventId": "ep159-event-009",
        "title": "Luffy's Group Arrives at the Ordeal Gates",
        "description": "After surviving the dangerous Milky Road, Luffy, Sanji, and Usopp arrive at the imposing Ordeal Gates and must choose which trial to face.",
        "timestamp": "19:30"
      },
      {
        "episodeNumber": 159,
        "eventId": "ep159-event-010",
        "title": "The Four Ordeals Revealed",
        "description": "The nature of the four Ordeals and their associated priests is explained, establishing the structure of upcoming challenges.",
        "timestamp": "20:15"
      }
    ],
    "inhabitants": [],
    "controlledBy": "Enel's forces",
    "statusHistory": [
      {
        "status": "ACTIVE",
        "episodeStart": 159,
        "episodeEnd": "present"
      }
    ]
  },
  {
    "name": {
      "english": "Milky Road",
      "japanese": "ミルキーロード",
      "romanized": "Mirukī Rōdo"
    },
    "type": "PATH",
    "debutEpisode": 159,
    "episodeAppearances": [159],
    "description": "A cloud-based road/river system in Upper Yard filled with deadly traps and dangerous creatures. The road connects the Sacrificial Altar to the Ordeal Gates and is heavily defended with automated weapons including blade traps, wooden spears, and razor boomerangs.",
    "geography": "Winds through Upper Yard's forest from the Sacrificial Altar to the Ordeal Gates",
    "significance": "The Milky Road serves as a treacherous gauntlet that tests anyone attempting to reach God's Shrine, demonstrating the extreme danger of Upper Yard and Enel's control over the territory.",
    "keyEvents": [
      {
        "episodeNumber": 159,
        "eventId": "ep159-event-003",
        "title": "Journey Through Milky Road Begins",
        "description": "Luffy, Sanji, and Usopp begin their dangerous journey through the trapped Milky Road.",
        "timestamp": "08:20"
      },
      {
        "episodeNumber": 159,
        "eventId": "ep159-event-004",
        "title": "Blade Trap Encounter",
        "description": "The crew faces massive chain-attached blades capable of slicing ships in half.",
        "timestamp": "10:35"
      },
      {
        "episodeNumber": 159,
        "eventId": "ep159-event-007",
        "title": "Sky Lamprey Attack",
        "description": "A large Sky Lamprey emerges from the clouds to attack the crew's boat.",
        "timestamp": "16:40"
      }
    ],
    "inhabitants": ["Sky Lamprey"],
    "controlledBy": "Enel's forces",
    "statusHistory": [
      {
        "status": "ACTIVE",
        "episodeStart": 159,
        "episodeEnd": "present"
      }
    ]
  }
]
