[
  {
    "name": {
      "english": "Op-Op Fruit",
      "japanese": "オペオペの実",
      "romanized": "Ope Ope no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 398,
    "debutChapter": 504,
    "episodeAppearances": [585],
    "currentUser": {
      "characterId": "law",
      "episodeGained": null,
      "status": "ACTIVE"
    },
    "previousUsers": [],
    "abilities": [
      {
        "abilityName": "Room",
        "description": "Creates a spherical territory of light blue aura where the user can manipulate the fabric of space and modify people's bodies at will.",
        "episodeFirstSeen": 398,
        "limitations": "The user cannot move the sphere once conjured and must dismiss it to create a new one elsewhere. Creating large Rooms drains stamina."
      },
      {
        "abilityName": "Tact",
        "description": "Allows the user to telekinetically control and lift objects within their Room, including massive structures like warships and surrounding water.",
        "episodeFirstSeen": 585,
        "limitations": "Objects must be within the active Room to be manipulated."
      },
      {
        "abilityName": "Shambles",
        "description": "Allows the user to swap the positions of objects and people within the Room.",
        "episodeFirstSeen": 398,
        "limitations": "Requires active Room to function."
      }
    ],
    "awakening": {
      "isAwakened": false,
      "awakeningEpisode": null,
      "awakeningAbilities": []
    },
    "keyMoments": [
      {
        "episodeNumber": 585,
        "eventId": "ep585-event-009",
        "momentType": "POWER_REVEAL",
        "title": "Enhanced Tact Ability",
        "description": "Law demonstrates the significantly increased scale of his Room and Tact abilities by lifting an entire Marine warship along with the surrounding water.",
        "significance": "Shows Law's tremendous power growth during the two-year timeskip and establishes the combat applications of his enhanced abilities.",
        "timestamp": "19:20"
      }
    ],
    "weaknesses": [
      "Standard Devil Fruit weaknesses (sea water, Sea Prestone)",
      "Creating and maintaining large Rooms requires significant stamina",
      "Cannot move Room once created"
    ],
    "specialProperties": [
      "Known as the 'Ultimate Devil Fruit' due to its versatility",
      "Can perform miraculous surgeries including the 'Perennial Youth Operation' which grants immortality at the cost of the user's life",
      "Worth 5 billion berries on the black market"
    ],
    "trivia": [
      "The name 'Ope' comes from the Japanese word for 'operation' (オペ)",
      "Doflamingo once sought this fruit for its immortality surgery capability"
    ]
  }
]
