[
  {
    "id": "theory-ep585-001",
    "title": "Law's True Motive for Becoming Shichibukai",
    "summary": "Law became a Shichibukai not for protection or privilege, but specifically to get closer to Donquixote Doflamingo for revenge after Doflamingo murdered his brother Corazon.",
    "fullText": "Fans theorized from Law's first appearance as a Shichibukai that his new status was strategic rather than opportunistic. The theory suggests that Law's delivery of 100 pirate hearts was a calculated move to gain the government protection and access needed to pursue his true goal: revenge against Doflamingo. His presence on Punk Hazard and alliance with Caesar - who supplies Doflamingo with SAD for SMILE production - supports this theory. Law's Shichibukai position would allow him to operate in proximity to Doflamingo's operations without immediate Marine interference.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://lawshun.com/article/why-did-trafalgar-law-become-shichibukai",
      "title": "The Complex Deal: Law's Shichibukai Title Explored",
      "platform": "LawShun",
      "accessedAt": "2026-01-03"
    },
    "postedDate": "2013-02-17",
    "episodeRange": [585, 700],
    "minEpisode": 585,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 700
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["law", "doflamingo", "corazon"],
    "relatedLocations": ["punk-hazard"],
    "relatedEvents": ["ep585-event-005", "ep585-event-004"],
    "tags": ["law", "shichibukai", "doflamingo", "revenge", "corazon"]
  },
  {
    "id": "theory-ep585-002",
    "title": "Law and Caesar's Alliance is Temporary",
    "summary": "Law's alliance with Caesar Clown is purely strategic and temporary, serving only as a means to disrupt Doflamingo's SMILE operation and further Law's revenge plan.",
    "fullText": "When Law is revealed working with Caesar in episode 585, fans immediately theorized that this alliance couldn't be genuine given Law's character. The theory proposes that Law is using Caesar as a pawn in his larger scheme against Doflamingo. Since Caesar produces SAD for Doflamingo's artificial Devil Fruit operation, controlling or removing Caesar would strike a major blow to Doflamingo's underground business empire. Law's willingness to confront the Marines and prevent their escape suggests he has significant investment in maintaining his position on Punk Hazard, but only as long as it serves his ultimate goal of taking down Doflamingo.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://neverwatchedonepiece.tumblr.com/post/180999465619/583-585-save-the-children-the-straw-hats-start",
      "title": "Never Watched One Piece - Episodes 583-585 Recap",
      "platform": "Tumblr",
      "accessedAt": "2026-01-03"
    },
    "postedDate": "2019-01-15",
    "episodeRange": [585, 625],
    "minEpisode": 585,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 625
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["law", "caesar-clown", "doflamingo"],
    "relatedLocations": ["punk-hazard"],
    "relatedEvents": ["ep585-event-004", "ep585-event-006"],
    "tags": ["law", "caesar-clown", "alliance", "doflamingo"]
  },
  {
    "id": "theory-ep585-003",
    "title": "Law Planned to Form Alliance with Luffy",
    "summary": "Law's presence on Punk Hazard wasn't coincidental - he knew the Straw Hats would arrive and planned to propose an alliance to take down a Yonko.",
    "fullText": "Some fans theorized that Law orchestrated events to bring Luffy to Punk Hazard, possibly even being involved with the distress signal that drew both the Straw Hats and the Marines. Law's strategic thinking and his saving of Luffy at Marineford suggested he had long-term plans involving the Straw Hat captain. The theory proposes that Law knew targeting Doflamingo alone would be insufficient and that he needed Luffy's strength and tendency to disrupt the status quo. His confrontation with Smoker in episode 585 might have been partially to create the crisis situation that would force the Straw Hats and Law to work together.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://cienie-isengardu.tumblr.com/post/629317621644394496/the-development-of-laws-relationship-with-zoro",
      "title": "The development of Law's relationship with Zoro - Part 3: Punk Hazard",
      "platform": "Tumblr",
      "accessedAt": "2026-01-03"
    },
    "postedDate": "2020-08-15",
    "episodeRange": [585, 594],
    "minEpisode": 585,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 594
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["law", "luffy"],
    "relatedLocations": ["punk-hazard"],
    "relatedEvents": ["ep585-event-004"],
    "tags": ["law", "luffy", "alliance", "strategic-planning"]
  },
  {
    "id": "theory-ep585-004",
    "title": "Law Didn't Know About the Children's Experiments",
    "summary": "Despite working with Caesar, Law was unaware of or didn't approve of the cruel experiments on children, suggesting his alliance with Caesar had strict boundaries.",
    "fullText": "When the Straw Hats emerge with the children in episode 585, fans noted that Law's character - particularly his relationship with children shown in his backstory - would make him unlikely to tolerate Caesar's child experimentation. The theory suggests that Law's deal with Caesar was limited to allowing Law to use Punk Hazard as a base while staying uninformed about certain aspects of Caesar's research. This would explain why Law seems focused only on the strategic value of the alliance rather than Caesar's actual activities. Law's moral code, while flexible, has shown lines he won't cross, and harming children would likely be one of them.",
    "author": "Tumblr One Piece Analysts",
    "source": {
      "url": "https://www.tumblr.com/l-in-the-light/758747708848848896/law-didnt-know-about-the-kids-in-punk-hazard",
      "title": "Law didn't know about the kids in Punk Hazard",
      "platform": "Tumblr",
      "accessedAt": "2026-01-03"
    },
    "postedDate": "2023-06-20",
    "episodeRange": [585, 625],
    "minEpisode": 585,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 625
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["law", "caesar-clown"],
    "relatedLocations": ["punk-hazard"],
    "relatedEvents": ["ep585-event-008", "ep585-event-001"],
    "tags": ["law", "caesar-clown", "children", "morality"]
  },
  {
    "id": "theory-ep585-005",
    "title": "The 100 Hearts Belonged to Specific Pirates",
    "summary": "Law's selection of 100 pirate hearts wasn't random - he specifically targeted pirates connected to Doflamingo's operations or those who had wronged him.",
    "fullText": "When it's revealed that Law sent 100 pirate hearts to become a Shichibukai, fans theorized about whose hearts these were. Rather than random pirates, the theory suggests Law methodically selected targets who were either allied with Doflamingo, involved in activities Law opposed, or had crossed him personally. This would fit Law's calculated, strategic nature and his tendency to plan multiple steps ahead. The precision required to extract exactly 100 hearts also suggests careful selection rather than indiscriminate hunting. Some fans even theorize this could tie into the 'Rocky Port Incident' mentioned in the series.",
    "author": "One Piece Theory Forums",
    "source": {
      "url": "https://reallycoolblog.com/rocky-port-incident/",
      "title": "Rocky Port Incident - What Happened During This Incident In One Piece?",
      "platform": "Really Cool Blog",
      "accessedAt": "2026-01-03"
    },
    "postedDate": "2021-05-10",
    "episodeRange": [585, 1000],
    "minEpisode": 585,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1000
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["law", "doflamingo"],
    "relatedLocations": [],
    "relatedEvents": ["ep585-event-005"],
    "tags": ["law", "100-hearts", "rocky-port", "shichibukai"]
  }
]
