[
  {
    "id": "theory-ep562-001",
    "title": "Joy Boy's Alliance with Fish-Men Caused Their Persecution",
    "summary": "Theory that Joy Boy formed an alliance with fish-men and other races to fight against the twenty kingdoms that became the World Government, and this alliance is why fish-men have faced brutal slavery and persecution throughout history.",
    "fullText": "The theory posits that during the Void Century war, Joy Boy formed an alliance with different races including Fish-Men, Buccaneers, Giants, and others to fight against the twenty nations that would become the World Government. When Joy Boy's side lost the war, all the races that allied with him became targets for persecution. This explains why fish-men in particular have faced such brutal slavery whenever they come to the surface world - their connection with Joy Boy made them enemies of the World Government. Joy Boy's apology on the Poneglyph in the Sea Forest isn't just for failing to keep his promise about Noah, but also for the suffering his alliance brought upon the fish-men. This gives new meaning to Noah's purpose - it was meant to transport fish-men to safety or to a new homeland, but Joy Boy's defeat prevented this from happening.",
    "author": "Multiple theorists on Reddit and FandomWire",
    "source": {
      "url": "https://fandomwire.com/one-piece-joy-boy-apologizing-to-fish-men-in-the-poneglyph-might-have-hinted-he-was-the-reason-behind-their-brutal-slavery/",
      "title": "One Piece: Joy Boy Apologizing to Fish-Men Might Have Hinted He Was the Reason Behind Their Brutal Slavery",
      "platform": "FandomWire",
      "accessedAt": "2025-12-25"
    },
    "postedDate": "2024",
    "episodeRange": [548, 562, 1000],
    "minEpisode": 548,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["joy-boy", "neptune", "hody-jones", "luffy"],
    "relatedLocations": ["fish-man-island", "noah", "sea-forest"],
    "relatedEvents": ["ep562-event-013", "ep562-event-014"],
    "tags": ["joy-boy", "void-century", "fish-men", "slavery", "ancient-history"]
  },
  {
    "id": "theory-ep562-002",
    "title": "Luffy Will Fulfill Joy Boy's Promise by Transporting Fish-Men to the Surface",
    "summary": "Theory that Luffy, as the inheritor of Joy Boy's will, will eventually use Shirahoshi's power as Poseidon to raise Noah and transport all fish-men and merfolk to the surface, fulfilling the centuries-old promise.",
    "fullText": "This theory suggests that the ultimate conclusion of the Fish-Man Island storyline will involve Luffy fulfilling Joy Boy's broken promise. When the final war breaks out, Luffy will guide Shirahoshi (the current Poseidon) to use her power to lift Noah from the ocean floor. The ship will transport all the fish-men and merfolk to the surface world, where they can finally live freely without fear of persecution. This ties into Queen Otohime's dream of fish-men and humans living together peacefully on the surface. The theory also suggests this is why Neptune guards Noah so carefully - they're literally waiting for the promised day when someone (Luffy) will come to complete what Joy Boy started. Episode 562's revelation about Noah's true purpose directly sets up this eventual payoff.",
    "author": "Multiple One Piece theory communities",
    "source": {
      "url": "https://gamerant.com/one-piece-why-fishman-island-is-far-more-important-than-you-think/",
      "title": "One Piece: Why Fish-Man Island Is Far More Important Than You Think",
      "platform": "Game Rant",
      "accessedAt": "2025-12-25"
    },
    "postedDate": "2024",
    "episodeRange": [548, 562, 1000],
    "minEpisode": 548,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["luffy", "joy-boy", "shirahoshi", "neptune", "otohime"],
    "relatedLocations": ["noah", "fish-man-island"],
    "relatedEvents": ["ep562-event-013", "ep562-event-014"],
    "tags": ["joy-boy", "luffy", "poseidon", "shirahoshi", "noah", "prophecy"]
  },
  {
    "id": "theory-ep562-003",
    "title": "Energy Steroids Are Failed Sulong Pills",
    "summary": "Theory that Energy Steroids might be connected to the Mink tribe's Sulong transformation, possibly failed attempts to artificially replicate the power of the full moon transformation.",
    "fullText": "This theory proposes that Energy Steroids could be failed experiments attempting to replicate the Mink tribe's Sulong transformation power. The similarities include: rapid power increase, physical transformation, white hair (similar to Sulong form), and severe side effects. The theory suggests that someone in the past tried to create a drug that would give fish-men similar power-ups to what Minks get from the full moon, but the experiment failed, resulting in the dangerous Energy Steroids. This would explain why the steroids cause such dramatic transformations and why they have such severe aging effects - they're forcing a transformation the body isn't meant to handle. While this theory isn't directly related to Episode 562's events, Hody's transformation in this episode shows the stark white appearance that's reminiscent of Sulong forms.",
    "author": "Reddit theorist samearl13",
    "source": {
      "url": "https://samearl13.wordpress.com/2018/03/17/one-piece-theoryare-energy-steroids-failed-sulong-pills/",
      "title": "One Piece Theory: Are Energy Steroids Failed Sulong Pills?",
      "platform": "WordPress Blog",
      "accessedAt": "2025-12-25"
    },
    "postedDate": "2018-03-17",
    "episodeRange": [562, 750],
    "minEpisode": 562,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 800
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["hody-jones"],
    "relatedLocations": ["fish-man-island"],
    "relatedEvents": ["ep562-event-011"],
    "tags": ["energy-steroids", "sulong", "minks", "transformation", "hody-jones"]
  },
  {
    "id": "theory-ep562-004",
    "title": "Hody Jones Represents Inherited Hatred Without Personal Experience",
    "summary": "Theory and confirmed theme that Hody Jones was intentionally created by Oda to represent how hatred can be passed down through generations without any personal experience or justification, making him fundamentally different from other One Piece villains.",
    "fullText": "According to Eiichiro Oda's own commentary, Hody Jones was specifically designed to be a villain whose hatred of humans isn't based on any personal tragedy or experience. Unlike Arlong who had genuine grievances (Fisher Tiger's death, his own enslavement), Hody simply grew up in an environment that hated humans and absorbed that hatred without question. This makes him a representation of cyclical prejudice and inherited hatred - the most dangerous kind because it has no rational basis and therefore can't be reasoned with. Episode 562's moment where Fukaboshi demands to know what humans did to Hody sets up the shocking revelation (in episode 563) that the answer is 'nothing' - Hody just hates because he was taught to hate. This makes the Fish-Man Island arc a commentary on how racism and prejudice perpetuate themselves across generations, even without direct cause.",
    "author": "Eiichiro Oda (confirmed by creator) and fan analysts",
    "source": {
      "url": "https://gamerant.com/one-piece-author-reveals-why-he-created-hody-jones/",
      "title": "One Piece Author Reveals Why He Created Hody Jones",
      "platform": "Game Rant",
      "accessedAt": "2025-12-25"
    },
    "postedDate": "2024",
    "episodeRange": [548, 562, 563],
    "minEpisode": 548,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 563
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["hody-jones", "fukaboshi", "arlong"],
    "relatedLocations": ["fish-man-island"],
    "relatedEvents": ["ep562-event-009"],
    "tags": ["hody-jones", "theme", "inherited-hatred", "prejudice", "creator-commentary"]
  }
]
