[
  {
    "theoryTitle": "Chopper's Low Bounty: Secret Marine Admirer",
    "theoryText": "Some fans theorize that Chopper has a secret admirer within the Marines, possibly Captain Jiriroto as suggested in One Piece: Fan Letter, who intentionally keeps his bounty low to protect him. This would explain why despite his significant contributions and powerful Monster Point form, he's still treated as a pet.",
    "originPlatform": "Reddit/Online Forums",
    "author": "Various One Piece fans",
    "dateProposed": "2022-2024",
    "episodeScope": [320],
    "containsSpoilers": false,
    "popularity": "MODERATE",
    "evidencePoints": [
      "Chopper's bounty remains absurdly low despite major battles",
      "The Marines never seem to witness him in combat",
      "Similar pattern with Bepo who also has a very low bounty"
    ],
    "counterArguments": [
      "Could simply be a running gag by Oda",
      "Marines genuinely mistake him for a pet based on appearance",
      "No concrete evidence of a Marine admirer exists in the main story"
    ],
    "tags": ["bounty", "Chopper", "Marines", "comedy"]
  },
  {
    "theoryTitle": "Chopper's Bounty: Mink Race Propaganda",
    "theoryText": "A theory suggests that the World Government purposely keeps bounties low for certain mink-like characters (Chopper, Bepo) to hide information about the Mink race and their connection to Zunesha and potentially Joy Boy. This would be propaganda to prevent attention on this important race.",
    "originPlatform": "Reddit/YouTube",
    "author": "Various theorists",
    "dateProposed": "2020-2024",
    "episodeScope": [320],
    "containsSpoilers": true,
    "popularity": "LOW",
    "evidencePoints": [
      "Bepo, a powerful mink and second-in-command, also has an absurdly low bounty of 1,500 berries",
      "The Minks have important connections to the Void Century",
      "World Government has history of hiding information"
    ],
    "counterArguments": [
      "Chopper is a reindeer, not a mink",
      "The theory requires a massive conspiracy for what appears to be a gag",
      "Other minks like Pedro and the Musketeers have normal bounties"
    ],
    "tags": ["bounty", "Chopper", "Minks", "World Government", "conspiracy"]
  },
  {
    "theoryTitle": "Florian Triangle Entities: Umibōzu (Sea Monsters)",
    "theoryText": "The mysterious giant shadows in the Florian Triangle are theorized to be umibōzu, enormous traditional Japanese sea monsters said to drown sailors. The creatures greatly resemble traditional depictions of these yokai, being enormous with red eyes and able to blend into fog. They would explain the hundreds of ships that go missing in the Florian Triangle every year.",
    "originPlatform": "Reddit/Online Forums",
    "author": "Various One Piece theorists",
    "dateProposed": "2007-present",
    "episodeScope": [320, 381],
    "containsSpoilers": true,
    "popularity": "HIGH",
    "evidencePoints": [
      "The creatures' appearance matches traditional umibōzu descriptions",
      "Ships disappear in the Florian Triangle even before Moria arrived",
      "Over 100 ships disappear yearly, more than Moria could account for",
      "Oda frequently incorporates Japanese folklore into One Piece"
    ],
    "counterArguments": [
      "Oda hasn't confirmed this theory",
      "Could be connected to other mysteries in the series",
      "The true nature remains unexplained"
    ],
    "tags": ["Florian Triangle", "mystery", "creatures", "folklore", "Thriller Bark"]
  },
  {
    "theoryTitle": "Florian Triangle Entities: Imu's Remote Ability",
    "theoryText": "A theory proposes that Imu, the secret ruler of the World Government, created or controls the mysterious entities in the Florian Triangle using some remote ability. Since Imu is unhappy about pirates exploring the sea in search of Poneglyphs, attacking pirate ships in dangerous areas like the Florian Triangle would serve their interests in maintaining control and preventing discovery of the Void Century's secrets.",
    "originPlatform": "YouTube/Reddit",
    "author": "Various theorists",
    "dateProposed": "2018-present",
    "episodeScope": [320, 381],
    "containsSpoilers": true,
    "popularity": "MODERATE",
    "evidencePoints": [
      "Imu has demonstrated mysterious powers",
      "The World Government benefits from pirates disappearing",
      "The entities target ships heading to important locations",
      "Would explain why the phenomenon predates Moria"
    ],
    "counterArguments": [
      "No direct evidence connecting Imu to the Florian Triangle",
      "Imu's powers haven't been fully revealed",
      "Simpler explanations may exist (natural sea monsters)",
      "The theory relies on unconfirmed assumptions about Imu's abilities"
    ],
    "tags": ["Florian Triangle", "Imu", "World Government", "mystery", "speculation"]
  },
  {
    "theoryTitle": "Sanji's Drawing Poster: Duval Connection Setup",
    "theoryText": "Fans theorized after Episode 320 that Sanji's poorly drawn wanted poster would lead to future complications. This theory was proven correct when Duval appeared, a man whose face exactly matched Sanji's drawn poster, leading him to be hunted in Sanji's place and creating his grudge against Sanji.",
    "originPlatform": "Forums/Discussions",
    "author": "One Piece fans (2007-2008)",
    "dateProposed": "2007-2008",
    "episodeScope": [320, 321, 386, 387],
    "containsSpoilers": true,
    "popularity": "HIGH",
    "evidencePoints": [
      "The unusual nature of the drawn poster seemed intentionally setup for future plot",
      "Oda typically doesn't include random details without payoff",
      "Was confirmed when Duval appeared in the Sabaody Archipelago arc"
    ],
    "counterArguments": [
      "This theory was proven correct, no longer speculation"
    ],
    "tags": ["Sanji", "bounty", "foreshadowing", "Duval", "confirmed theory"]
  }
]
