[
  {
    "name": {
      "english": "Door-Door Fruit",
      "japanese": "ドアドアの実",
      "romanized": "Doa Doa no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 264,
    "debutChapter": 343,
    "description": "A Paramecia-type Devil Fruit that allows the user to create doors through anything they touch, including walls, the ground, and even the air itself. The user becomes a Door Human capable of accessing pocket dimensions.",
    "episodeAppearances": [271],
    "users": [
      {
        "characterId": "blueno",
        "episodeStart": 264,
        "episodeEnd": "present",
        "circumstances": "Blueno consumed this fruit at some point before becoming a CP9 agent"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Kaiten Door",
        "episodeRevealed": 271,
        "description": "The user turns their opponent's face into a revolving door, spinning it rapidly to disorient and confuse them.",
        "severity": "MAJOR",
        "firstUseContext": "Blueno uses this technique against Luffy during their battle on the courthouse rooftop, demonstrating one of the most creative offensive applications of his Devil Fruit."
      },
      {
        "abilityName": "Air Door",
        "episodeRevealed": 271,
        "description": "The user creates a door in the air itself, accessing a separate pocket dimension where they can hide, rest, or strategize during battle.",
        "severity": "MAJOR",
        "firstUseContext": "Blueno demonstrates this ability during his fight with Luffy, using it to temporarily retreat from combat and gain tactical advantages."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Doors automatically close after a set time period, as the user states 'if a door is opened, it must close'",
        "episodeRevealed": 271,
        "severity": "MINOR"
      },
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 264,
        "severity": "MAJOR"
      }
    ],
    "strengths": [
      {
        "strength": "Can create doors through any surface, including air, providing extreme mobility",
        "episodeRevealed": 271,
        "description": "The fruit allows the user to bypass physical barriers and access pocket dimensions for tactical advantages.",
        "severity": "MAJOR"
      },
      {
        "strength": "Can turn opponents' body parts into doors for offensive purposes",
        "episodeRevealed": 271,
        "description": "The Kaiten Door technique shows the fruit can be used to directly attack opponents by transforming their bodies.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "UNCOMMON",
    "powerTier": "MEDIUM"
  },
  {
    "name": {
      "english": "Ox-Ox Fruit, Model: Giraffe",
      "japanese": "ウシウシの実 モデル:麒麟",
      "romanized": "Ushi Ushi no Mi, Moderu: Kirin"
    },
    "type": "ZOAN",
    "debutEpisode": 271,
    "debutChapter": 385,
    "description": "A Zoan-type Devil Fruit that allows the user to transform into a giraffe or a giraffe-human hybrid, gaining the physical attributes of the world's tallest land animal. Despite being categorized as an Ox-Ox Fruit, it grants giraffe transformation abilities.",
    "episodeAppearances": [271],
    "users": [
      {
        "characterId": "kaku",
        "episodeStart": 271,
        "episodeEnd": "present",
        "circumstances": "Kaku consumed this Devil Fruit when Spandam offered it to him as a reward for completing the Water 7 infiltration mission, despite not knowing what powers it would grant."
      }
    ],
    "abilityReveals": [],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 271,
        "severity": "MAJOR"
      },
      {
        "weakness": "Fruit has a disgusting taste that Kaku comments on while consuming it",
        "episodeRevealed": 271,
        "severity": "MINOR"
      }
    ],
    "strengths": [],
    "awakening": null,
    "rarity": "UNCOMMON",
    "powerTier": "MEDIUM"
  },
  {
    "name": {
      "english": "Bubble-Bubble Fruit",
      "japanese": "アワアワの実",
      "romanized": "Awa Awa no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 271,
    "debutChapter": 385,
    "description": "A Paramecia-type Devil Fruit that allows the user to create and manipulate soap bubbles that can clean objects and people, both literally and figuratively. The user becomes a Soap Human with the ability to generate cleansing bubbles.",
    "episodeAppearances": [271],
    "users": [
      {
        "characterId": "kalifa",
        "episodeStart": 271,
        "episodeEnd": "present",
        "circumstances": "Kalifa consumed this Devil Fruit when Spandam presented it to her as a reward for the successful Water 7 mission, eating it despite not knowing what powers it would provide."
      }
    ],
    "abilityReveals": [],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 271,
        "severity": "MAJOR"
      },
      {
        "weakness": "Fruit tastes disgusting, as Kalifa notes while eating it",
        "episodeRevealed": 271,
        "severity": "MINOR"
      }
    ],
    "strengths": [],
    "awakening": null,
    "rarity": "UNCOMMON",
    "powerTier": "MEDIUM"
  }
]
