[
  {
    "id": "theory-ep076-001",
    "title": "Sanji's Mr. Prince Alias Foreshadowing",
    "summary": "The fact that Sanji successfully deceives Crocodile in Episode 76 foreshadows his later use of the 'Mr. Prince' alias and his role as the crew's infiltration specialist.",
    "fullText": "When Sanji impersonates Mr. 3 to Crocodile in Episode 76, it demonstrates his natural talent for deception and quick thinking under pressure. Fans have theorized that this moment was intentional foreshadowing by Oda for Sanji's later 'Mr. Prince' gambit during the Arabasta arc, where he would once again use deception to save his crew. This episode establishes Sanji's pattern of being the crew member who operates independently and uses cunning rather than direct combat to achieve crucial victories.",
    "author": "One Piece Community Analysis",
    "source": {
      "url": "https://tvtropes.org/pmwiki/pmwiki.php/Recap/OnePieceLittleGardenArc",
      "title": "Little Garden Arc Analysis",
      "platform": "TV Tropes",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2015-03-01",
    "episodeRange": [76, 110],
    "minEpisode": 76,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 110
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["sanji", "crocodile"],
    "relatedLocations": ["candle-house", "little-garden"],
    "relatedEvents": ["ep076-event-011"],
    "tags": ["sanji", "foreshadowing", "mr-prince", "character-development"]
  },
  {
    "id": "theory-ep076-002",
    "title": "Usopp's Fire Star Evolution Theory",
    "summary": "Usopp's debut of Kaenboshi (Fire Star) in Episode 76 is theorized to be the foundation for his later fire-based ammunition development, leading to his explosive arsenal.",
    "fullText": "The introduction of Usopp's Fire Star technique in Episode 76 is significant because it shows Usopp beginning to develop specialized ammunition types beyond basic projectiles. Fans theorize that this moment represents Usopp's evolution from a simple slingshot user to a true sniper with diverse tactical options. The fact that he uses fire specifically to counter Miss Goldenweek's paint-based hypnosis demonstrates his ability to analyze opponents and develop appropriate countermeasures - a skill that becomes increasingly important as he faces stronger enemies. Some fans believe this episode marks the beginning of Usopp's journey toward becoming a 'brave warrior of the sea' by showing courage despite being severely outmatched.",
    "author": "Reddit User Analysis",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_76",
      "title": "Episode 76 Discussion",
      "platform": "Fandom Wiki",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2018-06-15",
    "episodeRange": [76, 200],
    "minEpisode": 76,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 200
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["usopp"],
    "relatedLocations": ["little-garden"],
    "relatedEvents": ["ep076-event-001"],
    "tags": ["usopp", "technique-evolution", "character-development", "fire-star"]
  },
  {
    "id": "theory-ep076-003",
    "title": "Crocodile's Voice-Only Introduction Intentional Mystery",
    "summary": "Crocodile being introduced only through voice in Episode 76 was a deliberate choice to build mystery and anticipation for the Arabasta Saga's main antagonist.",
    "fullText": "The fact that Crocodile is introduced in Episode 76 only through voice and shadow, without showing his full appearance, is theorized to be an intentional storytelling technique to build suspense. By having Sanji be the first Straw Hat to interact with him (without even realizing who he truly is), the anime creates dramatic irony - the audience knows this is the big villain, but the heroes don't yet understand the threat they face. Some fans theorize that this 'voice-only' introduction also emphasizes Crocodile's role as a puppet master who operates from the shadows, controlling Baroque Works without showing himself - a theme that continues throughout the Arabasta Saga until his eventual full reveal.",
    "author": "Anime Analysis Community",
    "source": {
      "url": "https://poggers.com/blogs/anime/one-piece-little-garden-arc-summary-recap-review",
      "title": "Little Garden Arc Review",
      "platform": "Poggers",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2024-01-15",
    "episodeRange": [76, 110],
    "minEpisode": 76,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 110
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "ANALYSIS",
    "relatedCharacters": ["crocodile", "sanji"],
    "relatedLocations": ["candle-house"],
    "relatedEvents": ["ep076-event-010"],
    "tags": ["crocodile", "storytelling", "mystery", "arabasta-saga"]
  }
]
