[
  {
    "name": {
      "english": "Human-Human Fruit",
      "japanese": "ヒトヒトの実",
      "romanized": "Hito Hito no Mi"
    },
    "type": "ZOAN",
    "debutEpisode": 81,
    "debutChapter": 134,
    "description": "A Zoan-type Devil Fruit that allows the user to transform into a human hybrid and a full human. When eaten by a reindeer like Chopper, it grants human intelligence and the ability to speak, as well as various hybrid forms.",
    "episodeAppearances": [83],
    "users": [
      {
        "characterId": "chopper",
        "episodeStart": 81,
        "episodeEnd": "present",
        "circumstances": "Chopper ate the fruit as a young reindeer, gaining human intelligence and speech but being rejected by both reindeer and humans."
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Brain Point",
        "episodeRevealed": 83,
        "description": "Chopper's human hybrid form, which gives him enhanced intelligence and his iconic cute appearance. This is his default form after eating the Hito Hito no Mi.",
        "severity": "MAJOR",
        "firstUseContext": "First appearance in the anime when Chopper is helping treat the Straw Hats at Drum Castle."
      },
      {
        "abilityName": "Monster Point",
        "episodeRevealed": 83,
        "description": "A glimpse of Chopper's strongest and most dangerous transformation. This form is massive and powerful but not fully explained in this episode.",
        "severity": "MAJOR",
        "firstUseContext": "First appearance in the anime, though it's not fully used or explained at this point."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 81,
        "severity": "MAJOR"
      }
    ],
    "strengths": [
      {
        "strength": "Multiple transformation forms",
        "episodeRevealed": 83,
        "description": "Allows Chopper to transform between reindeer, human hybrid (Brain Point), and other forms, each with unique capabilities.",
        "severity": "MAJOR"
      },
      {
        "strength": "Enhanced intelligence",
        "episodeRevealed": 81,
        "description": "Grants the animal user human-level intelligence and the ability to speak.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "COMMON",
    "powerTier": "MEDIUM"
  }
]
