[
  {
    "id": "theory-ep284-001",
    "title": "Franky Memorized the Pluton Blueprints",
    "theoryText": "Before burning the Pluton blueprints in episode 284, Franky had carried them for years and studied them extensively. Many fans theorize that Franky memorized the entire design and could potentially recreate the ancient weapon from memory if necessary. Given his genius as a shipwright and his intimate knowledge of the blueprints, it's plausible he retained the knowledge even after destroying the physical plans.",
    "author": "One Piece Fan Community",
    "sourceUrl": "https://gamerant.com/one-piece-pluton-franky-theory/",
    "platform": "GameRant/Reddit",
    "publishDate": "2024",
    "episodesReferenced": [284, 322, 323],
    "minEpisode": 284,
    "spoilerStatus": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 1000,
      "spoilerDescription": "References future events and potential endgame scenarios"
    },
    "popularity": {
      "source": "Community Discussion",
      "metric": "Widely discussed theory"
    },
    "status": "UNCONFIRMED",
    "evidence": [
      "Franky studied the blueprints for years before burning them",
      "He is a genius shipwright who apprenticed under Tom",
      "He built the Thousand Sunny with advanced features",
      "The blueprints were meant to counter Pluton if it was ever revived"
    ],
    "counterEvidence": [
      "Franky's act of burning the blueprints was meant to be symbolic and final",
      "Creating Pluton would go against the themes of trust and moving forward",
      "No evidence in the story that Franky retained the knowledge"
    ]
  },
  {
    "id": "theory-ep284-002",
    "title": "Franky Will Build Pluton in the Final War",
    "theoryText": "This theory expands on the memorization theory, suggesting that in the final war against the World Government, Franky will use his retained knowledge of the Pluton blueprints to either build a new Pluton or upgrade the Thousand Sunny with Pluton-level capabilities. This would provide the Straw Hats with the firepower needed to stand against the World Government's forces and potentially the original Pluton if it's ever recovered.",
    "author": "One Piece Theory Community",
    "sourceUrl": "https://fandomwire.com/let-eiichiro-oda-cook-ancient-weapon-pluton-will-be-constructed-by-a-straw-hat-according-to-one-piece-theory/",
    "platform": "FandomWire",
    "publishDate": "2024",
    "episodesReferenced": [284, 322, 323],
    "minEpisode": 284,
    "spoilerStatus": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 1100,
      "spoilerDescription": "Speculates about final war and endgame scenarios"
    },
    "popularity": {
      "source": "Fan Theory Articles",
      "metric": "Popular endgame theory"
    },
    "status": "UNCONFIRMED",
    "evidence": [
      "The Thousand Sunny already has advanced features suggesting Franky incorporated some knowledge",
      "Franky's decision to burn the blueprints was based on betting on the Straw Hats",
      "The final war will likely require powerful weapons",
      "Thematic parallel: Tom worked on Roger's ship, Franky could build Luffy's ultimate vessel"
    ],
    "counterEvidence": [
      "Would undermine the significance of burning the blueprints in episode 284",
      "Contradicts the theme of trust over power",
      "No canonical hints that Franky retained the knowledge"
    ]
  },
  {
    "id": "theory-ep284-003",
    "title": "Thousand Sunny Contains Pluton Design Elements",
    "theoryText": "Some fans theorize that Franky incorporated elements of the Pluton design into the Thousand Sunny when he built it. This would explain some of the ship's advanced features and weapons systems. The theory suggests that while Franky didn't build a full ancient weapon, he may have used some of the innovative design principles he learned from studying the blueprints.",
    "author": "One Piece Fan Community",
    "sourceUrl": "https://www.epicdope.com/will-franky-build-pluton-in-one-piece-is-the-sunny-pluton/",
    "platform": "Epic Dope",
    "publishDate": "2024",
    "episodesReferenced": [284, 322, 323, 400],
    "minEpisode": 284,
    "spoilerStatus": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 400,
      "spoilerDescription": "References the Thousand Sunny's construction and capabilities"
    },
    "popularity": {
      "source": "Community Forums",
      "metric": "Very popular theory with mixed reception"
    },
    "status": "DEBUNKED",
    "evidence": [
      "The Thousand Sunny has advanced weapon systems like the Gaon Cannon",
      "Franky studied the blueprints extensively before building the Sunny",
      "Some design elements seem unusually advanced for a regular pirate ship"
    ],
    "counterEvidence": [
      "Franky stated the Sunny was built with Adam Wood and his own designs",
      "No canonical evidence supports Pluton elements in the Sunny",
      "Most sources consider this theory to have 'no merit'",
      "The Sunny's features can be explained by Franky's genius alone"
    ]
  },
  {
    "id": "theory-ep284-004",
    "title": "Blackbeard Will Obtain the Original Pluton",
    "theoryText": "With the blueprints destroyed in episode 284, attention turns to the original Pluton ancient weapon. This theory suggests that Blackbeard will obtain the original Pluton, creating a scenario where the Straw Hats must face the ancient weapon without the counter-weapon that the blueprints could have provided. This raises the stakes of Franky's decision in episode 284.",
    "author": "One Piece Theory Community",
    "sourceUrl": "https://worstgen.alwaysdata.net/forum/threads/dueling-plutons-blackbeard-steals-pluton-and-franky-makes-a-new-one.49690/",
    "platform": "Worstgen Forums",
    "publishDate": "2024",
    "episodesReferenced": [284],
    "minEpisode": 284,
    "spoilerStatus": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 1100,
      "spoilerDescription": "Speculates about Blackbeard's endgame and ancient weapon locations"
    },
    "popularity": {
      "source": "Forum Discussion",
      "metric": "Active theory discussion"
    },
    "status": "UNCONFIRMED",
    "evidence": [
      "Blackbeard is collecting powerful abilities and weapons",
      "He needs something to stand against the World Government",
      "The original Pluton still exists somewhere in the world",
      "Would create dramatic stakes for Franky's decision"
    ],
    "counterEvidence": [
      "Location of original Pluton is still unknown in the story",
      "Blackbeard's strategy focuses more on Devil Fruits than ancient weapons",
      "Pure speculation with no canonical support yet"
    ]
  },
  {
    "id": "theory-ep284-005",
    "title": "Franky's Decision Proves Robin's Trustworthiness",
    "theoryText": "Episode 284 represents a crucial character moment where Franky's decision to burn the blueprints serves as the ultimate validation of Robin's character. The theory emphasizes that Franky, who initially mistrusted Robin based on her reputation, came to understand her true nature. By destroying the only safeguard against Pluton, he demonstrates complete faith that Robin would never abuse ancient weapon knowledge, even under World Government torture.",
    "author": "One Piece Analysis Community",
    "sourceUrl": "https://onepiece.fandom.com/wiki/Episode_284",
    "platform": "Character Analysis Discussions",
    "publishDate": "2006-2024",
    "episodesReferenced": [278, 284],
    "minEpisode": 278,
    "spoilerStatus": {
      "containsSpoilers": false,
      "maxEpisodeSpoiler": 284,
      "spoilerDescription": "Focuses only on character development through episode 284"
    },
    "popularity": {
      "source": "Character Analysis Essays",
      "metric": "Widely accepted character interpretation"
    },
    "status": "SUPPORTED",
    "evidence": [
      "Franky explicitly tells Robin he misjudged her",
      "His decision is based on understanding her character",
      "Parallels Robin's own declaration to live in episode 278",
      "Thematically supports the arc's message about trust and friendship"
    ],
    "counterEvidence": []
  }
]
