[
  {
    "theoryTitle": "Dragon Race Revenge Theory",
    "theoryText": "The dragon race lived in isolation for hundreds of years until humans (mostly samurai from Wano Country and Marines) sought to eliminate them because of the threat they posed. The dragon in Punk Hazard is one of the few surviving dragons that decided to take revenge for its fallen comrades and started attacking humans, particularly World Government bases and Wano Country villages and towns.",
    "author": "One Piece Wiki Blog Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Blog:Recent_Blogs",
      "platform": "Fandom Wiki",
      "publishDate": "Unknown"
    },
    "episodesDiscussed": [579, 580],
    "spoilerStatus": "SPECULATION",
    "containsSpoilers": false,
    "popularity": {
      "upvotes": null,
      "comments": null,
      "views": null
    },
    "status": "DISPROVEN",
    "resolution": "The dragon was revealed to be an artificial creation by Dr. Vegapunk, not a natural dragon seeking revenge."
  },
  {
    "theoryTitle": "Zoro's Punk Hazard Cut Foreshadows Kaido Clash",
    "theoryText": "Some fans view Zoro's powerful cut against the dragon in Punk Hazard as foreshadowing for his eventual clash with Kaido. The dragon-slaying moment is seen as a narrative prediction of future events where Zoro would face an actual dragon-form user.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Punk_Hazard_Arc",
      "platform": "Fandom Wiki",
      "publishDate": "Unknown"
    },
    "episodesDiscussed": [579, 580],
    "spoilerStatus": "FORESHADOWING",
    "containsSpoilers": true,
    "popularity": {
      "upvotes": null,
      "comments": null,
      "views": null
    },
    "status": "CONFIRMED",
    "resolution": "Zoro later fought against Kaido, who has a dragon Devil Fruit form, confirming this foreshadowing."
  },
  {
    "theoryTitle": "Punk Hazard as Introduction to Vegapunk's Capabilities",
    "theoryText": "Early viewers theorized that the dragon and the island's unusual characteristics were intentionally placed by Oda to introduce Dr. Vegapunk's scientific capabilities before his formal introduction. The artificial dragon, the island's extreme climate split, and the abandoned facility all hint at scientific achievements far beyond normal One Piece technology.",
    "author": "One Piece Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Punk_Hazard",
      "platform": "Fandom Wiki",
      "publishDate": "2013"
    },
    "episodesDiscussed": [579],
    "spoilerStatus": "SPECULATION",
    "containsSpoilers": false,
    "popularity": {
      "upvotes": null,
      "comments": null,
      "views": null
    },
    "status": "CONFIRMED",
    "resolution": "This proved accurate as Punk Hazard served as the first major showcase of Vegapunk's scientific work, building anticipation for his eventual appearance."
  }
]
