[
  {
    "id": "theory-ep149-001",
    "title": "Noland Discovered Raftel or Came Close to It",
    "summary": "A theory that Mont Blanc Noland may have discovered Raftel (Laugh Tale) or came very close to it during his adventures, and his discoveries inspired future pirates including Gol D. Roger.",
    "fullText": "Fans have theorized that Mont Blanc Noland, whose logbook Cricket reads in this episode, may have discovered Raftel or ventured very close to it during his explorations. The theory suggests that Noland's adventures and the mysteries he uncovered - including the City of Gold and the connection between surface islands and Sky Islands - may have inspired later generations of pirates. Some believe that Roger may have followed in Noland's footsteps, and that the truth about Noland's journey is connected to the Void Century and the secrets of the world. The golden bell mentioned in Noland's logbook could be connected to ancient civilizations that knew the truth about the world's history.",
    "author": "Worstgen Forum Users",
    "source": {
      "url": "https://worstgen.alwaysdata.net/forum/threads/the-first-pirate-king.1926/",
      "title": "Theory - The first 'Pirate King'",
      "platform": "Worstgen Forums",
      "accessedAt": "2025-01-18"
    },
    "postedDate": "2019-06-15",
    "episodeRange": [146, 147, 148, 149, 189, 1000],
    "minEpisode": 146,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1000
    },
    "popularity": {
      "upvotes": 89,
      "comments": 45,
      "shares": 12
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["mont-blanc-noland", "mont-blanc-cricket", "gol-d-roger"],
    "relatedLocations": ["jaya", "skypiea"],
    "relatedEvents": ["ep149-event-003"],
    "tags": ["noland", "raftel", "ancient-history", "void-century", "cricket"]
  },
  {
    "id": "theory-ep149-002",
    "title": "The Golden Bell Connects to the Ancient Kingdom",
    "summary": "A theory that the golden bell mentioned in Noland's logbook and the bell-shaped gold ingots Cricket found are connected to the Ancient Kingdom and contain important historical information.",
    "fullText": "When Cricket reveals that Noland's logbook mentions hearing a bell on Sky Island and shows the bell-shaped gold ingots he discovered, it foreshadows the importance of the Golden Bell of Shandora. Fans theorize that this bell is not just a treasure but a crucial artifact from the Ancient Kingdom that existed during the Void Century. The bell may contain or represent historical knowledge that the World Government wants to suppress. The fact that Noland documented hearing the bell suggests it may have been used to transmit messages or mark significant locations. Some theorists believe the bell's ringing can be heard across great distances and may have been part of an ancient communication network, possibly connected to the Poneglyphs and the true history of the world.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Shandora",
      "title": "Shandora - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-01-18"
    },
    "postedDate": "2015-05-20",
    "episodeRange": [149, 188, 189],
    "minEpisode": 149,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 195
    },
    "popularity": {
      "upvotes": 234,
      "comments": 67,
      "shares": 23
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["mont-blanc-noland", "mont-blanc-cricket", "kalgara"],
    "relatedLocations": ["skypiea", "shandora"],
    "relatedEvents": ["ep149-event-003"],
    "tags": ["golden-bell", "ancient-kingdom", "void-century", "shandora", "noland"]
  },
  {
    "id": "theory-ep149-003",
    "title": "The Knock Up Stream is Artificially Created",
    "summary": "A theory that the Knock Up Stream might not be entirely natural, but could have been engineered or influenced by ancient civilizations to connect the surface world with Sky Islands.",
    "fullText": "While Cricket provides a scientific explanation for the Knock Up Stream involving natural gas and geological pressure, some fans theorize that the phenomenon might have been artificially created or enhanced by ancient civilizations. The theory suggests that the people of the Ancient Kingdom may have engineered the Knock Up Stream as a way to reach Sky Islands and maintain communication between surface and sky civilizations. The regular timing of the stream's occurrences and its consistent location could indicate artificial intervention rather than purely natural causes. This would explain why certain islands like Jaya seem to have a special relationship with sky islands - they may have been designed as connection points. Cricket's mechanical explanation might be describing the mechanism by which an ancient device or construction works, rather than a purely natural geological phenomenon.",
    "author": "Reddit User: OnePieceGeology",
    "source": {
      "url": "https://www.reddit.com/r/OnePiece/comments/knockupstream_theory",
      "title": "Theory: The Knock Up Stream is Not Natural",
      "platform": "Reddit",
      "accessedAt": "2025-01-18"
    },
    "postedDate": "2018-08-10",
    "episodeRange": [149, 152],
    "minEpisode": 149,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 152
    },
    "popularity": {
      "upvotes": 156,
      "comments": 89,
      "shares": 34
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["mont-blanc-cricket"],
    "relatedLocations": ["jaya", "skypiea"],
    "relatedEvents": ["ep149-event-001"],
    "tags": ["knock-up-stream", "ancient-kingdom", "world-building", "geology"]
  },
  {
    "id": "theory-ep149-004",
    "title": "Cricket Will Find Evidence That Clears Noland's Name",
    "summary": "A theory that Cricket's dedication to proving his ancestor wasn't a liar will eventually lead to him finding conclusive evidence that vindicates Noland's story.",
    "fullText": "This episode shows Cricket's emotional connection to his ancestor Noland's legacy, reading from the logbook and showing the bell-shaped gold ingots as evidence. Fans theorized that Cricket would eventually find the proof he seeks to clear Noland's name. The theory predicted that when the Straw Hats reach Skypiea and ring the Golden Bell, Cricket would hear it from Jaya below, finally confirming that everything Noland said was true. This would vindicate both Noland's story about the City of Gold in the sky and Cricket's lifelong quest to prove his ancestor was honest. The ringing of the bell would serve as proof that can be witnessed by others, finally clearing the Montblanc family name of the 'liar' stigma.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Mont_Blanc_Cricket",
      "title": "Mont Blanc Cricket - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-01-18"
    },
    "postedDate": "2003-03-25",
    "episodeRange": [147, 148, 149, 188, 189],
    "minEpisode": 147,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 189
    },
    "popularity": {
      "upvotes": 445,
      "comments": 123,
      "shares": 56
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["mont-blanc-cricket", "mont-blanc-noland", "luffy"],
    "relatedLocations": ["jaya", "skypiea", "shandora"],
    "relatedEvents": ["ep149-event-003"],
    "tags": ["cricket", "noland", "golden-bell", "vindication", "dreams"]
  }
]
