[
  {
    "id": "goro-goro-no-mi",
    "name": {
      "english": "Rumble-Rumble Fruit",
      "japanese": "ゴロゴロの実",
      "romanized": "Goro Goro no Mi"
    },
    "debutEpisode": 167,
    "debutChapter": 254,
    "episodeAppearances": [179],
    "type": "LOGIA",
    "currentUser": "enel",
    "previousUsers": [],
    "consumedInEpisode": null,
    "abilities": [
      {
        "abilityName": "Sango",
        "abilityNameJapanese": "サンゴ",
        "abilityNameEnglish": "Lightning",
        "episodeFirstUsed": 179,
        "description": "A wide-area lightning technique where Enel unleashes a massive charge of electricity from his hand that forms a wide blast. Unlike El Thor's precise strikes, Sango devastates large areas indiscriminately with no specific target. The technique's name means 'coral' in Japanese, possibly referencing the branching pattern of lightning.",
        "category": "OFFENSIVE",
        "powerLevel": "HIGH"
      },
      {
        "abilityName": "El Thor",
        "abilityNameJapanese": "エル・トール",
        "abilityNameEnglish": "Thunder God",
        "episodeFirstUsed": 179,
        "description": "Enel's signature attack where he summons a massive lightning bolt from the sky that strikes the target with devastating force. Known as 'Heaven's Judgment' to Skypieans, this technique can be spawned from above or horizontally to attack enemies. Powerful enough to knock out giant creatures like Nola.",
        "category": "OFFENSIVE",
        "powerLevel": "HIGH"
      }
    ],
    "awakening": {
      "isAwakened": false,
      "awakeningEpisode": null,
      "awakeningAbilities": []
    },
    "strengths": [
      "Grants the user the ability to create, control, and transform into lightning",
      "Considered one of the most powerful Logia-type Devil Fruits",
      "Allows for devastating wide-area attacks like Sango",
      "Enables precise strikes like El Thor",
      "Provides immunity to physical attacks through intangibility",
      "Lightning travels at incredible speeds",
      "Can be combined with Mantra (Observation Haki) for godlike perception"
    ],
    "weaknesses": [
      "Standard Devil Fruit weakness to seawater and Seastone",
      "Rubber is a natural insulator against electricity",
      "User can be surprised by opponents who don't conduct electricity"
    ],
    "historicalSignificance": "The Goro Goro no Mi is considered one of the most fearsome Logia-type fruits, granting Enel the power to claim godhood over Skypiea. Nico Robin noted it as one of the few abilities touted as 'invincible.' Enel's mastery of the fruit combined with his Mantra makes him nearly unstoppable in combat.",
    "keyMoments": [
      {
        "episodeNumber": 179,
        "eventId": "ep179-event-006",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "Sango Destroys the Upper Ruins",
        "description": "Enel uses Sango for the first time, demonstrating the fruit's capacity for massive area-of-effect destruction.",
        "significance": "Showcases the terrifying scope of the Goro Goro no Mi's power when used for large-scale destruction.",
        "timestamp": "10:45"
      },
      {
        "episodeNumber": 179,
        "eventId": "ep179-event-013",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "El Thor Defeats Nola",
        "description": "Enel's El Thor technique proves powerful enough to knock out the ancient 400-year-old giant snake Nola.",
        "significance": "Demonstrates the fruit's ability to defeat even massive ancient creatures with a single strike.",
        "timestamp": "18:45"
      }
    ]
  }
]
