[
  {
    "theory": "Usopp vs. Perona parallels Luffy vs. Enel - Natural Counter Theory",
    "author": "Multiple One Piece fans",
    "source": "https://neverwatchedonepiece.tumblr.com/post/130494810619/361-362-perona-is-terrified-usopp-and",
    "platform": "Tumblr/Reddit discussions",
    "datePosted": null,
    "episodesReferenced": [361, 195, 196, 197],
    "characterIds": ["usopp", "perona", "monkey-d-luffy", "enel"],
    "isSpoiler": false,
    "spoilerSeverity": "MINOR",
    "popularity": "HIGH",
    "status": "CONFIRMED",
    "evidence": [
      "Usopp's naturally negative personality makes him immune to Perona's Negative Hollow attacks",
      "Similar to how Luffy's rubber body made him immune to Enel's lightning",
      "Both victories rely on an inherent character trait rather than training or power-ups",
      "Oda consistently creates matchups where specific character traits counter seemingly invincible opponents"
    ],
    "counterArguments": [],
    "communityReception": "Widely accepted by the fandom as intentional parallel storytelling by Oda. Praised as genius character matchmaking."
  },
  {
    "theory": "Perona's Negative Hollow Trauma Theory - Long-lasting Effects on Luffy",
    "author": "FandomWire contributor",
    "source": "https://fandomwire.com/one-piece-luffy-wouldve-been-dead-without-god-usopp-but-that-near-death-encounter-clearly-gave-joy-boy-a-long-lasting-trauma/",
    "platform": "FandomWire",
    "datePosted": null,
    "episodesReferenced": [356, 361],
    "characterIds": ["monkey-d-luffy", "perona", "usopp"],
    "isSpoiler": true,
    "spoilerSeverity": "MAJOR",
    "popularity": "MEDIUM",
    "status": "SPECULATION",
    "evidence": [
      "During the Egghead Island arc, Luffy encounters similar holograms and calls them 'Hollow-Hollow' (Perona's fruit name)",
      "Luffy's reaction suggests he remembers the traumatic experience with Perona's ghosts",
      "This demonstrates continuity in Luffy's character memories and experiences"
    ],
    "counterArguments": [
      "Could be coincidental terminology rather than trauma reference",
      "Luffy typically doesn't hold onto negative experiences for extended periods"
    ],
    "communityReception": "Mixed reception. Some fans find it compelling evidence of character continuity, others think it's reading too much into dialogue."
  },
  {
    "theory": "Usopp's Lies Becoming Reality - Fake Weapons Theory",
    "author": "One Piece community",
    "source": "Multiple Reddit and forum discussions",
    "platform": "Reddit/Forums",
    "datePosted": null,
    "episodesReferenced": [361],
    "characterIds": ["usopp", "perona"],
    "isSpoiler": false,
    "spoilerSeverity": "MINOR",
    "popularity": "HIGH",
    "status": "THEMATIC_ANALYSIS",
    "evidence": [
      "Usopp defeats Perona entirely with fake weapons - toy cockroaches and an inflatable hammer",
      "This continues the series theme that Usopp's lies and bluffs often become more powerful than reality",
      "The episode title emphasizes the 'U' in 'Uso' (lie) being the same as in 'Usopp'",
      "Demonstrates that in One Piece, belief and perception can be more powerful than physical reality"
    ],
    "counterArguments": [],
    "communityReception": "Widely accepted as thematic analysis. Fans appreciate how Oda uses Usopp's character to explore themes of truth, lies, and perception in battle."
  },
  {
    "theory": "Perona's Defeat Foreshadows Her Character Development",
    "author": "Thriller Bark analysis community",
    "source": "Various One Piece forums and wiki discussions",
    "platform": "Forums/Wiki discussions",
    "datePosted": null,
    "episodesReferenced": [361],
    "characterIds": ["perona", "usopp"],
    "isSpoiler": true,
    "spoilerSeverity": "MAJOR",
    "popularity": "MEDIUM",
    "status": "SPECULATION",
    "evidence": [
      "Perona's defeat through fear and vulnerability humanizes her character",
      "Her fear of cockroaches makes her relatable despite her ghost powers",
      "This defeat sets up her later character arc and eventual alliance with certain characters"
    ],
    "counterArguments": [
      "At the time of this episode, future character development wasn't yet written"
    ],
    "communityReception": "Retrospective appreciation. Fans looking back see this as the beginning of Perona becoming a more complex, sympathetic character rather than just a villain."
  }
]
