[
  {
    "name": {
      "english": "Gum-Gum Fruit",
      "japanese": "ゴムゴムの実",
      "romanized": "Gomu Gomu no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 1,
    "episodeAppearances": [192],
    "currentUser": "luffy",
    "abilities": [
      {
        "abilityName": "Gomu Gomu no Hanabi: Ougon Botan",
        "episodeRevealed": 192,
        "description": "A variation of Gomu Gomu no Hanabi where Luffy spins his body around while colliding a large golden ball attached to his arm with a thundercloud, using it as an electrical conductor to destroy the cloud.",
        "significance": "Used to destroy Enel's Raigo and save Skypiea from destruction."
      },
      {
        "abilityName": "Gomu Gomu no Ougon Rifle",
        "episodeRevealed": 192,
        "description": "Similar to Gomu Gomu no Rifle but with the golden ball attached to Luffy's arm, possessing much more speed and creating a massive sonic boom. The attack is so fast that even opponents who can move at lightning speed cannot dodge it.",
        "significance": "The finishing move that defeated Enel and rang the Golden Bell, ending the Skypiea conflict."
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 192,
        "eventId": "ep192-event-001",
        "description": "Luffy uses Gomu Gomu no Hanabi: Ougon Botan to destroy Enel's Raigo",
        "timestamp": "05:30"
      },
      {
        "episodeNumber": 192,
        "eventId": "ep192-event-005",
        "description": "Luffy defeats Enel with Gomu Gomu no Ougon Rifle, ringing the Golden Bell",
        "timestamp": "17:45"
      }
    ]
  },
  {
    "name": {
      "english": "Rumble-Rumble Fruit",
      "japanese": "ゴロゴロの実",
      "romanized": "Goro Goro no Mi"
    },
    "type": "LOGIA",
    "debutEpisode": 167,
    "episodeAppearances": [192],
    "currentUser": "enel",
    "abilities": [
      {
        "abilityName": "200,000,000 Volt Amaru",
        "episodeRevealed": 192,
        "description": "Enel's ultimate transformation where he morphs his entire body into a colossal lightning form at maximum voltage (200 million volts). He becomes a huge, potbellied, Raijin-like lightning figure capable of firing enormous electrical bolts from his hands and wielding his gold staff as burning tridents.",
        "significance": "Represents the full extent of the Goro Goro no Mi's power and Enel's desperation to defeat Luffy. Despite its overwhelming might, it proved ineffective against Luffy's rubber body."
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 192,
        "eventId": "ep192-event-003",
        "description": "Enel transforms into his ultimate 200,000,000 Volt Amaru form",
        "timestamp": "11:45"
      },
      {
        "episodeNumber": 192,
        "eventId": "ep192-event-008",
        "description": "Despite the Amaru transformation, Enel is defeated by Luffy",
        "timestamp": "21:30"
      }
    ],
    "weaknesses": [
      {
        "weakness": "Rubber (Gomu Gomu no Mi)",
        "description": "Lightning is completely ineffective against rubber, making Luffy a natural counter to Enel's powers.",
        "episodeRevealed": 182
      }
    ]
  }
]
