[
  {
    "abilityName": "Cool Charge",
    "abilityNameJapanese": "クール・チャージ",
    "abilityNameRomanized": "Kūru Chāji",
    "abilityType": "WEAPON",
    "debutEpisode": 295,
    "debutChapter": 411,
    "user": "nami",
    "description": "Nami creates a Cool Ball on the ball end of her Perfect Clima-Tact, which allows her to manipulate temperature and perform upgraded versions of her weather techniques. This is a preparatory move that sets up more advanced attacks.",
    "episodeAppearances": [295],
    "relatedAbilities": ["mirage-tempo", "mirage-tempo-fata-morgana"],
    "keyMoments": [
      {
        "episodeNumber": 295,
        "eventId": "ep295-event-005",
        "description": "Nami first uses Cool Charge against Kalifa, setting up her Mirage Tempo: Fata Morgana technique.",
        "significance": "First appearance of this preparatory technique that enhances Nami's meteorological abilities."
      }
    ]
  },
  {
    "abilityName": "Mirage Tempo: Fata Morgana",
    "abilityNameJapanese": "蜃気楼=ミラージュ・テンポ ファタ・モルガナ",
    "abilityNameRomanized": "Mirāju Tenpo: Fata Morugana",
    "abilityType": "WEAPON",
    "debutEpisode": 295,
    "debutChapter": 411,
    "user": "nami",
    "description": "An advanced version of Mirage Tempo that creates five visual illusions of Nami using reflections and refractions within the air. The images consist of a long and tall skinny version, a short kid version, a fat version, a big muscular version, and a normal version of Nami. All images move in perfect unison with the real Nami, and any attack she produces is replicated, creating a barrage of projectiles with only one-fifth being real. Named after the complex mirage phenomenon 'Fata Morgana', which is associated with Morgan le Fay from Arthurian legend.",
    "episodeAppearances": [295],
    "relatedAbilities": ["cool-charge", "mirage-tempo"],
    "keyMoments": [
      {
        "episodeNumber": 295,
        "eventId": "ep295-event-006",
        "description": "Nami debuts this spectacular technique against Kalifa, creating five mirage versions of herself that completely confuse her opponent.",
        "significance": "One of Nami's most iconic and visually impressive techniques, demonstrating her mastery of meteorological phenomena and creative combat application."
      }
    ]
  },
  {
    "abilityName": "Shinaru Shigan 'Whip'",
    "abilityNameJapanese": "しなる指銃「鞭」",
    "abilityNameRomanized": "Shinaru Shigan 'Muchi'",
    "abilityType": "MARTIAL_ART",
    "debutEpisode": 295,
    "debutChapter": 411,
    "user": "kalifa",
    "description": "A variation of the Rokushiki technique Shigan (Finger Gun) that Kalifa developed. Instead of a straight finger thrust, she uses a flexible, whip-like motion to extend her finger strike's range and make it curve, allowing her to attack from unexpected angles.",
    "episodeAppearances": [295],
    "relatedAbilities": ["shigan", "rokushiki"],
    "keyMoments": [
      {
        "episodeNumber": 295,
        "eventId": "ep295-event-007",
        "description": "Kalifa demonstrates this Shigan variation during her battle with Nami, showcasing her adaptation of the standard Rokushiki technique.",
        "significance": "Shows Kalifa's mastery and personalization of CP9's martial arts techniques."
      }
    ]
  },
  {
    "abilityName": "Makie",
    "abilityNameJapanese": "巻絵",
    "abilityNameRomanized": "Makie",
    "abilityType": "MARTIAL_ART",
    "debutEpisode": 295,
    "debutChapter": 410,
    "user": "zoro",
    "description": "A defensive technique used by Zoro and Sogeking together to deflect simultaneous attacks from Kaku and Jabra. The technique demonstrates their improvised teamwork despite their contrasting fighting styles.",
    "episodeAppearances": [295],
    "relatedAbilities": [],
    "keyMoments": [
      {
        "episodeNumber": 295,
        "eventId": "ep295-event-009",
        "description": "Zoro and Sogeking use Makie to defend against coordinated attacks from two CP9 agents.",
        "significance": "Shows the Straw Hats' ability to coordinate and adapt to team-based combat situations."
      }
    ]
  }
]
