[
  {
    "id": "syrup-village",
    "name": "Syrup Village",
    "nameJapanese": "シロップ村",
    "nameRomanized": "Shiroppu Mura",
    "debut": {
      "episode": 9,
      "chapter": 23
    },
    "episodeAppearances": [17],
    "locationType": "Village",
    "region": "East Blue",
    "keyEvents": [
      {
        "episodeNumber": 17,
        "event": "Black Cat Pirates Defeated",
        "description": "The final battle against Captain Kuro and the Black Cat Pirates concludes with Luffy defeating Kuro and Usopp defeating Jango.",
        "significance": "Saves the village from Kuro's scheme and protects Kaya's life and fortune.",
        "timestamp": "12:30"
      },
      {
        "episodeNumber": 17,
        "event": "Black Cat Pirates Flee",
        "description": "The remaining Black Cat Pirates take their defeated captain and flee the island, ending their threat to Syrup Village.",
        "significance": "Returns peace to the village after the pirate attack.",
        "timestamp": "14:30"
      },
      {
        "episodeNumber": 17,
        "event": "Villagers Keep Attack Secret",
        "description": "The villagers decide to keep the pirate attack secret to maintain their peace of mind, reasoning that pirates do not normally come to such an out-of-the-way village.",
        "significance": "Shows the village's desire to return to normalcy and forget the traumatic event.",
        "timestamp": "15:30"
      },
      {
        "episodeNumber": 17,
        "event": "Straw Hats Depart",
        "description": "The Straw Hat Pirates depart Syrup Village aboard the Going Merry with their new crewmate Usopp.",
        "significance": "Concludes the Syrup Village arc as the heroes move on to their next adventure.",
        "timestamp": "21:45"
      }
    ],
    "statusChanges": [
      {
        "episodeNumber": 17,
        "status": "Saved from Black Cat Pirates",
        "description": "Village is saved from Kuro's scheme and returns to peace."
      }
    ]
  },
  {
    "id": "going-merry",
    "name": "Going Merry",
    "nameJapanese": "ゴーイングメリー号",
    "nameRomanized": "Gōingu Merī-gō",
    "debut": {
      "episode": 17,
      "chapter": 41
    },
    "episodeAppearances": [17],
    "locationType": "Ship",
    "region": "East Blue",
    "description": "A caravel-class ship designed by Merry and gifted to the Straw Hat Pirates by Kaya. Features a sheep figurehead and becomes the crew's first proper vessel.",
    "keyEvents": [
      {
        "episodeNumber": 17,
        "event": "Ship Debut",
        "description": "The Going Merry is revealed for the first time, designed by Merry and owned by Kaya.",
        "significance": "Introduction of the ship that will become the Straw Hats' home for hundreds of episodes.",
        "timestamp": "16:45"
      },
      {
        "episodeNumber": 17,
        "event": "Gifted to Straw Hat Pirates",
        "description": "Kaya gifts the Going Merry to the Straw Hat Pirates as gratitude for saving her life and village. Merry personally stocks it and explains its workings to the crew.",
        "significance": "The crew acquires their first proper ship, enabling them to truly begin their journey. The Going Merry serves as their vessel until the end of the Enies Lobby arc.",
        "timestamp": "17:30"
      },
      {
        "episodeNumber": 17,
        "event": "Straw Hats Board and Depart",
        "description": "The Straw Hat Pirates board the Going Merry with their new member Usopp and depart Syrup Village to continue their journey.",
        "significance": "Marks the beginning of the Going Merry's journey with the Straw Hats.",
        "timestamp": "21:45"
      }
    ],
    "inhabitants": ["luffy", "zoro", "nami", "usopp"],
    "notableFeatures": [
      "Sheep figurehead",
      "Caravel-class design",
      "Designed by Merry"
    ]
  }
]
