[
  {
    "name": {
      "english": "Pet-Pet Fruit",
      "japanese": "ペトペトの実",
      "romanized": "Peto Peto no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 625,
    "debutChapter": null,
    "episodeAppearances": [628],
    "currentUser": {
      "characterId": "breed",
      "episodeConsumed": null,
      "episodeLost": null
    },
    "previousUsers": [],
    "abilities": [
      {
        "abilityName": "Pet Control",
        "description": "The user can produce green gel from their hands to create special collars. Once a collar is placed on a living being, they are forced to obey all of the user's voice commands without resistance.",
        "episodeFirstShown": 625,
        "limitations": [
          "Victims must be able to hear the user's voice commands to obey them",
          "Commands must be comprehensible to the victim",
          "If victims cannot hear (e.g., using earplugs), the control doesn't work",
          "Strong willpower can allow victims to resist commands",
          "Using the power on oneself causes loss of control over other enslaved beings"
        ]
      },
      {
        "abilityName": "Self-Enhancement",
        "description": "The user can apply the Devil Fruit's power to themselves to enhance their physical strength and muscle mass.",
        "episodeFirstShown": 628,
        "limitations": [
          "Using power on oneself causes loss of control over other collared victims"
        ]
      },
      {
        "abilityName": "Strength Enhancement",
        "description": "The user can command collared victims to exceed their normal physical potential and strength limits.",
        "episodeFirstShown": 626,
        "limitations": []
      }
    ],
    "awakening": null,
    "weaknesses": [
      {
        "weakness": "Voice-Based Control Requirement",
        "description": "The control mechanism requires victims to actually hear the user's voice commands. If they cannot hear (due to earplugs, being unconscious, or distance), they will not obey.",
        "episodeRevealed": 628,
        "exploitedBy": ["law", "luffy"]
      },
      {
        "weakness": "Willpower Resistance",
        "description": "If victims exert enough willpower together, they can resist the user's commands and break free from control.",
        "episodeRevealed": 628,
        "exploitedBy": ["kung-fu-dugong", "sea-animal-pirates"]
      },
      {
        "weakness": "Self-Use Trade-off",
        "description": "When the user applies the Devil Fruit power to themselves, they lose control over all other collared beings.",
        "episodeRevealed": 628,
        "exploitedBy": ["luffy", "kung-fu-dugong"]
      },
      {
        "weakness": "Standard Devil Fruit Weaknesses",
        "description": "The user cannot swim and is weakened by seastone and seawater.",
        "episodeRevealed": 625,
        "exploitedBy": []
      }
    ],
    "trivia": [
      "The Peto Peto no Mi is a non-canon Devil Fruit that only appears in the anime during the Caesar Retrieval Arc filler.",
      "The name 'Peto' likely comes from 'pet', referring to the user's ability to turn living beings into obedient pets.",
      "This Devil Fruit is one of the few anime-original fruits that works on both humans and animals equally.",
      "Breed's plan involved using SMILE fruits to turn humans into animals so he could control them with the Peto Peto no Mi."
    ],
    "images": []
  }
]
