[
  {
    "id": "drum-castle",
    "name": "Drum Castle",
    "nameJapanese": "ドラム城",
    "nameRomaji": "Doramu-jō",
    "type": "Castle",
    "debut": 83,
    "episodeAppearances": [89],
    "geography": {
      "region": "Grand Line",
      "island": "Drum Island",
      "description": "A large castle atop the highest peak of Drum Island, serving as the royal palace of the Drum Kingdom. Features a top dome and various interior chambers."
    },
    "keyEvents": [
      {
        "episodeNumber": 89,
        "timestamp": "03:15",
        "description": "Final battle between Luffy and Wapol takes place inside and atop the castle",
        "significance": "Location of the climactic confrontation that ends Wapol's tyrannical rule"
      },
      {
        "episodeNumber": 89,
        "timestamp": "16:45",
        "description": "Wapol unveils the Royal Drum Crown Seven-Shot Bliking Cannon at the top dome",
        "significance": "Shows the castle's defensive capabilities, though they prove ineffective"
      },
      {
        "episodeNumber": 89,
        "timestamp": "19:30",
        "description": "Dr. Hiriluk's flag is displayed on a spire and defended by Luffy",
        "significance": "The flag becomes a symbol of the kingdom's transformation from tyranny to hope"
      },
      {
        "episodeNumber": 89,
        "timestamp": "21:00",
        "description": "Wapol is defeated and sent flying from the castle, marking the end of the Drum Kingdom",
        "significance": "The castle transitions from a symbol of oppression to one of liberation"
      }
    ],
    "culturalSignificance": "The castle represents the seat of power for Drum Island. Under Wapol it was a symbol of tyranny, but after his defeat it becomes a symbol of the kingdom's rebirth as Sakura Kingdom.",
    "inhabitants": [
      {
        "characterId": "wapol",
        "role": "Former King",
        "status": "Departed",
        "episodes": [89]
      },
      {
        "characterId": "kureha",
        "role": "Doctor/Current Resident",
        "status": "Current",
        "episodes": [89]
      }
    ]
  },
  {
    "id": "drum-ropeway",
    "name": "Drum Ropeway",
    "nameJapanese": "ドラムロープウェイ",
    "nameRomaji": "Doramu Rōpuwei",
    "type": "Transportation System",
    "debut": 89,
    "episodeAppearances": [89],
    "geography": {
      "region": "Grand Line",
      "island": "Drum Island",
      "description": "A gondola cable car system that transports people from the base of the mountain to Drum Castle at the peak. Allows access to the castle for those unable to climb the mountain."
    },
    "keyEvents": [
      {
        "episodeNumber": 89,
        "timestamp": "13:00",
        "description": "Dalton, Zoro, Usopp, and Vivi arrive at Drum Castle via the ropeway gondola",
        "significance": "Provides transportation for witnesses to Wapol's defeat and the kingdom's liberation"
      },
      {
        "episodeNumber": 89,
        "timestamp": "14:30",
        "description": "During the ride, Dalton recalls Wapol's tyrannical history",
        "significance": "The journey becomes a moment of reflection on the kingdom's oppression"
      }
    ],
    "culturalSignificance": "The ropeway represents accessibility to power and government. It allows the common people and injured soldiers like Dalton to reach the castle and witness the change in leadership.",
    "inhabitants": []
  },
  {
    "id": "drum-island",
    "name": "Drum Island",
    "nameJapanese": "ドラム島",
    "nameRomaji": "Doramu-tō",
    "type": "Winter Island",
    "debut": 78,
    "episodeAppearances": [89],
    "geography": {
      "region": "Grand Line",
      "climate": "Permanent winter, snow year-round",
      "description": "A winter island characterized by tall, drum-shaped mountains and perpetual snowfall. Home to the Drum Kingdom, which becomes Sakura Kingdom after Wapol's defeat."
    },
    "keyEvents": [
      {
        "episodeNumber": 89,
        "timestamp": "21:00",
        "description": "Wapol is sent flying from Drum Island by Luffy's attack",
        "significance": "Physically removes the tyrant from the island, symbolizing complete liberation"
      },
      {
        "episodeNumber": 89,
        "timestamp": "22:30",
        "description": "The end of the Drum Kingdom is declared, setting the stage for the island's rebirth",
        "significance": "Marks a major historical transition for the island and its people"
      }
    ],
    "culturalSignificance": "Drum Island transforms from a kingdom ruled by a tyrant who hoarded doctors to a liberated land that will embrace Dr. Hiriluk's ideals of healing and hope.",
    "inhabitants": []
  }
]
