[
  {
    "id": "theory-587-001",
    "title": "Punk Hazard as Smoker's Wake-Up Call for Future Power-Up",
    "theoryText": "Smoker's defeat at the hands of Law during Punk Hazard was intentionally designed by Oda as a wake-up call moment for the character. This humbling experience will motivate Smoker to undergo intense training, likely under the guidance of his mentor Kuzan (former Admiral Aokiji), leading to a massive power-up. When Smoker returns to the story, he will possess awakened Devil Fruit abilities and advanced Armament Haki, placing him at high commander level. This mirrors the character development arc that Kuzan himself underwent under Garp's mentorship.",
    "author": "Various One Piece community members",
    "source": {
      "url": "https://www.onepiecegold.com/punk-hazard-and-its-importance-to-smokers-growth-theory/",
      "platform": "One Piece Gold",
      "publishDate": "2020-01-01"
    },
    "episodeSpan": [587, null],
    "spoilerStatus": "SPECULATIVE",
    "spoilsFutureEpisodes": false,
    "popularityMetrics": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "relatedCharacters": ["smoker", "kuzan"],
    "relatedEvents": ["ep587-event-009"],
    "credibility": "MEDIUM",
    "status": "UNRESOLVED"
  },
  {
    "id": "theory-587-002",
    "title": "Law's Heart Extraction Ability Foreshadows the Immortality Surgery",
    "theoryText": "Law's demonstration of his Mes technique to extract Smoker's heart in Episode 587 is significant foreshadowing for the Ope Ope no Mi's ultimate ability - the Immortality Surgery. The fact that Law can remove and manipulate hearts while keeping victims alive establishes the medical precision necessary for the legendary surgery that grants eternal youth at the cost of the user's life. This episode plants the seed for a major future plot point where Law may be forced to perform this surgery, possibly on a character like Imu who has allegedly lived since the Void Century, or as leverage by antagonists like Blackbeard who seek immortality.",
    "author": "One Piece theory community",
    "source": {
      "url": "https://gamerant.com/one-piece-ope-ope-no-mi-devil-fruit-explained/",
      "platform": "GameRant",
      "publishDate": "2023-01-01"
    },
    "episodeSpan": [587, null],
    "spoilerStatus": "MAJOR",
    "spoilsFutureEpisodes": true,
    "popularityMetrics": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "relatedCharacters": ["trafalgar-law"],
    "relatedEvents": ["ep587-event-008"],
    "credibility": "HIGH",
    "status": "PARTIALLY_CONFIRMED"
  },
  {
    "id": "theory-587-003",
    "title": "Smoker Will Become Luffy's Marine Rival Like Garp to Roger",
    "theoryText": "Despite his defeat by Law in Punk Hazard, Smoker is being positioned as Luffy's primary Marine rival, mirroring the relationship between Garp and Gol D. Roger. His defeat in Episode 587 is not the end of his relevance but rather a crucial character development moment. Just as Garp trained relentlessly to match Roger's strength, Smoker will undergo similar growth. The parallel is reinforced by Smoker's connection to Kuzan, who was Garp's protégé. Smoker's persistent pursuit of Luffy since Loguetown, his sense of justice, and his willingness to work with pirates when necessary all mirror Garp's character traits. Punk Hazard represents Smoker's low point before his eventual rise.",
    "author": "Worstgen forum community",
    "source": {
      "url": "https://worstgen.alwaysdata.net/forum/threads/smoker-making-of-the-strongest-marine.18270/",
      "platform": "Worstgen",
      "publishDate": "2021-01-01"
    },
    "episodeSpan": [48, null],
    "spoilerStatus": "SPECULATIVE",
    "spoilsFutureEpisodes": false,
    "popularityMetrics": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "relatedCharacters": ["smoker", "luffy", "kuzan"],
    "relatedEvents": ["ep587-event-001", "ep587-event-009"],
    "credibility": "MEDIUM",
    "status": "UNRESOLVED"
  },
  {
    "id": "theory-587-004",
    "title": "Law's Alliance Was Planned Since Sabaody",
    "theoryText": "Law's appearance at the end of Episode 587 and his subsequent alliance with Luffy was not a spontaneous decision but rather a carefully calculated plan that Law has been orchestrating since the Sabaody Archipelago incident two years prior. Law saved Luffy's life at Marineford and has been positioning himself strategically ever since. His presence on Punk Hazard, his manipulation of Caesar Clown, and his extraction of Smoker's heart all serve his larger plan to take down Doflamingo and eventually Kaido. The reunion with Luffy in this episode represents the culmination of two years of preparation, with Law having maneuvered himself into becoming a Shichibukai specifically to gain access to information and resources needed for his revenge plot.",
    "author": "One Piece community theorists",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_587",
      "platform": "One Piece Wiki",
      "publishDate": "2013-03-17"
    },
    "episodeSpan": [504, 668],
    "spoilerStatus": "MAJOR",
    "spoilsFutureEpisodes": true,
    "popularityMetrics": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "relatedCharacters": ["trafalgar-law", "luffy"],
    "relatedEvents": ["ep587-event-011"],
    "credibility": "HIGH",
    "status": "CONFIRMED"
  }
]
