[
  {
    "name": {
      "english": "Sand Sled",
      "japanese": "サンドスレッド",
      "romanized": "Sando Sureddo"
    },
    "locationType": "VEHICLE",
    "debutEpisode": 97,
    "debutChapter": null,
    "episodeAppearances": [98],
    "keyEvents": [
      {
        "episodeNumber": 98,
        "eventId": "ep098-event-006",
        "eventType": "LOCATION_ARRIVAL",
        "title": "Straw Hats Encounter the Sand Sled",
        "description": "The Straw Hat crew encounters the Barbar Pirates' Sand Sled traveling through the desert.",
        "significance": "Introduces the unique desert-sailing vessel as a central location for the episode's events.",
        "timestamp": "13:30"
      },
      {
        "episodeNumber": 98,
        "eventId": "ep098-event-007",
        "eventType": "BATTLE_START",
        "title": "Sand Sled Mast Damaged",
        "description": "Luffy accidentally crashes into the Sand Sled and breaks its mast, creating the need for repairs.",
        "significance": "The damage drives the plot forward and creates the obligation for cooperation.",
        "timestamp": "15:45"
      }
    ],
    "description": "The Sand Sled is an anime-exclusive ship designed to sail across desert sands. It features wheels adapted for sand travel and a distinctive umbrella figurehead that provides protection from the desert sun. The Barbar Pirates use this specialized vessel to navigate the Sandora Desert.",
    "region": "Arabasta Kingdom",
    "climate": "Desert (mobile)",
    "inhabitants": ["Barbar Pirates"],
    "politicalStatus": "Independent pirate vessel",
    "culturalSignificance": "Represents the adaptation of traditional pirate ships to the harsh desert environment of Arabasta. The umbrella figurehead is a practical and symbolic element showing how desert pirates protect themselves.",
    "reveals": [
      {
        "infoType": "DESIGN",
        "information": "Sand Sleds can run on sand using specialized wheels and feature umbrella figureheads for sun protection",
        "episodeRevealed": 98,
        "severity": "MINOR"
      },
      {
        "infoType": "FUNCTIONALITY",
        "information": "The ship has a mast that can be damaged and requires wood for repairs, similar to ocean-going vessels",
        "episodeRevealed": 98,
        "severity": "MINOR"
      }
    ],
    "images": [],
    "alternateNames": []
  },
  {
    "name": {
      "english": "Melias",
      "japanese": "メリアス",
      "romanized": "Meriasu"
    },
    "locationType": "VILLAGE",
    "debutEpisode": 98,
    "debutChapter": null,
    "episodeAppearances": [98],
    "keyEvents": [
      {
        "episodeNumber": 98,
        "eventId": "ep098-event-010",
        "eventType": "BACKSTORY_REVEAL",
        "title": "Flashback to Melias Village Visit",
        "description": "Young Vivi and King Cobra visit Melias during a royal tour. Rasa gives Vivi a wreath, and Cobra promises to help if the oasis is buried.",
        "significance": "Establishes the history of Melias and the broken promise that haunts Rasa.",
        "timestamp": "19:45"
      },
      {
        "episodeNumber": 98,
        "eventId": "ep098-event-011",
        "eventType": "BACKSTORY_REVEAL",
        "title": "Melias Oasis Buried and Village Abandoned",
        "description": "The oasis at Melias is buried under sand and King Cobra never returns as promised. The villagers abandon Melias, leaving only Rasa behind.",
        "significance": "Shows the tragic fate of Melias and the consequences of the drought affecting Arabasta.",
        "timestamp": "21:00"
      }
    ],
    "description": "Melias is an anime-exclusive village located in the Sandora Desert of Arabasta. It was once a thriving settlement with an oasis, but the oasis became buried under sand during the drought. After King Cobra's promised help never arrived, the villagers gradually abandoned the settlement, leaving only Rasa behind until Barbarossa found her. The village now stands in ruins.",
    "region": "Arabasta Kingdom, Sandora Desert",
    "climate": "Desert",
    "inhabitants": ["Formerly Rasa and other villagers"],
    "politicalStatus": "Abandoned",
    "culturalSignificance": "Melias represents the wider tragedy of Arabasta's drought and the broken promises between rulers and citizens. It symbolizes lost hope and the consequences of environmental disaster. The village's fate adds to the burden Vivi carries regarding her kingdom's suffering.",
    "reveals": [
      {
        "infoType": "HISTORY",
        "information": "Melias was visited by King Cobra and Princess Vivi during a royal tour when Vivi was a child",
        "episodeRevealed": 98,
        "severity": "MAJOR"
      },
      {
        "infoType": "TRAGEDY",
        "information": "The village's oasis was buried in sand and the king's promise to help was never fulfilled",
        "episodeRevealed": 98,
        "severity": "MAJOR"
      },
      {
        "infoType": "STATUS",
        "information": "The village is now abandoned after all residents except Rasa left",
        "episodeRevealed": 98,
        "severity": "MAJOR"
      },
      {
        "infoType": "LOCATION",
        "information": "Anime-exclusive location in the Sandora Desert",
        "episodeRevealed": 98,
        "severity": "MINOR"
      }
    ],
    "images": [],
    "alternateNames": ["Meriyasu Oasis"]
  },
  {
    "name": {
      "english": "Sandora Desert",
      "japanese": "サンドラ砂漠",
      "romanized": "Sandora Sabaku"
    },
    "locationType": "DESERT",
    "debutEpisode": 92,
    "debutChapter": 155,
    "episodeAppearances": [98],
    "keyEvents": [
      {
        "episodeNumber": 98,
        "eventId": "ep098-event-001",
        "eventType": "LOCATION_ARRIVAL",
        "title": "Continued Desert Crossing",
        "description": "The Straw Hats continue their arduous journey through the Sandora Desert, facing dehydration and the scorching heat.",
        "significance": "The desert's harsh conditions create challenges and drive several plot points in this episode.",
        "timestamp": "03:00"
      },
      {
        "episodeNumber": 98,
        "eventId": "ep098-event-003",
        "eventType": "FIRST_APPEARANCE",
        "title": "Sandora Lizard Attack on Matsuge",
        "description": "A giant Sandora Lizard attacks the camel that will become Matsuge, demonstrating the dangerous wildlife of the desert.",
        "significance": "Shows the desert's dangerous creatures and leads to Matsuge joining the crew as transportation.",
        "timestamp": "07:15"
      }
    ],
    "description": "The Sandora Desert is a vast, scorching desert that covers much of the Arabasta Kingdom. It is filled with dangerous creatures including giant Sandora Lizards, scorpions, and other threats. The extreme heat causes dehydration and hallucinations. Despite these dangers, desert pirates like the Barbar Pirates have adapted to sail across the sands on specialized ships.",
    "region": "Arabasta Kingdom",
    "climate": "Extreme desert heat",
    "inhabitants": ["Desert wildlife (Sandora Lizards, scorpions, etc.)", "Barbar Pirates (traveling)", "Scattered desert travelers"],
    "politicalStatus": "Part of Arabasta Kingdom",
    "culturalSignificance": "The Sandora Desert is a major geographical feature of Arabasta that the Straw Hats must cross to reach their destination. It represents the harsh, unforgiving environment that mirrors the kingdom's current struggles under drought and civil unrest.",
    "reveals": [
      {
        "infoType": "DANGER",
        "information": "Contains psychoactive cacti that cause hallucinations when consumed",
        "episodeRevealed": 98,
        "severity": "MINOR"
      },
      {
        "infoType": "WILDLIFE",
        "information": "Home to giant Sandora Lizards, enormous scorpions, and other dangerous desert creatures",
        "episodeRevealed": 98,
        "severity": "MINOR"
      }
    ],
    "images": [],
    "alternateNames": ["Sandora Great Desert"]
  }
]
