[
  {
    "id": "horo-horo-no-mi",
    "name": {
      "japanese": "ホロホロの実",
      "romanized": "Horo Horo no Mi",
      "english": "Hollow-Hollow Fruit"
    },
    "type": "Paramecia",
    "debutEpisode": 350,
    "debutChapter": 449,
    "episodeAppearances": [356],
    "currentUser": {
      "characterId": "perona",
      "episodeConsumed": null,
      "status": "ACTIVE"
    },
    "previousUsers": [],
    "abilities": [
      {
        "abilityName": "Negative Hollow",
        "episodeFirstUsed": 350,
        "episodeShowcased": 356,
        "description": "Creates ghost-like Hollows that pass through targets' bodies, filling them with overwhelming negative thoughts and depression. Victims typically fall to their knees and express extreme self-deprecation or suicidal thoughts.",
        "limitations": "Cannot affect people who are already extremely negative about themselves, as demonstrated by Usopp's natural immunity. The power attacks the mind/spirit rather than the body.",
        "strength": "Can instantly incapacitate even the strongest opponents regardless of their physical strength or combat abilities, as it's a purely mental/psychological attack."
      },
      {
        "abilityName": "Mini Hollow / Ghost Rap",
        "episodeFirstUsed": 351,
        "episodeShowcased": 356,
        "description": "Creates miniature ghosts the size of Perona's palm that can be detonated with a snap of her fingers. The explosions are powerful enough to create holes in stone walls.",
        "limitations": "Requires the user to manually detonate them, giving opponents a brief window to react.",
        "strength": "Provides offensive capability beyond just the psychological Negative Hollows."
      },
      {
        "abilityName": "Special Hollow / Kamikaze Rap",
        "episodeFirstUsed": 351,
        "episodeShowcased": null,
        "description": "A larger version of the Mini Hollow that can physically interact with targets (lifting them, etc.) and causes a massive explosion when detonated.",
        "limitations": "Larger size makes them easier to spot and potentially avoid.",
        "strength": "Combines physical manipulation with explosive power."
      },
      {
        "abilityName": "Ghost Network",
        "episodeFirstUsed": 351,
        "episodeShowcased": null,
        "description": "Perona connects her consciousness to numerous Negative Hollows throughout Thriller Bark to gather information and monitor what's happening across the entire island.",
        "limitations": "Unknown range limitations.",
        "strength": "Provides comprehensive surveillance and intelligence gathering capabilities."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Negative Personality Immunity",
        "description": "The Negative Hollow ability cannot affect individuals who are already extremely pessimistic and negative about themselves. When used on such a person (like Usopp), the ghosts themselves can become affected by the target's negativity instead.",
        "episodeRevealed": 356,
        "severity": "CRITICAL"
      },
      {
        "weakness": "Standard Devil Fruit Weaknesses",
        "description": "User cannot swim and is weakened by seawater and Seastone.",
        "episodeRevealed": null,
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "keyMoments": [
      {
        "episodeNumber": 356,
        "eventId": "ep356-event-005",
        "title": "Negative Hollows Defeat Three Straw Hats",
        "description": "Perona's Negative Hollows pass through Zoro, Sanji, and Franky, instantly incapacitating all three with crushing depression despite their strength and willpower.",
        "significance": "Demonstrates the overwhelming power of the Horo Horo no Mi against conventional fighters."
      },
      {
        "episodeNumber": 356,
        "eventId": "ep356-event-006",
        "title": "Discovery of Natural Counter",
        "description": "Usopp reveals himself to be completely immune to the Negative Hollows due to his naturally pessimistic personality, shocking Perona and establishing the fruit's fundamental weakness.",
        "significance": "First time the Horo Horo no Mi's weakness is revealed, showing that mental state can counter Devil Fruit powers."
      },
      {
        "episodeNumber": 356,
        "eventId": "ep356-event-007",
        "title": "Negative Hollows Backfire",
        "description": "When Perona sends four Negative Hollows through Usopp simultaneously, his extreme negativity causes the ghosts themselves to become depressed, with the effect even reaching Perona.",
        "significance": "Shows that the Horo Horo no Mi's weakness isn't just immunity, but can actually backfire on the user when faced with extreme negativity."
      }
    ],
    "culturalReferences": [
      {
        "reference": "The ghost design is influenced by traditional Japanese yurei (ghosts) and Western cartoon ghosts, creating a unique cute yet eerie aesthetic.",
        "episodeNumber": 350
      }
    ],
    "trivia": [
      "The Horo Horo no Mi is one of the few Devil Fruits whose power can be completely negated by a personality trait rather than another Devil Fruit or special ability.",
      "The fruit's weakness being natural pessimism creates a thematic parallel to Luffy's rubber body naturally countering Enel's lightning Devil Fruit."
    ]
  }
]
