[
  {
    "name": {
      "english": "Magnet-Magnet Fruit",
      "japanese": "ジキジキの実",
      "romanized": "Jiki Jiki no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 398,
    "debutChapter": 504,
    "description": "Grants the user the ability to create magnetic forces and manipulate metal objects. The user can attract or repel metallic objects to and from their body, gathering them into powerful constructs for offense or defense.",
    "episodeAppearances": [399],
    "users": [
      {
        "characterId": "eustass-kid",
        "episodeStart": 398,
        "episodeEnd": "present",
        "circumstances": "Eustass Kid ate this fruit at some point before becoming a pirate"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Punk Gibson",
        "episodeRevealed": 399,
        "description": "Kid uses his magnetic powers to attract all nearby metal weapons and objects, forming them into a massive metallic arm. He then uses this giant arm to crush enemies with devastating force.",
        "severity": "MAJOR",
        "firstUseContext": "Kid demonstrates this technique while fighting Marines outside the Human Auctioning House, gathering weapons from both outside and inside the building to create his giant arm."
      },
      {
        "abilityName": "Metal Attraction",
        "episodeRevealed": 399,
        "description": "Kid can attract metal objects from a wide area with such force that even weapons held by Marines or stored inside buildings fly toward him.",
        "severity": "MAJOR",
        "firstUseContext": "The extent of Kid's magnetic range is shown when weapons from inside the auction house fly out to him during the battle."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": null,
        "severity": "MAJOR"
      },
      {
        "weakness": "Requires metallic objects to be present for maximum effectiveness",
        "episodeRevealed": 399,
        "severity": "MINOR"
      }
    ],
    "strengths": [
      {
        "strength": "Can control large amounts of metal for devastating attacks",
        "episodeRevealed": 399,
        "description": "Kid can gather massive quantities of metal weapons and objects to create powerful constructs.",
        "severity": "MAJOR"
      },
      {
        "strength": "Wide-range magnetic attraction",
        "episodeRevealed": 399,
        "description": "Kid's magnetic pull can reach far enough to draw objects from inside buildings.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "HIGH"
  },
  {
    "name": {
      "english": "Op-Op Fruit",
      "japanese": "オペオペの実",
      "romanized": "Ope Ope no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 398,
    "debutChapter": 504,
    "description": "Grants the user the ability to create a spherical territory called 'Room' where they can manipulate the fabric of space and perform surgical operations on anything within it. The user can rearrange, remove, or swap body parts and objects without harming the targets.",
    "episodeAppearances": [399],
    "users": [
      {
        "characterId": "trafalgar-law",
        "episodeStart": 398,
        "episodeEnd": "present",
        "circumstances": "Trafalgar Law ate this fruit at some point in his past"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Room",
        "episodeRevealed": 399,
        "description": "Law creates a transparent spherical domain around his targets. Within this sphere, he can freely manipulate anything, including switching around people's body parts without causing pain or death.",
        "severity": "MAJOR",
        "firstUseContext": "Law uses Room to incapacitate Marines by rearranging their body parts, demonstrating the surgical precision and tactical versatility of his Devil Fruit."
      },
      {
        "abilityName": "Spatial Manipulation",
        "episodeRevealed": 399,
        "description": "Within his Room, Law can manipulate space to switch, rearrange, or remove objects and body parts as if performing surgery.",
        "severity": "MAJOR",
        "firstUseContext": "Law demonstrates this by switching Marines' body parts around, leaving them confused and incapacitated."
      },
      {
        "abilityName": "Collar Removal",
        "episodeRevealed": 399,
        "description": "Law uses his surgical abilities to safely remove Jean Bart's explosive slave collar without triggering it.",
        "severity": "MAJOR",
        "firstUseContext": "Law frees Jean Bart from his Celestial Dragon slave collar, showcasing the fruit's utility beyond combat."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": null,
        "severity": "MAJOR"
      },
      {
        "weakness": "Requires concentration to maintain Room",
        "episodeRevealed": 399,
        "severity": "MINOR"
      }
    ],
    "strengths": [
      {
        "strength": "Surgical precision allows for non-lethal incapacitation",
        "episodeRevealed": 399,
        "description": "Law can defeat enemies by rearranging their body parts without killing them.",
        "severity": "MAJOR"
      },
      {
        "strength": "Utility beyond combat - can perform medical procedures",
        "episodeRevealed": 399,
        "description": "The fruit's surgical abilities can be used for healing and helping others, like removing slave collars.",
        "severity": "MAJOR"
      },
      {
        "strength": "Called the 'Ultimate Devil Fruit' for its immortality surgery potential",
        "episodeRevealed": null,
        "description": "The Ope Ope no Mi can grant eternal youth at the cost of the user's life.",
        "severity": "CRITICAL"
      }
    ],
    "awakening": null,
    "rarity": "LEGENDARY",
    "powerTier": "VERY_HIGH"
  },
  {
    "name": {
      "english": "Flower-Flower Fruit",
      "japanese": "ハナハナの実",
      "romanized": "Hana Hana no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 67,
    "debutChapter": 114,
    "description": "Allows the user to sprout duplicates of their body parts on any surface, including living beings and objects. The user feels whatever the sprouted parts feel.",
    "episodeAppearances": [399],
    "users": [
      {
        "characterId": "nico-robin",
        "episodeStart": 67,
        "episodeEnd": "present",
        "circumstances": "Nico Robin ate this fruit as a child"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Nueve Fleur",
        "episodeRevealed": 399,
        "description": "Robin sprouts nine arms (nueve means nine in Spanish) to restrain and incapacitate multiple enemies simultaneously. This is part of her numbered 'Fleur' technique series.",
        "severity": "MINOR",
        "firstUseContext": "Robin uses Nueve Fleur to restrain Marines during the battle outside the Human Auctioning House, showing her continued development of numbered techniques."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": null,
        "severity": "MAJOR"
      },
      {
        "weakness": "User feels pain from sprouted body parts",
        "episodeRevealed": null,
        "severity": "MAJOR"
      }
    ],
    "strengths": [
      {
        "strength": "Can restrain multiple opponents simultaneously",
        "episodeRevealed": 399,
        "description": "Robin's numbered Fleur techniques allow her to incapacitate several enemies at once.",
        "severity": "MINOR"
      }
    ],
    "awakening": null,
    "rarity": "COMMON",
    "powerTier": "MEDIUM"
  }
]
