[
  {
    "abilityName": "Franky Destroyer Cannon",
    "abilityNameJapanese": "フランキー・デストロイ砲",
    "abilityNameRomanized": "Furankī Desutoroi Hō",
    "abilityType": "CYBORG_ENHANCEMENT",
    "debutEpisode": 289,
    "debutChapter": 406,
    "userCharacterId": "franky",
    "description": "Shoulder-mounted cannons that Franky can deploy by removing his shirt. He claims they fire 'pursuit cannonballs,' though the pursuit comes from Franky himself moving to track his target rather than the cannonballs having homing capabilities.",
    "firstUseContext": "Franky unveiled these cannons during his battle against CP9 agent Fukurou in the Tower of Justice, using them to pressure his opponent.",
    "relatedAbilities": ["strong-hammer", "coup-de-vent"],
    "episodeAppearances": [289]
  },
  {
    "abilityName": "Strong Hammer",
    "abilityNameJapanese": "ストロング・ハンマー",
    "abilityNameRomanized": "Sutorongu Hanmā",
    "abilityType": "CYBORG_ENHANCEMENT",
    "debutEpisode": 289,
    "debutChapter": 406,
    "userCharacterId": "franky",
    "description": "Franky removes the skin on his right hand like a glove, revealing a pure iron fist underneath. He then delivers a devastating punch with this iron fist, capable of launching opponents through walls.",
    "firstUseContext": "Used against Fukurou to send him crashing through a wall in the Tower of Justice, demonstrating Franky's raw physical power.",
    "relatedAbilities": ["franky-destroyer-cannon", "coup-de-vent"],
    "episodeAppearances": [289]
  },
  {
    "abilityName": "Franky Centaur",
    "abilityNameJapanese": "フランキー・ケンタウロス",
    "abilityNameRomanized": "Furankī Kentaurosu",
    "abilityType": "CYBORG_ENHANCEMENT",
    "debutEpisode": 289,
    "debutChapter": 406,
    "userCharacterId": "franky",
    "description": "Franky splits his legs and hips in half vertically, with the front set sliding forward to create a 'reverse centaur' formation. While not increasing his strength, this form provides four legs for enhanced stability and grappling capability, allowing him to restrain opponents.",
    "firstUseContext": "Used to stabilize himself while falling toward the waterfall with Fukurou, setting up his final Coup de Vent attack.",
    "relatedAbilities": ["coup-de-vent", "strong-hammer"],
    "episodeAppearances": [289]
  },
  {
    "abilityName": "Coup de Vent",
    "abilityNameJapanese": "風来砲",
    "abilityNameRomanized": "Kū do Van",
    "abilityType": "CYBORG_ENHANCEMENT",
    "debutEpisode": 289,
    "debutChapter": 406,
    "userCharacterId": "franky",
    "description": "Franky connects both his arms with a T-shaped pipe called the Connector and fires a massive cannonball of compressed air. This is one of Franky's most powerful attacks, capable of devastating impact at point-blank range.",
    "firstUseContext": "Used as the finishing blow against Fukurou, delivering the compressed air cannon at point-blank range to knock him unconscious and win the battle.",
    "relatedAbilities": ["franky-centaur", "strong-hammer"],
    "episodeAppearances": [289]
  },
  {
    "abilityName": "Seimei Kikan",
    "abilityNameJapanese": "生命帰還",
    "abilityNameRomanized": "Seimei Kikan",
    "abilityType": "MARTIAL_ARTS",
    "debutEpisode": 289,
    "debutChapter": 406,
    "userCharacterId": "kumadori",
    "description": "Life Return - An advanced technique achievable through hermit training that allows complete conscious control over every part of the body, including autonomic functions. Kumadori can manipulate his hair like tentacles, control his body weight, digest food instantly, and perform other feats of body control.",
    "firstUseContext": "Kumadori demonstrated this technique against Chopper, showcasing his ability to control his hair and body as a sennin (hermit) who has mastered his bodily functions.",
    "relatedAbilities": ["rokushiki", "tekkai"],
    "episodeAppearances": [289]
  }
]
