[
  {
    "id": "theory-ep567-001",
    "title": "Noah Will Be Repaired by an Ancient Shipwright",
    "summary": "A theory that Noah, damaged by Luffy's attacks but saved by the Sea Kings, will eventually be repaired by someone connected to the ancient shipwrights or possibly by modern shipwrights like Iceberg or Franky who have knowledge of ancient techniques.",
    "fullText": "After Episode 567, fans theorized about who would repair Noah as mentioned by the Sea Kings. The Sea Kings mentioned needing help to fix the ship from an unspecified source. Some fans speculate that Iceberg from Water 7 could be involved, noting that at the end of the Enies Lobby arc he was trying to make Water 7 float. Others suggest someone related to Tom, the legendary shipwright who built Gol D. Roger's ship. The connection to ancient shipbuilding techniques and the prophecy of the 'promised day' suggests that Noah's repair is tied to the fulfillment of Joy Boy's ancient promise. Some theorists believe Franky, with his knowledge of Pluton's blueprints and Vegapunk's technology, might play a role in restoring the Ship of Promise.",
    "author": "Various One Piece Fan Communities",
    "source": {
      "url": "https://worstgen.alwaysdata.net/forum/threads/who-will-fix-the-noah.9745/",
      "title": "Who will fix the noah - Worstgen Forum",
      "platform": "Forum",
      "accessedAt": "2025-12-26"
    },
    "postedDate": "2012-10-07",
    "episodeRange": [567, 1100],
    "minEpisode": 567,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": 50,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["iceberg", "franky", "tom"],
    "relatedLocations": ["noah", "water-7"],
    "relatedEvents": ["ep567-event-007"],
    "tags": ["noah", "shipwright", "ancient-promise", "joy-boy"]
  },
  {
    "id": "theory-ep567-002",
    "title": "Luffy Can Hear the Voice of All Things Like Roger",
    "summary": "Based on the Sea Kings' comments in Episode 568 (which directly follows 567), fans theorize that Luffy may possess the ability to hear the Voice of All Things, the same ability possessed by Gol D. Roger, which would explain his connection to the ancient prophecies.",
    "fullText": "In the episodes immediately following 567, the Sea Kings note that 'it seemed as if Luffy had heard their voices,' drawing a parallel to Gol D. Roger who also possessed this ability. This theory suggests that Luffy's ability to understand what needs to be done, his natural connection to Shirahoshi (Poseidon), and his role in potentially fulfilling Joy Boy's promise are all tied to him possessing the Voice of All Things. This ability would connect him to the Ancient Weapons, the Poneglyphs, and the ancient history of the world. Some theorists link this to Luffy's Devil Fruit and his destiny as Joy Boy's successor, while others believe it's an innate ability separate from his powers.",
    "author": "Reddit r/OnePiece Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_568",
      "title": "Episode 568 - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-26"
    },
    "postedDate": "2012-10-14",
    "episodeRange": [567, 1000],
    "minEpisode": 567,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1000
    },
    "popularity": {
      "upvotes": 2500,
      "comments": 450,
      "shares": 100
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["luffy", "gol-d-roger", "shirahoshi"],
    "relatedLocations": [],
    "relatedEvents": ["ep567-event-007", "ep567-event-008"],
    "tags": ["voice-of-all-things", "luffy", "roger", "ancient-power"]
  },
  {
    "id": "theory-ep567-003",
    "title": "Noah's Purpose is Mass Migration to the Surface",
    "summary": "A theory that Noah's true purpose, tied to Joy Boy's promise, is to facilitate the mass migration of Fish-Man Island's citizens to the surface world, where they can live alongside humans without discrimination.",
    "fullText": "This theory proposes that the 'promised day' mentioned by the Sea Kings refers to a future time when Fish-Man Island's citizens will use Noah to migrate to the surface and live peacefully with humans. Joy Boy's broken promise 800 years ago was likely his failure to achieve this peaceful coexistence between races. The theory suggests that when this promise is eventually fulfilled - possibly by Luffy or someone in his generation - Noah will carry the fish-men and merfolk to the surface in a symbolic exodus similar to the biblical Noah's Ark. Queen Otohime's dream of the fish-men living on the surface aligns with this theory. The fact that Neptune apologizes for potentially destroying Noah in Episode 567 shows how important preserving the ship is for this future migration. Shirahoshi, as Poseidon, would command the Sea Kings to pull Noah to the surface, fulfilling the ancient promise.",
    "author": "One Piece Theory Communities",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Noah",
      "title": "Noah - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-26"
    },
    "postedDate": "2012-10-07",
    "episodeRange": [567, 1100],
    "minEpisode": 567,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": 5000,
      "comments": 800,
      "shares": 200
    },
    "status": "HIGHLY_LIKELY",
    "relatedCharacters": ["shirahoshi", "neptune", "otohime", "joy-boy"],
    "relatedLocations": ["noah", "fish-man-island"],
    "relatedEvents": ["ep567-event-004", "ep567-event-007"],
    "tags": ["noah", "joy-boy", "ancient-promise", "migration", "poseidon"]
  },
  {
    "id": "theory-ep567-004",
    "title": "Whitebeard's Protection Was Prophesied",
    "summary": "A theory that Whitebeard's arrival and protection of Fish-Man Island was not random, but part of a larger prophecy or plan connected to the ancient promises and the eventual return of Joy Boy.",
    "fullText": "The flashback in Episode 567 showing Whitebeard claiming Fish-Man Island sparked theories about whether this was prophesied or connected to ancient knowledge. Some fans theorize that Whitebeard, having traveled with Gol D. Roger to Laugh Tale and learned the true history, may have protected Fish-Man Island as part of ensuring the ancient promises could eventually be fulfilled. The parallel between Whitebeard and Luffy as protectors of the island suggests a pattern - perhaps each generation has had a powerful protector keeping Fish-Man Island safe until the promised day arrives. The fact that Whitebeard's protection lasted for decades and ended around the time Luffy emerged as a major player suggests a 'passing of the torch' that may be part of a larger destined timeline. Some theorists link this to Roger's famous words about being 'too early' - perhaps Whitebeard was also keeping the island safe until the right time.",
    "author": "One Piece Analysis Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Edward_Newgate",
      "title": "Edward Newgate - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-26"
    },
    "postedDate": "2012-10-07",
    "episodeRange": [567, 1000],
    "minEpisode": 567,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1000
    },
    "popularity": {
      "upvotes": 1200,
      "comments": 300,
      "shares": 50
    },
    "status": "SPECULATIVE",
    "relatedCharacters": ["edward-newgate", "luffy", "gol-d-roger", "neptune"],
    "relatedLocations": ["fish-man-island"],
    "relatedEvents": ["ep567-event-005"],
    "tags": ["whitebeard", "prophecy", "protection", "destiny"]
  }
]
