[
  {
    "abilityName": {
      "english": "Conqueror's Haki",
      "japanese": "覇王色の覇気",
      "romanized": "Haoshoku Haki"
    },
    "abilityType": "HAKI",
    "debutEpisode": 478,
    "debutChapter": 569,
    "description": "A rare and powerful form of Haki that allows the user to exert their willpower over others. Those with weak wills lose consciousness when exposed to it. Only one in several million people possess this ability, and it cannot be learned - one must be born with it.",
    "episodeAppearances": [478],
    "users": [
      {
        "characterId": "luffy",
        "episodeFirstUsed": 478,
        "masteryLevel": "BEGINNER",
        "notes": "Luffy uses it unconsciously in a moment of desperation to save Ace. He is not yet aware he possesses this power and cannot control it."
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 478,
        "eventId": "ep478-event-011",
        "momentType": "POWER_REVEAL",
        "title": "Luffy's First Clear Conqueror's Haki Manifestation",
        "description": "Luffy unconsciously unleashes a massive burst of Conqueror's Haki that knocks out both executioners about to kill Ace, as well as numerous Marines and pirates around the battlefield.",
        "significance": "This is the first undeniable display of Luffy possessing Conqueror's Haki, one of the rarest abilities in the One Piece world. It confirms Luffy has the potential to become a great leader and marks him as a major threat to the World Government.",
        "timestamp": "19:30"
      }
    ],
    "strengths": [
      "Can instantly incapacitate large numbers of weak-willed opponents",
      "Demonstrates the user possesses the qualities of a king or supreme ruler",
      "Cannot be learned or acquired - only those born with it can use it",
      "Effective even when used unconsciously"
    ],
    "weaknesses": [
      "Only affects those with weak wills - strong-willed individuals are unaffected",
      "Initially difficult to control and use consciously",
      "Does not work on inanimate objects or Devil Fruit users who are sufficiently strong"
    ],
    "evolutions": [],
    "relatedAbilities": [
      "armament-haki",
      "observation-haki"
    ],
    "images": []
  }
]
