[
  {
    "id": "theory-ep035-001",
    "title": "Bell-mère's Military Rank and Connection to Higher Marines",
    "summary": "Some fans theorize that Bell-mère may have held a higher rank in the Marines than initially suggested, based on the coat she wore when returning from the Oykot Kingdom.",
    "fullText": "Fans have noted that in the flashback showing Bell-mère's return from the Oykot Kingdom, she appears to be wearing a Marine coat similar to those worn by officers of Captain rank or higher. This has led to speculation that Bell-mère may have been a more significant Marine figure than the story initially suggests. Some theorists propose that her decision to leave the Marines and adopt two orphans may have been more controversial within Marine ranks than shown, and that her 'troubled past' mentioned by villagers could refer to conflicts with Marine superiors over her decision. However, her exact rank has never been officially confirmed in the series.",
    "author": "One Piece Wiki Contributors and Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Bell-mère",
      "title": "Bell-mère Character Page - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2024-01-01",
    "episodeRange": [35, 36],
    "minEpisode": 35,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 36
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["bell-mere"],
    "relatedLocations": ["oykot-kingdom"],
    "relatedEvents": ["ep035-event-002"],
    "tags": ["bell-mere", "marines", "rank", "background"]
  },
  {
    "id": "theory-ep035-002",
    "title": "Oykot Kingdom's Deeper Significance",
    "summary": "The fact that 'Oykot' is 'Tokyo' backwards has led fans to theorize about deeper symbolic meaning regarding the kingdom and its destruction.",
    "fullText": "One Piece fans have noted that the Oykot Kingdom, where Bell-mère found Nami and Nojiko, has a name that is literally 'Tokyo' spelled backwards. While this could simply be Oda's playful naming convention, some fans theorize it could have deeper significance. Some propose that the kingdom might represent a mirror or opposite of something important in the One Piece world. Others suggest that the war that destroyed Oykot Kingdom might be connected to larger World Government conflicts that are explored later in the series. The fact that Bell-mère was fighting pirates there as a Marine, and the apparent brutality of the conflict, has led to speculation about whether this was truly just a pirate attack or something more complex involving the World Government. However, the Oykot Kingdom has not been referenced again in the main story, so this remains purely speculative.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Oykot_Kingdom",
      "title": "Oykot Kingdom - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2024-01-01",
    "episodeRange": [35],
    "minEpisode": 35,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 35
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["bell-mere", "nami", "nojiko"],
    "relatedLocations": ["oykot-kingdom"],
    "relatedEvents": ["ep035-event-002", "ep035-event-003"],
    "tags": ["oykot-kingdom", "symbolism", "world-building", "naming"]
  },
  {
    "id": "theory-ep035-003",
    "title": "Nami's Biological Parents and War Origins",
    "summary": "Fans have theorized about the identity of Nami's biological parents and whether they might have significance to the larger One Piece story.",
    "fullText": "While Nami's adoptive family with Bell-mère and Nojiko is well-established, the identity of Nami's biological parents has never been revealed. Episode 35 shows that Nami was found as an infant in the ruins of the Oykot Kingdom war, but provides no information about who her parents were or why she was there. Some fans theorize that Nami's biological parents might have been significant figures - perhaps nobles of the Oykot Kingdom, important Marines, or even connected to larger mysteries in the One Piece world. The fact that Oda has never revealed this information, despite providing backstories for most Straw Hat biological families, has led to speculation that it might be deliberately withheld for a future reveal. However, others argue that Nami's story is intentionally about chosen family over blood relations, and that revealing her biological parents would undermine the themes of Bell-mère's sacrifice and unconditional love. As of the current story, Nami's biological origins remain unknown and may never be revealed.",
    "author": "r/OnePiece Community Discussion",
    "source": {
      "url": "https://www.reddit.com/r/OnePiece/",
      "title": "r/OnePiece Subreddit",
      "platform": "Reddit",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2024-01-01",
    "episodeRange": [35],
    "minEpisode": 35,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 35
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "SPECULATION",
    "relatedCharacters": ["nami", "bell-mere", "nojiko"],
    "relatedLocations": ["oykot-kingdom"],
    "relatedEvents": ["ep035-event-003"],
    "tags": ["nami", "origins", "parents", "mystery", "backstory"]
  },
  {
    "id": "theory-ep035-004",
    "title": "Bell-mère's Philosophy Foreshadowing Nami's Future",
    "summary": "Bell-mère's words 'If you survive, happy times will come your way' are theorized to be significant foreshadowing for Nami's entire character arc.",
    "fullText": "In Episode 35, Bell-mère tells Nojiko 'If you survive, happy times will come your way,' establishing a philosophy that sustains Nami through eight years of slavery under Arlong. Fans have noted that this philosophy isn't just a comforting platitude - it becomes a structural framework for Nami's entire character arc. Every time Nami faces despair throughout the series, she survives, and eventually finds happiness with the Straw Hat crew. Some fans theorize that this philosophy also foreshadows major moments in Nami's journey: her survival of Arlong's tyranny leads to happiness with Luffy's crew; her survival of various Grand Line dangers leads to deeper bonds with her nakama; and her continued survival through the series will eventually lead to her dream of mapping the entire world being fulfilled. The phrase has become so iconic that fans often cite it as one of the most important pieces of wisdom in One Piece, representing the series' overall theme that perseverance through hardship eventually leads to joy and fulfillment.",
    "author": "One Piece Analysis Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Bell-mère",
      "title": "Bell-mère - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2024-01-01",
    "episodeRange": [35, 36, 37],
    "minEpisode": 35,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 44
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "THEMATIC_ANALYSIS",
    "relatedCharacters": ["bell-mere", "nami", "nojiko"],
    "relatedLocations": [],
    "relatedEvents": ["ep035-event-010"],
    "tags": ["bell-mere", "philosophy", "foreshadowing", "themes", "nami"]
  }
]
