[
  {
    "theoryTitle": "Crocodile Was Originally a Woman",
    "theoryText": "A popular fan theory suggests that Crocodile, the leader of Baroque Works (Mr. 0), was originally a woman who was transformed into a man by Emporio Ivankov's Horm-Horm Fruit powers. This theory is supported by Ivankov's knowledge of a secret about Crocodile that he uses as leverage during the Impel Down arc. The theory gained additional traction when Oda made comments that seemed to validate aspects of it.",
    "author": "One Piece fan community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Crocodile",
      "platform": "REDDIT",
      "publishDate": null
    },
    "episodeRange": {
      "start": 103,
      "end": null
    },
    "relatedEpisodes": [103, 104, 110, 438, 439, 440],
    "relatedCharacters": ["crocodile", "ivankov"],
    "spoilerStatus": {
      "containsSpoilers": true,
      "spoilsBeyondEpisode": true,
      "severity": "MAJOR",
      "spoilerNotes": "References events and character interactions from much later arcs (Impel Down, Marineford)"
    },
    "popularity": {
      "platform": "REDDIT",
      "upvotes": null,
      "discussionThreads": "Multiple",
      "communityReception": "Widely discussed and debated"
    },
    "evidencePoints": [
      "Ivankov has knowledge of a secret about Crocodile that he uses as blackmail",
      "Crocodile shows unusual concern about this secret becoming public",
      "Ivankov's Devil Fruit can change people's biological sex",
      "Some interpretations of Oda's comments seem to support the theory"
    ],
    "status": "UNCONFIRMED",
    "canonStatus": "Fan speculation, not confirmed in canon"
  },
  {
    "theoryTitle": "Baroque Works' True Goal and Pluton",
    "theoryText": "At the time of Episode 103, anime-only viewers would theorize about what Mr. 0's true identity and ultimate goal might be. The gathering of all officer agents suggested a major operation was about to unfold. Many fans speculated that Baroque Works' goal went beyond simple criminal activity and involved something significant to Alabasta's history. This was later confirmed to be the acquisition of the ancient weapon Pluton.",
    "author": "One Piece fan community (circa 2002)",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Arabasta_Arc",
      "platform": "FORUMS",
      "publishDate": "2002"
    },
    "episodeRange": {
      "start": 92,
      "end": 130
    },
    "relatedEpisodes": [103, 104, 105, 110, 122],
    "relatedCharacters": ["crocodile", "nico-robin"],
    "spoilerStatus": {
      "containsSpoilers": true,
      "spoilsBeyondEpisode": true,
      "severity": "CRITICAL",
      "spoilerNotes": "This theory is eventually confirmed as the plot unfolds in later Alabasta Arc episodes"
    },
    "popularity": {
      "platform": "FORUMS",
      "upvotes": null,
      "discussionThreads": "Common speculation during original airing",
      "communityReception": "Widespread speculation before reveal"
    },
    "evidencePoints": [
      "Miss All Sunday (Nico Robin) can read Poneglyphs",
      "The organization's complex structure suggests a major objective",
      "The focus on Alabasta specifically hints at something unique to the kingdom",
      "Crocodile's status as a Warlord suggests ambitions beyond typical piracy"
    ],
    "status": "CONFIRMED",
    "canonStatus": "Later confirmed in the story"
  },
  {
    "theoryTitle": "Lassoo and the Mystery of Object-Consumed Devil Fruits",
    "theoryText": "Episode 103 introduces Lassoo, a gun that has somehow consumed the Inu Inu no Mi, Model: Dachshund. This raised immediate questions among fans about how inanimate objects can consume Devil Fruits. Theories ranged from special feeding techniques developed by Vegapunk or other scientists, to the idea that Devil Fruits house actual 'devil' spirits that can possess objects. This mystery wouldn't be fully explained until much later in the series.",
    "author": "One Piece fan community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Lassoo",
      "platform": "FORUMS",
      "publishDate": "2002"
    },
    "episodeRange": {
      "start": 103,
      "end": null
    },
    "relatedEpisodes": [103, 110, 385],
    "relatedCharacters": ["lassoo", "mr-4", "vegapunk"],
    "spoilerStatus": {
      "containsSpoilers": true,
      "spoilsBeyondEpisode": true,
      "severity": "MAJOR",
      "spoilerNotes": "The explanation for this phenomenon is revealed much later and involves Vegapunk's research"
    },
    "popularity": {
      "platform": "FORUMS",
      "upvotes": null,
      "discussionThreads": "Widely discussed when first introduced",
      "communityReception": "Major point of speculation and theorizing"
    },
    "evidencePoints": [
      "Lassoo clearly has Devil Fruit powers despite being an inanimate gun",
      "Funkfreed (Spandam's sword) later shows this isn't unique to Lassoo",
      "Vegapunk is mentioned as the world's greatest scientist",
      "The mechanism is never explained in the Alabasta Arc"
    ],
    "status": "PARTIALLY_EXPLAINED",
    "canonStatus": "Later partially explained through Vegapunk's technology"
  },
  {
    "theoryTitle": "The Significance of Yuba's Destruction",
    "theoryText": "Some fans theorized that Yuba's specific destruction and the drought affecting Alabasta weren't natural phenomena but were being deliberately caused by someone. The pattern of the drought, Yuba's complete devastation while other areas remained functional, and the timing of the rebellion suggested manipulation. This theory proved correct when it was later revealed that Crocodile was using Dance Powder to steal rain from certain areas.",
    "author": "One Piece fan community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Yuba",
      "platform": "FORUMS",
      "publishDate": "2002"
    },
    "episodeRange": {
      "start": 100,
      "end": 110
    },
    "relatedEpisodes": [103, 105, 107, 110],
    "relatedCharacters": ["crocodile", "toto", "koza", "vivi"],
    "spoilerStatus": {
      "containsSpoilers": true,
      "spoilsBeyondEpisode": true,
      "severity": "MAJOR",
      "spoilerNotes": "Confirmed in subsequent episodes of the Alabasta Arc"
    },
    "popularity": {
      "platform": "FORUMS",
      "upvotes": null,
      "discussionThreads": "Common speculation",
      "communityReception": "Many viewers suspected manipulation"
    },
    "evidencePoints": [
      "The drought's pattern seemed too convenient for inciting rebellion",
      "Yuba's complete destruction while being a loyal town was suspicious",
      "The existence of Dance Powder was already mentioned in earlier episodes",
      "The rebellion's timing aligned too perfectly with the drought's worst effects"
    ],
    "status": "CONFIRMED",
    "canonStatus": "Confirmed in the story - Crocodile was using Dance Powder"
  }
]
