[
  {
    "name": {
      "english": "Kaya's Mansion",
      "japanese": "カヤの屋敷",
      "romanized": "Kaya no Yashiki",
      "aliases": ["Kaya's Estate"]
    },
    "debutEpisode": 9,
    "debutChapter": 23,
    "episodeAppearances": [9],
    "locationType": "BUILDING",
    "region": "East Blue",
    "parentLocation": "Syrup Village",
    "description": "A grand mansion on a hilltop overlooking Syrup Village. The elegant estate belonged to Kaya's deceased parents and is now her home, where she is cared for by her butler Klahadore. The mansion is fenced and guarded, representing the wealth and isolation of its young owner.",
    "keyEvents": [
      {
        "episodeNumber": 9,
        "eventId": "ep009-event-003",
        "title": "Kaya's First Appearance",
        "description": "Kaya is first seen at her mansion, establishing it as a central location for the Syrup Village Arc.",
        "significance": "The mansion serves as the setting for Kuro's scheme and the developing relationship between Usopp and Kaya.",
        "timestamp": "08:15"
      },
      {
        "episodeNumber": 9,
        "eventId": "ep009-event-004",
        "title": "Klahadore's Introduction",
        "description": "Klahadore appears at the mansion grounds, establishing himself as the protective butler and caretaker of the estate.",
        "significance": "Sets up the mansion as the antagonist's base of operations while he plots against Kaya.",
        "timestamp": "10:30"
      },
      {
        "episodeNumber": 9,
        "eventId": "ep009-event-006",
        "title": "Usopp Sneaks Into the Mansion",
        "description": "Usopp uses his usual route to sneak into the mansion to visit Kaya, showing his familiarity with the estate.",
        "significance": "Demonstrates the secret friendship between Usopp and Kaya and his dedication to bringing her happiness.",
        "timestamp": "16:20"
      },
      {
        "episodeNumber": 9,
        "eventId": "ep009-event-007",
        "title": "Klahadore Confronts the Intruders",
        "description": "Klahadore discovers the Straw Hats and Usopp on the mansion grounds and confronts them for trespassing.",
        "significance": "Creates tension and establishes Klahadore's control over who can visit Kaya.",
        "timestamp": "19:10"
      }
    ],
    "statusHistory": [
      {
        "status": "ACTIVE",
        "episodeStart": 9,
        "description": "Mansion is the home of Kaya and base for Klahadore's operations"
      }
    ],
    "notableFeatures": [
      "Grand hilltop location overlooking the village",
      "Fenced perimeter with guards",
      "Elegant European-inspired architecture",
      "Secret routes known to Usopp for sneaking in"
    ],
    "culturalSignificance": "The mansion represents wealth and class division in Syrup Village, as well as Kaya's isolation from the rest of the village following her parents' death.",
    "inspiration": "The mansion was inspired by rural English estates, fitting the European aesthetic of Syrup Village."
  }
]
