[
  {
    "name": {
      "english": "Sun Pirates",
      "japanese": "タイヨウの海賊団",
      "romanized": "Taiyō no Kaizokudan"
    },
    "crewType": "PIRATE_CREW",
    "captainId": "fisher-tiger",
    "debutEpisode": 415,
    "debutChapter": 521,
    "episodeAppearances": [415],
    "members": [
      {
        "characterId": "fisher-tiger",
        "role": "Captain and Founder",
        "episodeJoined": 415,
        "episodeLeft": null,
        "joinCircumstances": "Fisher Tiger founded the Sun Pirates after freeing the slaves from Mary Geoise to protect the freed slaves and give them a home."
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 415,
        "eventId": "ep415-event-008",
        "momentType": "FORMATION",
        "title": "Sun Pirates Formation Revealed",
        "description": "Hancock reveals that after Fisher Tiger freed the slaves from Mary Geoise, the freed fish-men slaves decided to join him and he formed the Sun Pirates. He created their sun symbol to cover the slave brands of the Hoof of the Celestial Dragon.",
        "significance": "The formation of the Sun Pirates represents hope and freedom for former slaves. The sun symbol covering the slave brands is a powerful statement of transformation from property to free people.",
        "timestamp": "18:30"
      },
      {
        "episodeNumber": 415,
        "eventId": "ep415-event-009",
        "momentType": "WORLD_LORE",
        "title": "Sun Pirates Symbol Explained",
        "description": "The meaning of the Sun Pirates' sun mark is revealed - it was created by Fisher Tiger to brand over the Hoof of the Celestial Dragon slave marks, giving freed slaves a new identity and hiding their shameful past.",
        "significance": "This explains why characters like Hatchan and Arlong bear the sun mark and connects multiple arcs. The symbol represents the transformation from slavery to freedom.",
        "timestamp": "18:30"
      }
    ],
    "ships": [],
    "bases": [],
    "totalBountyProgression": [],
    "jollyRoger": {
      "description": "A sun symbol with a smiling face, designed to cover the Hoof of the Celestial Dragon slave brand",
      "episodeFirstSeen": 415,
      "imageUrl": "",
      "significance": "The sun jolly roger serves dual purposes: as the crew's symbol and as a way to rebrand former slaves, covering their shameful marks with a symbol of freedom and new life"
    },
    "mainColor": "#FFD700",
    "relationships": {
      "allies": [],
      "enemies": ["world-government"],
      "parentOrganization": null
    },
    "crewPhilosophy": "Liberation and freedom for all, regardless of race. Fisher Tiger founded the crew on the principle of not discriminating between species, freeing both fish-men and humans from slavery despite his own hatred of humans.",
    "disbandmentStatus": {
      "isDisbanded": true,
      "episodeDisbanded": 541,
      "reason": "The crew split after Fisher Tiger's death, with some members joining Arlong and others following Jinbe"
    }
  },
  {
    "name": {
      "english": "Kuja Pirates",
      "japanese": "九蛇海賊団",
      "romanized": "Kuja Kaizokudan"
    },
    "crewType": "PIRATE_CREW",
    "captainId": "hancock",
    "debutEpisode": 410,
    "debutChapter": 516,
    "episodeAppearances": [415],
    "members": [],
    "keyMoments": [
      {
        "episodeNumber": 415,
        "eventId": "ep415-event-006",
        "momentType": "BACKSTORY_REVEAL",
        "title": "Hancock's First Voyage with the Kuja Pirates",
        "description": "It is revealed that Hancock, Sandersonia, and Marigold were on their first voyage as trainee pirates with the Kuja Pirates when they were kidnapped by slave traders at age twelve.",
        "significance": "This backstory explains how the Boa sisters were captured and provides context for their tragic past. Their first adventure as pirates ended in their worst nightmare.",
        "timestamp": "13:00"
      }
    ],
    "ships": [],
    "bases": ["amazon-lily"],
    "totalBountyProgression": [],
    "jollyRoger": {
      "description": "A skull with a crown and snake design, representing the Pirate Empress and the snake-themed warrior women of Amazon Lily",
      "episodeFirstSeen": 410,
      "imageUrl": ""
    },
    "mainColor": "#FF1493",
    "relationships": {
      "allies": [],
      "enemies": [],
      "parentOrganization": "world-government"
    },
    "crewPhilosophy": "An all-female pirate crew from Amazon Lily, led by the Pirate Empress Boa Hancock who is also a Warlord of the Sea."
  }
]
