[
  {
    "id": "theory-ep415-001",
    "title": "Hancock Will Be Recaptured and Returned to Slavery",
    "summary": "A theory suggesting that the World Government still considers Hancock and other freed slaves as their property, and she may be captured and sold back into slavery in future arcs.",
    "fullText": "According to this theory, the World Government and Celestial Dragons view the slaves freed by Fisher Tiger as runaway property rather than free people. With Hancock's Warlord status potentially revoked and the SSG weapon development, there is speculation that Hancock could be captured by Marine forces or the new weapons and returned to slavery. The theory suggests this would be the ultimate tragedy for her character and could trigger a major conflict involving Luffy rescuing her, paralleling Fisher Tiger's raid on Mary Geoise.",
    "author": "Shahzaib Hassan and various Reddit users",
    "source": {
      "url": "https://medium.com/@shahzaibh96/boa-hancock-the-marines-and-her-return-to-slavery-430e1b20041f",
      "title": "Boa Hancock, The Marines, and Her Return to Slavery",
      "platform": "Medium",
      "accessedAt": "2025-12-07"
    },
    "postedDate": "2023-01-01",
    "episodeRange": [415, 1100],
    "minEpisode": 415,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["hancock", "luffy"],
    "relatedLocations": ["mary-geoise", "amazon-lily"],
    "relatedEvents": ["ep415-event-006", "ep415-event-007"],
    "tags": ["hancock", "slavery", "world-government", "future-arc", "rescue-mission"]
  },
  {
    "id": "theory-ep415-002",
    "title": "Fisher Tiger Had Help from Shanks During the Mary Geoise Raid",
    "summary": "Recent manga revelations suggest that Fisher Tiger received unexpected assistance from Shanks during his raid on Mary Geoise, which explains how he was able to succeed.",
    "fullText": "In One Piece Chapter 1167, it was revealed that Fisher Tiger encountered Shanks while trying to escape Mary Geoise. Shanks, who was a God's Knight at the time, struck Tiger's chains and opened the armory for him. This theory suggests that without Shanks' intervention, Fisher Tiger would not have been able to free the slaves and escape. It raises questions about Shanks' motivations and his opposition to the Celestial Dragons even while serving as a God's Knight. The theory also questions why the God's Knights weren't present to stop the raid, suggesting Tiger may have timed his attack during the triennial hunting event when they were away.",
    "author": "One Piece Manga Readers and Reddit Community",
    "source": {
      "url": "https://comicbook.com/anime/feature/one-piece-chapter-1167-fisher-tiger-retcon/",
      "title": "Why One Piece's Latest Twist Isn't The Retcon People Think It Is",
      "platform": "ComicBook.com",
      "accessedAt": "2025-12-07"
    },
    "postedDate": "2025-01-01",
    "episodeRange": [415, 1200],
    "minEpisode": 415,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1200
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["fisher-tiger", "shanks", "hancock"],
    "relatedLocations": ["mary-geoise"],
    "relatedEvents": ["ep415-event-008"],
    "tags": ["fisher-tiger", "shanks", "mary-geoise", "gods-knights", "slave-liberation", "manga-spoiler"]
  },
  {
    "id": "theory-ep415-003",
    "title": "The Hoof of the Celestial Dragon Brand Has Deeper Meaning",
    "summary": "Some fans theorize that the slave brand of the Celestial Dragons may have additional significance beyond marking ownership, possibly connected to ancient history or Devil Fruit creation.",
    "fullText": "The Hoof of the Soaring Dragon brand given to slaves raises questions about its design and purpose. Some theories suggest the brand may be connected to the ancient dragon symbols seen throughout One Piece, the Ancient Weapons, or even the process by which Devil Fruits are created or controlled. The fact that Fisher Tiger specifically chose a sun symbol to cover it - a symbol of freedom and light - may be thematically significant. Other theories propose that the brand itself may have been designed after the symbol of the Ancient Kingdom that the World Government destroyed, as a way for the Celestial Dragons to literally mark their dominance over the remnants of their enemies.",
    "author": "Various One Piece Theory Communities",
    "source": {
      "url": "https://fictionhorizon.com/one-piece-the-mark-on-boa-hancocks-back-explained/",
      "title": "One Piece: The Mark on Boa Hancock's Back Explained!",
      "platform": "Fiction Horizon",
      "accessedAt": "2025-12-07"
    },
    "postedDate": "2023-06-01",
    "episodeRange": [415, 1000],
    "minEpisode": 415,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 415
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["hancock", "sandersonia", "marigold"],
    "relatedLocations": ["mary-geoise"],
    "relatedEvents": ["ep415-event-005"],
    "tags": ["celestial-dragons", "slave-brand", "ancient-kingdom", "symbolism", "world-lore"]
  },
  {
    "id": "theory-ep415-004",
    "title": "Luffy Will Eventually Lead a Second Raid on Mary Geoise",
    "summary": "Fans theorize that Luffy will eventually attack Mary Geoise similar to Fisher Tiger, potentially to rescue someone or destroy the World Government's seat of power.",
    "fullText": "Given Luffy's hatred of the Celestial Dragons established in this episode and at Sabaody, combined with his pattern of defying the World Government, many fans believe Luffy will eventually lead an attack on Mary Geoise. This could parallel Fisher Tiger's raid but on a much larger scale, possibly during the final war. The theory suggests Luffy might rescue Hancock if she's recaptured, free current slaves, or destroy the seat of World Government power entirely. Some versions of the theory propose this raid will be when the full truth of the Void Century is revealed to the world.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_415",
      "title": "Episode 415 Discussion",
      "platform": "Fandom",
      "accessedAt": "2025-12-07"
    },
    "postedDate": "2020-01-01",
    "episodeRange": [415, 1100],
    "minEpisode": 415,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 415
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["luffy", "hancock", "fisher-tiger"],
    "relatedLocations": ["mary-geoise"],
    "relatedEvents": ["ep415-event-008", "ep415-event-011"],
    "tags": ["luffy", "mary-geoise", "raid", "fisher-tiger-parallel", "final-war", "world-government"]
  }
]
