[
  {
    "name": {
      "english": "Brook",
      "japanese": "ブルック",
      "romanized": "Burukku"
    },
    "debutEpisode": 337,
    "debutChapter": 442,
    "episodeAppearances": [353],
    "keyMoments": [
      {
        "episodeNumber": 353,
        "eventId": "ep353-event-004",
        "momentType": "BACKSTORY_REVEAL",
        "title": "Brook's Promise to Laboon Revealed",
        "description": "Franky reveals to the crew that Brook has been alive for fifty years solely to fulfill his promise to return to Laboon, the whale his crew left at Reverse Mountain. This revelation explains Brook's unwavering determination to retrieve his shadow.",
        "significance": "This is the pivotal backstory reveal that gives Brook's character profound emotional depth and connects him directly to the Straw Hats' earlier journey, making his potential recruitment deeply personal.",
        "timestamp": "11:30",
        "quote": "Brook mentioned Laboon, whom he'd been forced to leave behind at Twin Cape but not before promising to return for him."
      }
    ],
    "status": "ALIVE",
    "statusHistory": [
      {
        "status": "ALIVE",
        "episodeStart": 337,
        "episodeEnd": "present",
        "note": "Alive as undead skeleton due to Yomi Yomi no Mi"
      }
    ],
    "occupations": ["Musician", "Swordsman", "Pirate"],
    "affiliations": [
      {
        "crewId": "rumbar-pirates",
        "role": "Musician, Acting Captain (after Captain Yorki's departure)",
        "episodeJoined": null,
        "episodeLeft": null,
        "note": "Former crew, all deceased"
      }
    ],
    "reveals": [
      {
        "infoType": "RELATIONSHIP",
        "information": "Brook's promise to Laboon is his sole reason for continuing to exist after fifty years alone",
        "episodeRevealed": 353,
        "severity": "CRITICAL"
      },
      {
        "infoType": "BACKSTORY",
        "information": "Brook and the Rumbar Pirates left Laboon at Reverse Mountain with a promise to return after sailing around the world",
        "episodeRevealed": 353,
        "severity": "CRITICAL"
      }
    ],
    "relationships": [
      {
        "targetCharacterId": "laboon",
        "relationshipType": "FRIEND",
        "description": "Brook made a promise to Laboon fifty years ago to return after sailing around the Grand Line. This promise is Brook's primary motivation for living and his reason for needing to retrieve his shadow.",
        "episodeEstablished": 353,
        "evolutionMoments": [
          {
            "episodeNumber": 353,
            "description": "The Straw Hats learn about Brook's deep connection to Laboon and his fifty-year commitment to keeping his promise.",
            "newRelationshipType": "FRIEND"
          }
        ]
      },
      {
        "targetCharacterId": "straw-hat-pirates",
        "relationshipType": "ALLY",
        "description": "The revelation of Brook's connection to Laboon strengthens the bond between Brook and the Straw Hats, who have also met Laboon and understand the weight of his promise.",
        "episodeEstablished": 353,
        "evolutionMoments": [
          {
            "episodeNumber": 353,
            "description": "The shared connection to Laboon creates a deeper understanding between Brook and the crew, making his potential recruitment more meaningful.",
            "newRelationshipType": "ALLY"
          }
        ]
      }
    ],
    "voiceActors": {
      "japanese": "Cho",
      "english": "Ian Sinclair"
    }
  },
  {
    "name": {
      "english": "Laboon",
      "japanese": "ラブーン",
      "romanized": "Rabūn"
    },
    "debutEpisode": 50,
    "debutChapter": 102,
    "episodeAppearances": [353],
    "keyMoments": [
      {
        "episodeNumber": 353,
        "eventId": "ep353-event-004",
        "momentType": "RELATIONSHIP_REVEAL",
        "title": "Connection to Brook Revealed",
        "description": "It is revealed that Laboon, the whale the Straw Hats met at the entrance to the Grand Line, is the friend Brook has been waiting to reunite with for fifty years. The Rumbar Pirates promised to return to Laboon after sailing around the world.",
        "significance": "This revelation creates a powerful narrative connection between the Straw Hats' early journey and Brook's backstory, demonstrating the interconnected nature of the Grand Line and adding profound emotional weight to Brook's character.",
        "timestamp": "11:30",
        "quote": ""
      },
      {
        "episodeNumber": 353,
        "eventId": "ep353-event-005",
        "momentType": "RELATIONSHIP_REVEAL",
        "title": "Straw Hats Confirm Meeting Laboon",
        "description": "Luffy, Zoro, Usopp, and Sanji reveal to the rest of the crew that they've already met Laboon at Reverse Mountain and know about the promise the Rumbar Pirates made to him.",
        "significance": "This moment establishes that the Straw Hats have a personal connection to Brook's quest, making them uniquely qualified to understand and help him fulfill his promise.",
        "timestamp": "14:45",
        "quote": ""
      }
    ],
    "status": "ALIVE",
    "statusHistory": [
      {
        "status": "ALIVE",
        "episodeStart": 50,
        "episodeEnd": "present"
      }
    ],
    "occupations": [],
    "affiliations": [],
    "reveals": [
      {
        "infoType": "RELATIONSHIP",
        "information": "Laboon is waiting for Brook and the Rumbar Pirates to return, as they promised fifty years ago",
        "episodeRevealed": 353,
        "severity": "CRITICAL"
      },
      {
        "infoType": "BACKSTORY",
        "information": "Laboon befriended the Rumbar Pirates and traveled with them until they had to leave him at Reverse Mountain due to the dangers of the Grand Line",
        "episodeRevealed": 353,
        "severity": "MAJOR"
      }
    ],
    "relationships": [
      {
        "targetCharacterId": "brook",
        "relationshipType": "FRIEND",
        "description": "Laboon has been waiting at Reverse Mountain for fifty years for Brook and the Rumbar Pirates to return as promised. The bond between them is so strong that Brook's sole reason for existing is to fulfill this promise.",
        "episodeEstablished": 353,
        "evolutionMoments": [
          {
            "episodeNumber": 353,
            "description": "The audience and most of the Straw Hat crew learn about the deep bond between Laboon and Brook, and Brook's promise to return.",
            "newRelationshipType": "FRIEND"
          }
        ]
      },
      {
        "targetCharacterId": "rumbar-pirates",
        "relationshipType": "FRIEND",
        "description": "Laboon befriended the entire Rumbar Pirates crew and they promised to return to him after sailing around the Grand Line.",
        "episodeEstablished": 353,
        "evolutionMoments": [
          {
            "episodeNumber": 353,
            "description": "The promise the Rumbar Pirates made to Laboon is revealed as the central motivation for Brook's continued existence.",
            "newRelationshipType": "FRIEND"
          }
        ]
      },
      {
        "targetCharacterId": "luffy",
        "relationshipType": "FRIEND",
        "description": "Luffy made his own promise to Laboon to return for a rematch after sailing around the Grand Line, paralleling Brook's promise.",
        "episodeEstablished": 353,
        "evolutionMoments": [
          {
            "episodeNumber": 353,
            "description": "Through flashback, the Straw Hats recall their meeting with Laboon and Luffy's promise, creating a connection to Brook's story.",
            "newRelationshipType": "FRIEND"
          }
        ]
      }
    ],
    "voiceActors": {
      "japanese": "Unknown",
      "english": "Unknown"
    }
  }
]
