[
  {
    "name": {
      "english": "Shadow-Shadow Fruit",
      "japanese": "カゲカゲの実",
      "romanized": "Kage Kage no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 343,
    "debutChapter": 455,
    "episodeAppearances": [353],
    "currentUser": "Gecko Moria",
    "previousUsers": [],
    "abilities": [
      {
        "abilityName": "Shadow Theft",
        "description": "The ability to steal shadows from living beings and implant them into corpses to create zombies, or into other living people to enhance their power.",
        "episodeFirstUsed": 343,
        "classification": "OFFENSIVE"
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 353,
        "eventId": "ep353-event-002",
        "title": "Consequences of Shadow Theft",
        "description": "The crew discovers that Luffy, Zoro, and Sanji have had their shadows stolen by Gecko Moria using the Kage Kage no Mi, leaving them vulnerable to sunlight.",
        "significance": "This demonstrates the serious threat posed by Moria's devil fruit powers and raises the stakes for the arc.",
        "timestamp": "05:20"
      },
      {
        "episodeNumber": 353,
        "eventId": "ep353-event-007",
        "title": "Luffy's Shadow in Oars",
        "description": "The crew learns that Luffy's stolen shadow has been implanted into the legendary giant Oars, creating an extremely powerful zombie.",
        "significance": "Shows the full potential of the Kage Kage no Mi when used to combine personalities with powerful bodies.",
        "timestamp": "18:40"
      }
    ],
    "awakening": {
      "isAwakened": false,
      "awakeningEpisode": null,
      "awakeningAbilities": []
    },
    "strengths": [
      "Can create an army of zombies by stealing shadows and implanting them in corpses",
      "Victims who lose their shadows will be vaporized if exposed to sunlight",
      "Can swap shadows between bodies to create powerful combinations"
    ],
    "weaknesses": [
      "Standard Devil Fruit weaknesses (seawater, Seastone)",
      "Zombies created are vulnerable to salt purification",
      "Shadows retain the personality and abilities of their original owners, which can cause zombies to act unpredictably"
    ],
    "historicalSignificance": "This Devil Fruit is the foundation of Gecko Moria's power as one of the Seven Warlords of the Sea and his ability to create his zombie army on Thriller Bark.",
    "culturalReferences": []
  }
]
