[
  {
    "id": "theory-ep087-001",
    "title": "Hiriluk's Flag Foreshadows Inherited Will Theme",
    "theory": "The intense focus on protecting Hiriluk's flag in Episode 87 is one of the earliest and clearest demonstrations of One Piece's central theme of 'inherited will' (受け継がれる意志). Luffy's protection of the flag despite not knowing Hiriluk personally foreshadows how he will later protect and inherit the wills of many other characters throughout the series, including Ace's will and eventually even Roger's dream.",
    "author": "Various r/OnePiece users",
    "platform": "Reddit",
    "episodesSpanned": [87, 483, 877],
    "minEpisode": 87,
    "spoilerStatus": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 1000,
      "spoilerDescription": "References major events throughout the series including Marineford and beyond"
    },
    "status": "WIDELY_ACCEPTED",
    "evidence": [
      "Luffy explicitly states the flag is 'a symbol of faith and a pledge to risk one's life'",
      "This theme recurs throughout One Piece with increasing significance",
      "Oda has stated inherited will is one of the series' core themes"
    ],
    "popularity": "HIGH"
  },
  {
    "id": "theory-ep087-002",
    "title": "Baku Baku no Mi's True Potential Remains Unexplored",
    "theory": "The Baku Baku no Mi's ability to fuse living beings (as shown with Chessmarimo) suggests the fruit has far greater potential than Wapol ever realized. Some fans theorize that a more creative user could fuse Devil Fruit users together, potentially creating beings with multiple Devil Fruit powers without dying. This could explain certain mysterious characters later in the series.",
    "author": "One Piece theory community",
    "platform": "Reddit/YouTube",
    "episodesSpanned": [87],
    "minEpisode": 87,
    "spoilerStatus": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 500,
      "spoilerDescription": "Discusses potential connections to later Devil Fruit mechanics"
    },
    "status": "SPECULATIVE",
    "evidence": [
      "Chessmarimo demonstrates the fruit can fuse living beings",
      "The 24-hour limitation suggests untapped potential with proper planning",
      "Wapol's lack of creativity limits what we see the fruit accomplish"
    ],
    "popularity": "MEDIUM"
  },
  {
    "id": "theory-ep087-003",
    "title": "Wapol's Defeat Parallels Future Tyrant Battles",
    "theory": "The Drum Island arc, and specifically the battle in Episode 87, establishes a narrative pattern that Oda follows throughout One Piece: a tyrant oppressing a population is defeated by the Straw Hats, who then help the oppressed choose their own leader. This pattern repeats in Alabasta, Dressrosa, Wano, and other arcs.",
    "author": "Arc analysis community",
    "platform": "Various forums",
    "episodesSpanned": [87, 130, 702, 982],
    "minEpisode": 87,
    "spoilerStatus": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 1000,
      "spoilerDescription": "References major arcs throughout the entire series"
    },
    "status": "CONFIRMED",
    "evidence": [
      "Wapol's tyranny over Drum Island mirrors Crocodile's over Alabasta",
      "The pattern of 'liberator but not ruler' is consistent across arcs",
      "Oda has stated this is intentional thematic structure"
    ],
    "popularity": "HIGH"
  },
  {
    "id": "theory-ep087-004",
    "title": "Chopper's Victory Represents Medical Philosophy Triumph",
    "theory": "Chopper's defeat of Chessmarimo in Episode 87 represents more than just a physical victory - it symbolizes the triumph of Hiriluk and Kureha's medical philosophy (healing everyone) over Wapol's philosophy (medicine only for the elite). Chopper uses his medical knowledge (identifying the weak point) combined with his Rumble Ball medicine to win.",
    "author": "Character analysis community",
    "platform": "Reddit/Tumblr",
    "episodesSpanned": [87],
    "minEpisode": 87,
    "spoilerStatus": {
      "containsSpoilers": false,
      "maxEpisodeSpoiler": 87,
      "spoilerDescription": "No spoilers beyond episode 87"
    },
    "status": "WIDELY_ACCEPTED",
    "evidence": [
      "Chopper uses Brain Point (medical knowledge) to find the weakness",
      "The Rumble Ball is itself a symbol of innovative medicine",
      "The battle takes place while defending Hiriluk's memorial flag"
    ],
    "popularity": "MEDIUM"
  }
]
