[
  {
    "name": {
      "english": "Snip-Snip Fruit",
      "japanese": "チョキチョキの実",
      "romanized": "Choki Choki no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 438,
    "debutChapter": 536,
    "description": "Grants the user's body the ability to transform parts into scissors and cut through any solid material as if it were paper, making the user a Scissors Human.",
    "episodeAppearances": [442],
    "users": [
      {
        "characterId": "inazuma",
        "episodeStart": 438,
        "episodeEnd": "present",
        "circumstances": "Inazuma previously ate the fruit and serves as Emporio Ivankov's deputy commander"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Stone Floor Cutting",
        "episodeRevealed": 442,
        "description": "User can cut solid stone floors into strips as if cutting paper, then manipulate the cut pieces.",
        "severity": "MAJOR",
        "firstUseContext": "Inazuma cuts the stone floor of Level 6 into strips and folds them to block sleeping gas from reaching Luffy, Ivankov, and himself."
      },
      {
        "abilityName": "Barrier Creation",
        "episodeRevealed": 442,
        "description": "User can fold cut materials to create protective barriers or structures.",
        "severity": "MAJOR",
        "firstUseContext": "After cutting the floor, Inazuma folds the stone strips over the staircase to seal off the sleeping gas."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim in water",
        "episodeRevealed": 442,
        "severity": "MAJOR"
      }
    ],
    "strengths": [
      {
        "strength": "Can cut through any solid material regardless of hardness",
        "episodeRevealed": 442,
        "description": "The fruit allows the user to treat any solid object as if it were paper, cutting through stone, metal, and other materials effortlessly.",
        "severity": "MAJOR"
      },
      {
        "strength": "Terrain manipulation",
        "episodeRevealed": 442,
        "description": "By cutting and reshaping the environment, the user can create pathways, barriers, and structures from existing materials.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "MEDIUM"
  }
]
