[
  {
    "id": "baroque-works",
    "name": {
      "english": "Baroque Works",
      "japanese": "バロックワークス",
      "romanized": "Barokku Wākusu"
    },
    "type": "CRIMINAL_ORGANIZATION",
    "leader": "crocodile",
    "episodeAppearances": [121],
    "keyMoments": [
      {
        "episodeNumber": 121,
        "title": "Infiltrators Revealed on Both Sides",
        "description": "Baroque Works agents disguised as members of both the rebel army and royal guards are exposed when they shoot Koza and escalate the violence between the two armies.",
        "timestamp": "05:15",
        "significance": "Reveals the full extent of Baroque Works' infiltration strategy and manipulation of the Alabasta civil war. Shows how Crocodile ensured the conflict would continue regardless of what the leaders wanted."
      },
      {
        "episodeNumber": 121,
        "title": "Sandstorm Cover for Violence",
        "description": "During a sandstorm (likely created by Crocodile), Baroque Works agents on both sides use the obscured visibility to fire more shots and trigger renewed clashing.",
        "timestamp": "08:30",
        "significance": "Demonstrates the coordinated nature of Baroque Works' operations and their use of Crocodile's Devil Fruit powers to facilitate their schemes."
      }
    ],
    "description": "A secret criminal syndicate led by Crocodile (Mr. 0) that has been orchestrating the civil war in Alabasta. In this episode, their infiltration of both the rebel army and royal guards is revealed, showing the depth of their manipulation."
  },
  {
    "id": "straw-hat-pirates",
    "name": {
      "english": "Straw Hat Pirates",
      "japanese": "麦わらの一味",
      "romanized": "Mugiwara no Ichimi"
    },
    "type": "PIRATE_CREW",
    "leader": "luffy",
    "episodeAppearances": [121],
    "keyMoments": [
      {
        "episodeNumber": 121,
        "title": "Luffy Returns to Save Vivi",
        "description": "Captain Luffy makes his dramatic return to the conflict, arriving on Pell's back to save Vivi from falling to her death and challenging Crocodile to a rematch.",
        "timestamp": "17:00",
        "significance": "Marks Luffy's return to the main conflict after recovering from his defeat. Shows the Straw Hats' commitment to protecting Vivi and stopping Crocodile's plan."
      }
    ],
    "description": "The pirate crew led by Monkey D. Luffy, allied with Princess Vivi to stop Crocodile and save Alabasta from civil war."
  }
]
