[
  {
    "id": "suna-suna-no-mi",
    "name": {
      "english": "Sand-Sand Fruit",
      "japanese": "スナスナの実",
      "romanized": "Suna Suna no Mi"
    },
    "type": "LOGIA",
    "currentUser": "crocodile",
    "episodeAppearances": [121],
    "abilities": [
      {
        "name": "Sand Body Transformation",
        "description": "Allows the user to transform into sand and reform, making them immune to most physical attacks",
        "firstUsedInEpisode": 110
      },
      {
        "name": "Sandstorm Creation",
        "description": "The user can create and control massive sandstorms",
        "firstUsedInEpisode": 110
      }
    ],
    "weaknesses": [
      {
        "weakness": "Water",
        "description": "When water contacts the user's sand body, it prevents them from turning into sand and makes them vulnerable to physical attacks. This is revealed to be why Crocodile orchestrated the drought in Alabasta - to eliminate his weakness.",
        "revealedInEpisode": 121,
        "significance": "This revelation explains both Crocodile's motivation for stealing Alabasta's rain and provides Luffy with a method to fight the Warlord effectively."
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 121,
        "title": "Water Weakness Revealed",
        "description": "Luffy reveals that he discovered water is Crocodile's weakness during their first battle when water from Yuba spilled on Crocodile and prevented him from turning to sand.",
        "timestamp": "21:15",
        "significance": "This is a crucial revelation that explains Crocodile's orchestration of the drought and provides the key to defeating him."
      },
      {
        "episodeNumber": 121,
        "title": "Sandstorm Obscures Battlefield",
        "description": "A massive sandstorm, likely created or manipulated by Crocodile, sweeps through the palace courtyard during the battle.",
        "timestamp": "08:30",
        "significance": "The sandstorm serves Baroque Works' purposes by creating chaos and allowing infiltrators to escalate violence unseen."
      }
    ]
  }
]
