[
  {
    "id": "theory121-001",
    "title": "Crocodile's Drought Strategy as Weakness Elimination",
    "theory": "The revelation that water is Crocodile's weakness retroactively explains his entire scheme in Alabasta. By creating a multi-year drought, Crocodile wasn't just destabilizing the kingdom - he was systematically eliminating the one substance that could counter his Devil Fruit powers. This suggests Crocodile's plans are always multi-layered, addressing both his strategic goals and his personal vulnerabilities.",
    "author": "General fan observation",
    "sourceUrl": "https://onepiece.fandom.com/wiki/Episode_121",
    "platform": "One Piece Community",
    "publishDate": "2002-2025",
    "spoilerScope": {
      "containsSpoilers": false,
      "spoilerEpisodes": [],
      "spoilerArcs": []
    },
    "relatedEpisodes": [110, 121, 122],
    "relatedCharacters": ["crocodile"],
    "status": "CONFIRMED",
    "evidence": [
      "Luffy explicitly states in Episode 121 that Crocodile stole Alabasta's rain because water is his weakness",
      "The drought served dual purposes: political destabilization and tactical advantage"
    ]
  },
  {
    "id": "theory121-002",
    "title": "Baroque Works Infiltration Depth",
    "theory": "The revelation that Baroque Works had agents infiltrated into both the rebel army and the royal guards raises questions about how deep and extensive their network truly was. Some fans theorize that Baroque Works may have had agents in nearly every important organization in Alabasta, suggesting Crocodile's planning went back many years before the drought even began.",
    "author": "One Piece fan community",
    "sourceUrl": "https://onepiece.fandom.com/wiki/Arabasta_Arc",
    "platform": "Various fan discussions",
    "publishDate": "2002-2025",
    "spoilerScope": {
      "containsSpoilers": false,
      "spoilerEpisodes": [],
      "spoilerArcs": []
    },
    "relatedEpisodes": [121, 122, 123],
    "relatedCharacters": ["crocodile"],
    "crewIds": ["baroque-works"],
    "status": "SPECULATIVE",
    "evidence": [
      "Agents shown on both sides of the conflict in Episode 121",
      "The sophistication of Crocodile's multi-year plan suggests extensive preparation"
    ]
  }
]
