[
  {
    "id": "alubarna-palace",
    "name": {
      "english": "Alubarna Palace",
      "japanese": "アルバーナ宮殿",
      "romanized": "Arubāna Kyūden"
    },
    "type": "PALACE",
    "episodeAppearances": [121],
    "keyEvents": [
      {
        "episodeNumber": 121,
        "title": "Civil War Battle at the Palace",
        "description": "The rebel army and royal guards clash in a full-scale battle at the palace courtyard, with Baroque Works infiltrators on both sides escalating the violence.",
        "timestamp": "03:30",
        "significance": "The palace becomes the central battlefield of the civil war, representing the heart of the conflict between the rebels and the kingdom."
      },
      {
        "episodeNumber": 121,
        "title": "Koza Shot at the Palace",
        "description": "Koza is shot by a Baroque Works infiltrator disguised as a royal guard while trying to stop the fighting.",
        "timestamp": "05:15",
        "significance": "Shows how the palace has been infiltrated by Baroque Works agents and become a site of tragedy."
      },
      {
        "episodeNumber": 121,
        "title": "Sandstorm Engulfs the Palace",
        "description": "A massive sandstorm sweeps through the palace courtyard, obscuring the battlefield and allowing Baroque Works agents to escalate the violence in the confusion.",
        "timestamp": "08:30",
        "significance": "The sandstorm transforms the palace into a chaotic, dangerous environment where neither side can see clearly."
      },
      {
        "episodeNumber": 121,
        "title": "Crocodile Drops Vivi from Palace Cliff",
        "description": "Crocodile captures Vivi at the palace and drops her from a massive cliff attached to the palace structure, attempting to kill her.",
        "timestamp": "15:45",
        "significance": "The palace becomes the site of one of the darkest moments in the arc, where Crocodile attempts to murder the princess."
      },
      {
        "episodeNumber": 121,
        "title": "Luffy's Dramatic Arrival at the Palace",
        "description": "Luffy arrives at the palace on Pell's back, saving Vivi and confronting Crocodile for their rematch.",
        "timestamp": "17:00",
        "significance": "The palace becomes the stage for the climactic confrontation between Luffy and Crocodile."
      }
    ],
    "description": "The royal palace of Alabasta located in the capital city of Alubarna. In this episode, it serves as the main battlefield for the civil war and the location of the confrontation between Luffy and Crocodile."
  }
]
