[
  {
    "abilityName": "Ami Ami no Mi",
    "englishName": "Net-Net Fruit",
    "japaneseName": "アミアミの実",
    "type": "DEVIL_FRUIT",
    "category": "PARAMECIA",
    "debutEpisode": 428,
    "debutChapter": null,
    "episodeAppearances": [428],
    "currentUser": {
      "characterId": "largo",
      "episodeConsumed": null
    },
    "formerUsers": [],
    "description": "A Paramecia-type Devil Fruit that allows the user to produce nets from their body. The nets are sticky with high tensile strength and have a claimed '120% success rate' for capturing anything.",
    "techniques": [
      {
        "techniqueName": "Basic Net Creation",
        "description": "Creates sticky nets from the user's body with high tensile strength, capable of trapping powerful opponents.",
        "episodeFirstUsed": 428,
        "userCharacterId": "largo"
      },
      {
        "techniqueName": "Material-Enhanced Nets",
        "description": "By ingesting various materials (metal, fire, boiling water), the user can create nets with those materials' properties, enabling specialized attacks like iron nets, flaming nets, or boiling nets.",
        "episodeFirstUsed": 428,
        "userCharacterId": "largo"
      },
      {
        "techniqueName": "Net Body Transformation",
        "description": "The user can transform their entire body into netting, dispersing the force of physical blows across the net surface, similar to Logia-type intangibility but specific to physical attacks.",
        "episodeFirstUsed": 428,
        "userCharacterId": "largo"
      }
    ],
    "awakening": null,
    "weaknesses": [
      "Standard Devil Fruit weaknesses (seawater, Sea-Prism Stone)",
      "User is not immune to the properties of materials they ingest (hot substances still burn their mouth)",
      "Fire can destroy the nets, as demonstrated by Boss's fire breath"
    ],
    "strengths": [
      "Versatile capture abilities with high success rate",
      "Can adapt nets to different situations through material absorption",
      "Body transformation provides defense against physical attacks",
      "Nets have high tensile strength and sticky properties"
    ],
    "trivia": [
      "This is an anime-only Devil Fruit that never appears in the manga",
      "Created specifically for the Little East Blue arc to promote One Piece Film: Strong World",
      "One of the few Devil Fruits shown to have material absorption capabilities"
    ]
  },
  {
    "abilityName": "Fire Breathing",
    "englishName": "Fire Breathing",
    "japaneseName": null,
    "type": "NATURAL_ABILITY",
    "category": "BIOLOGICAL",
    "debutEpisode": 428,
    "debutChapter": null,
    "episodeAppearances": [428],
    "currentUser": {
      "characterId": "boss",
      "episodeObtained": null
    },
    "formerUsers": [],
    "description": "Boss can emit fire from his horn, powerful enough to burn through Devil Fruit-created nets. This ability is particularly effective after molting when his power increases.",
    "techniques": [
      {
        "techniqueName": "Horn Fire Emission",
        "description": "Emits fire from the horn to attack enemies or destroy obstacles like nets.",
        "episodeFirstUsed": 428,
        "userCharacterId": "boss"
      }
    ],
    "awakening": null,
    "weaknesses": [
      "Using fire breathing after premature molting causes severe exhaustion",
      "Requires significant energy expenditure"
    ],
    "strengths": [
      "Effective against net-based abilities",
      "Can be used defensively to free allies",
      "Power increases after molting"
    ],
    "trivia": [
      "First demonstrated to save the Straw Hats from Largo's nets",
      "Boss's fire breath is strong enough to counter Devil Fruit abilities"
    ]
  },
  {
    "abilityName": "Molting Transformation",
    "englishName": "Molting Transformation",
    "japaneseName": null,
    "type": "NATURAL_ABILITY",
    "category": "BIOLOGICAL",
    "debutEpisode": 428,
    "debutChapter": null,
    "episodeAppearances": [428],
    "currentUser": {
      "characterId": "boss",
      "episodeObtained": null
    },
    "formerUsers": [],
    "description": "Boss can shed his shell and undergo a transformation, gaining increased size, power, and new coloration. Normally occurs monthly, but can happen prematurely under extreme stress or emotion, though this causes severe weakness afterward.",
    "techniques": [
      {
        "techniqueName": "Monthly Molting",
        "description": "Regular transformation that occurs once per month, increasing Boss's size and power permanently.",
        "episodeFirstUsed": null,
        "userCharacterId": "boss"
      },
      {
        "techniqueName": "Premature Molting",
        "description": "Emergency transformation triggered by stress or strong emotions. Provides temporary power boost but causes severe exhaustion and weakness afterward.",
        "episodeFirstUsed": 428,
        "userCharacterId": "boss"
      }
    ],
    "awakening": null,
    "weaknesses": [
      "Premature molting causes severe weakness and collapse",
      "Leaves Boss vulnerable during and after the transformation",
      "Body needs time to adapt to new form"
    ],
    "strengths": [
      "Significantly increases size and power",
      "Changes coloration and enhances physical features",
      "Can be triggered in emergencies for temporary power boost",
      "Each molt increases Boss's baseline power permanently"
    ],
    "trivia": [
      "Boss transformed from brown to teal coloring in Episode 428",
      "The Marine insignia painted by Yoko mysteriously remains through molting",
      "Boss molts once per month under normal circumstances"
    ]
  }
]
