[
  {
    "id": "theory-ep365-001",
    "title": "Shadow Memory Inconsistency: Why Didn't Luffy Remember Oars' Actions?",
    "summary": "A theory questioning why Luffy didn't retain memories of Oars' actions when his shadow was returned, unlike Lola who remembered her zombie's experiences as 'Namizo'.",
    "fullText": "When Lola received her shadow back from her warthog zombie counterpart, she identified Nami as 'Namizo' - the male alias the navigator gave when introducing herself. This implies that the memories a shadow receives are reciprocated back to their original hosts once the two are reunited. However, this phenomenon was not observed in any members of the Straw Hat pirates, including Sanji, Zoro, and most relevantly Luffy (given his tenure as Oars). This raises questions about whether Moria's shadow manipulation works differently for different zombies, or if there's a power scaling element where stronger shadows don't transfer memories, or if this is simply an oversight in the story's internal logic.",
    "author": "CBR Editorial Analysis",
    "source": {
      "url": "https://www.cbr.com/one-piece-thriller-bark-arc-no-sense/",
      "title": "One Piece: 10 Things That Made No Sense About The Thriller Bark Arc",
      "platform": "CBR",
      "accessedAt": "2025-11-27"
    },
    "postedDate": "2023-05-15",
    "episodeRange": [345, 372],
    "minEpisode": 345,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 372
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": ["luffy", "oars", "gecko-moria", "lola"],
    "relatedLocations": ["thriller-bark"],
    "relatedEvents": ["ep365-event-001", "ep365-event-009"],
    "tags": ["shadow-mechanics", "plot-inconsistency", "thriller-bark", "kage-kage-no-mi"]
  },
  {
    "id": "theory-ep365-002",
    "title": "Oars as Foreshadowing for Luffy's Giant Transformation Potential",
    "summary": "A theory that Oars having Luffy's shadow foreshadows future developments where Luffy might gain giant-like abilities or transformations.",
    "fullText": "The visual of seeing Luffy's techniques performed at giant scale through Oars may be intentional foreshadowing by Oda. Throughout One Piece, there have been hints at Luffy's potential to grow or transform (Gear Third's enlargement, future Gear forms). Oars demonstrates what Luffy's fighting style would look like at massive scale, potentially previewing abilities Luffy might develop. The fact that Oda chose to give Oars specifically Luffy's shadow rather than another strong fighter's shadow could be meaningful - showing readers the potential of Luffy's techniques when applied at different scales.",
    "author": "Fan Community Discussion",
    "source": {
      "url": "https://www.opfanpage.com/thrillerbark-symbolism-analysis/",
      "title": "Thriller Bark Symbolism - Analysis - One Piece",
      "platform": "OP Fan Page",
      "accessedAt": "2025-11-27"
    },
    "postedDate": "2020-08-10",
    "episodeRange": [365, 1000],
    "minEpisode": 365,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1000
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": ["luffy", "oars"],
    "relatedLocations": ["thriller-bark"],
    "relatedEvents": ["ep365-event-009"],
    "tags": ["foreshadowing", "luffy-powers", "gear-forms", "symbolism"]
  },
  {
    "id": "theory-ep365-003",
    "title": "Oars' Personality Retention Shows Strength of Luffy's Will",
    "summary": "A theory that Oars retaining some of Luffy's personality traits (wanting to be Pirate King, demanding food) despite Moria's control demonstrates the exceptional strength of Luffy's will.",
    "fullText": "When Oars first awakened, he exhibited several of Luffy's personality traits - declaring he would become Pirate King, demanding food, and showing Luffy's characteristic stubbornness. While Moria eventually gained full control, the fact that Luffy's shadow initially caused the zombie to act independently suggests that Luffy's will and spirit are so strong they can partially override even Gecko Moria's shadow manipulation abilities. This could be an early indication of Luffy's exceptional willpower and haki potential, themes that become more prominent later in the series. The gradual shift from Luffy's personality to Moria's control might represent the battle between Luffy's indomitable spirit and Moria's Devil Fruit powers.",
    "author": "Thriller Bark Analysis Community",
    "source": {
      "url": "https://www.opfanpage.com/thrillerbark-symbolism-analysis/",
      "title": "Thriller Bark Symbolism - Analysis - One Piece",
      "platform": "OP Fan Page",
      "accessedAt": "2025-11-27"
    },
    "postedDate": "2020-08-10",
    "episodeRange": [362, 372],
    "minEpisode": 362,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 372
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": ["luffy", "oars", "gecko-moria"],
    "relatedLocations": ["thriller-bark"],
    "relatedEvents": ["ep365-event-001"],
    "tags": ["willpower", "haki-foreshadowing", "character-analysis", "shadow-mechanics"]
  }
]
