[
  {
    "name": {
      "english": "Golden Bell",
      "japanese": "黄金の鐘",
      "romanized": "Ōgon no Kane"
    },
    "type": "LANDMARK",
    "debutEpisode": 163,
    "episodeAppearances": [193],
    "keyEvents": [
      {
        "episodeNumber": 193,
        "eventId": "ep193-event-001",
        "title": "Luffy's Final Blow Strikes the Golden Bell",
        "description": "Luffy's final attack causes the golden ball to strike the Golden Bell, making it ring for the first time in 400 years.",
        "significance": "Fulfills the 400-year-old promise and marks the end of the war.",
        "timestamp": "02:15"
      },
      {
        "episodeNumber": 193,
        "eventId": "ep193-event-002",
        "title": "The Golden Bell Rings for the First Time in 400 Years",
        "description": "The Golden Bell rings with a magnificent sound that reverberates throughout Sky Island and reaches Jaya below.",
        "significance": "One of the most significant moments in the Skypiea arc, representing the resolution of the 400-year conflict.",
        "timestamp": "03:45"
      }
    ],
    "description": "The legendary Golden Bell of Shandora, silent for 400 years since the island was knocked into the sky. Its ringing represents the fulfillment of Calgara's promise to Noland.",
    "geography": "Located at the highest point of Upper Yard, attached to a massive beanstalk",
    "culturalSignificance": "Symbol of the promise between Calgara and Noland, and a beacon to guide Noland's return that became a symbol of truth and history for the Shandians",
    "firstMentionedEpisode": 146,
    "statusHistory": [
      {
        "status": "Silent for 400 years",
        "episodeStart": 163,
        "episodeEnd": 192
      },
      {
        "status": "Ringing",
        "episodeStart": 193,
        "episodeEnd": 193
      }
    ]
  },
  {
    "name": {
      "english": "Upper Yard",
      "japanese": "アッパーヤード",
      "romanized": "Appā Yādo"
    },
    "type": "ISLAND",
    "debutEpisode": 153,
    "episodeAppearances": [193],
    "keyEvents": [
      {
        "episodeNumber": 193,
        "eventId": "ep193-event-006",
        "title": "The 400-Year War Ends: Skypieans and Shandians Celebrate Together",
        "description": "The Skypieans and Shandians come together in celebration and peace on Upper Yard, lighting a massive bonfire together.",
        "significance": "The ultimate resolution of the Skypiea arc's central conflict, ending the 400-year war.",
        "timestamp": "10:15"
      },
      {
        "episodeNumber": 193,
        "eventId": "ep193-event-010",
        "title": "Skypieans Experience Earth for the First Time",
        "description": "Skypieans explore Upper Yard and touch real earth (Vearth) for the first time in their lives.",
        "significance": "Shows the newfound access and wonder that peace has brought to both peoples.",
        "timestamp": "18:30"
      }
    ],
    "description": "The Upper Yard, originally the island of Jaya before being knocked into the sky 400 years ago. Contains the lost city of Shandora and real earth (Vearth), which is precious to Sky Island inhabitants.",
    "geography": "A large landmass in the White-White Sea containing ancient ruins, the Golden Bell, and the remains of Shandora",
    "culturalSignificance": "The ancestral homeland of the Shandians and the prize of the 400-year war with the Skypieans",
    "statusHistory": [
      {
        "status": "Controlled by Enel",
        "episodeStart": 153,
        "episodeEnd": 192
      },
      {
        "status": "Shared peacefully by Skypieans and Shandians",
        "episodeStart": 193,
        "episodeEnd": "present"
      }
    ]
  },
  {
    "name": {
      "english": "Jaya",
      "japanese": "ジャヤ",
      "romanized": "Jaya"
    },
    "type": "ISLAND",
    "debutEpisode": 143,
    "episodeAppearances": [193],
    "keyEvents": [
      {
        "episodeNumber": 193,
        "eventId": "ep193-event-003",
        "title": "Cricket and the Saruyama Alliance Hear the Bell",
        "description": "Mont Blanc Cricket and the Saruyama Brothers hear the sound of the Golden Bell ringing from the sky, proving the City of Gold exists.",
        "significance": "Provides emotional closure to Cricket's storyline and vindicates Noland's story.",
        "timestamp": "05:30"
      },
      {
        "episodeNumber": 193,
        "eventId": "ep193-event-004",
        "title": "Luffy's Shadow Appears on the Clouds",
        "description": "Cricket and the Saruyama Alliance witness Luffy's triumphant shadow projected on the clouds above Jaya.",
        "significance": "Confirms the Straw Hats' safety and success to their allies below.",
        "timestamp": "06:45"
      }
    ],
    "description": "An island in the Grand Line, the other half of the landmass that was knocked into the sky 400 years ago. Home to Mont Blanc Cricket and the Saruyama Alliance.",
    "geography": "A skull-shaped island in Paradise (the first half of the Grand Line)",
    "culturalSignificance": "Site of Noland's original discovery of the City of Gold before it was knocked into the sky"
  },
  {
    "name": {
      "english": "Ark Maxim",
      "japanese": "方舟マクシム",
      "romanized": "Hakobune Makushimu"
    },
    "type": "SHIP",
    "debutEpisode": 167,
    "episodeAppearances": [193],
    "keyEvents": [
      {
        "episodeNumber": 193,
        "eventId": "ep193-event-008",
        "title": "Enel Departs for the Moon on Ark Maxim",
        "description": "Enel restarts the Ark Maxim using his lightning powers and departs Sky Island, heading toward the moon which he calls 'Fairy Vearth.'",
        "significance": "Sets up Enel's future story arc and introduces the mystery of the moon in One Piece lore.",
        "timestamp": "14:00"
      }
    ],
    "description": "Enel's massive flying ship powered by electricity. Designed to travel to 'Fairy Vearth' (the moon).",
    "geography": "A golden ark capable of flight through space",
    "culturalSignificance": "Represents Enel's twisted dreams and serves as his vehicle to the moon",
    "statusHistory": [
      {
        "status": "On Sky Island",
        "episodeStart": 167,
        "episodeEnd": 192
      },
      {
        "status": "Departing for the moon",
        "episodeStart": 193,
        "episodeEnd": 193
      }
    ]
  },
  {
    "name": {
      "english": "Fairy Vearth",
      "japanese": "フェアリーヴァース",
      "romanized": "Fearī Vāsu",
      "aliases": ["The Moon", "Endless Vearth"]
    },
    "type": "CELESTIAL_BODY",
    "debutEpisode": 193,
    "episodeAppearances": [193],
    "keyEvents": [
      {
        "episodeNumber": 193,
        "eventId": "ep193-event-008",
        "title": "Revealed as Enel's Destination",
        "description": "Enel departs Sky Island on the Ark Maxim heading toward 'Fairy Vearth,' which is revealed to be the moon.",
        "significance": "Introduces the moon as a significant location in One Piece lore and sets up Enel's cover story.",
        "timestamp": "14:00"
      }
    ],
    "description": "The moon, which Enel refers to as 'Fairy Vearth' or the 'Endless Vearth.' Enel believes it to be a paradise with infinite earth.",
    "geography": "Earth's moon, visible from Sky Island and the Blue Sea",
    "culturalSignificance": "Destination of Enel's ambitions and site of ancient civilizations connected to Sky Island's peoples",
    "firstMentionedEpisode": 167
  },
  {
    "name": {
      "english": "Angel Island",
      "japanese": "エンジェル島",
      "romanized": "Enjeru-tō"
    },
    "type": "ISLAND",
    "debutEpisode": 153,
    "episodeAppearances": [193],
    "keyEvents": [
      {
        "episodeNumber": 193,
        "eventId": "ep193-event-005",
        "title": "Pagaya Reunites with Conis",
        "description": "Pagaya, believed to have been killed, reunites with his daughter Conis on Angel Island after surviving in the White Sea.",
        "significance": "Represents hope and the restoration of families after Enel's defeat.",
        "timestamp": "08:20"
      }
    ],
    "description": "One of the main inhabited islands of Sky Island, home to the Skypieans including Conis and Pagaya.",
    "geography": "Located in the White-White Sea at 10,000 meters above sea level",
    "culturalSignificance": "Main residential area for Skypieans who were ruled by Enel"
  },
  {
    "name": {
      "english": "White Sea",
      "japanese": "白海",
      "romanized": "Haku-kai"
    },
    "type": "SEA",
    "debutEpisode": 144,
    "episodeAppearances": [193],
    "keyEvents": [
      {
        "episodeNumber": 193,
        "eventId": "ep193-event-005",
        "title": "Revealed as Pagaya's Survival Location",
        "description": "Pagaya explains that he was blown into the White Sea by Enel's lightning attack and survived there.",
        "significance": "Explains how Pagaya survived what appeared to be a fatal attack.",
        "timestamp": "08:20"
      }
    ],
    "description": "The lower cloud sea at 7,000 meters above sea level, below the White-White Sea where Sky Island is located.",
    "geography": "A sea of clouds at 7,000 meters altitude",
    "culturalSignificance": "The first layer of sky sea that visitors encounter when traveling to Sky Island"
  }
]
