[
  {
    "id": "theory-ep420-001",
    "title": "Tequila Wolf's Connection to Rising Sea Levels",
    "theoryText": "The 700-year construction of Tequila Wolf and similar bridges (Vodka Wolf, Rum Wolf, Bourbon Wolf) was theorized to be preparation for a catastrophic flood that would sink most islands in the One Piece world. Fans speculated that the World Government knew about impending rising sea levels and was building elevated pathways to connect islands once the world flooded. This theory was confirmed in Chapter 1125 when Ivankov revealed that Vegapunk's message about the Great Flood explained the true purpose of these bridges.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://gamerant.com/one-piece-oda-finally-reveals-reason-behind-creation-tequila-wolf/",
      "platform": "Reddit/Forums/GameRant",
      "publishDate": "2009-2024"
    },
    "episodesSpanned": [420, 421],
    "minEpisodeDiscussed": 420,
    "maxEpisodeSpoiled": 1122,
    "status": "CONFIRMED",
    "statusNote": "Confirmed in Chapter 1125 - The bridges were indeed built to prepare for rising sea levels and the eventual sinking of the world.",
    "popularity": {
      "upvotes": null,
      "discussionCount": null
    },
    "tags": ["tequila-wolf", "world-government", "vegapunk", "void-century", "confirmed-theory"]
  },
  {
    "id": "theory-ep420-002",
    "title": "Tequila Wolf as a Void Century Remnant",
    "theoryText": "Before the true purpose was revealed, some fans theorized that Tequila Wolf might contain or hide information about the Void Century, possibly a Poneglyph or ancient ruins beneath the bridge structure. The theory suggested that the World Government was using slave labor not just to build the bridge, but to search for or hide Void Century artifacts. While the bridge's connection to ancient knowledge was partially correct (relating to the Ancient Kingdom's flood knowledge), no Poneglyphs have been found there.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Talk:Tequila_Wolf",
      "platform": "Fandom/Reddit",
      "publishDate": "2009-2015"
    },
    "episodesSpanned": [420, 421],
    "minEpisodeDiscussed": 420,
    "maxEpisodeSpoiled": 800,
    "status": "PARTIALLY_DISPROVEN",
    "statusNote": "No Poneglyphs found at Tequila Wolf, but the bridge does connect to Void Century knowledge about the Great Flood.",
    "popularity": {
      "upvotes": null,
      "discussionCount": null
    },
    "tags": ["tequila-wolf", "void-century", "poneglyphs", "partially-disproven"]
  },
  {
    "id": "theory-ep420-003",
    "title": "Robin's Separation Leads to Revolutionary Army Alliance",
    "theoryText": "When Robin was shown enslaved on Tequila Wolf in Episode 420, fans immediately theorized that this would lead to her meeting the Revolutionary Army, given their opposition to the World Government and the slave system. Fans predicted that Robin would be rescued by revolutionaries led by Luffy's father Dragon, and this experience would give her valuable intelligence and potential allies for the Straw Hats' eventual conflict with the World Government. This theory was confirmed when the Revolutionary Army freed the slaves at Tequila Wolf.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_420",
      "platform": "Forums/Reddit",
      "publishDate": "2009-2010"
    },
    "episodesSpanned": [420, 421],
    "minEpisodeDiscussed": 420,
    "maxEpisodeSpoiled": 505,
    "status": "CONFIRMED",
    "statusNote": "Robin was indeed rescued by the Revolutionary Army, meeting Dragon and forming an alliance.",
    "popularity": {
      "upvotes": null,
      "discussionCount": null
    },
    "tags": ["robin", "revolutionary-army", "dragon", "tequila-wolf", "confirmed-theory"]
  },
  {
    "id": "theory-ep420-004",
    "title": "Usopp's Boin Archipelago Training Will Transform His Fighting Style",
    "theoryText": "After Episode 420 showed Usopp on the Boin Archipelago with its dangerous man-eating plants and Pop Greens, fans theorized that Usopp would learn to weaponize these unique plants for combat. The theory suggested that Heracles would train Usopp to use Pop Green seeds as ammunition, giving him a nature-based arsenal that would make him significantly more powerful. This was confirmed during the timeskip when Usopp mastered Pop Green techniques and made them his primary fighting style post-timeskip.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://www.cbr.com/one-piece-usopp-pop-greens/",
      "platform": "Forums/Reddit/CBR",
      "publishDate": "2009-2010"
    },
    "episodesSpanned": [420, 517, 518],
    "minEpisodeDiscussed": 420,
    "maxEpisodeSpoiled": 520,
    "status": "CONFIRMED",
    "statusNote": "Usopp indeed trained with Heracles and mastered Pop Greens, making them his signature post-timeskip ability.",
    "popularity": {
      "upvotes": null,
      "discussionCount": null
    },
    "tags": ["usopp", "boin-archipelago", "pop-greens", "heracles", "timeskip", "confirmed-theory"]
  },
  {
    "id": "theory-ep420-005",
    "title": "The Stomach Baron as Ancient Biological Weapons",
    "theoryText": "Some fans theorized that the Stomach Baron carnivorous plant islands of the Boin Archipelago might be remnants of ancient biological engineering, possibly created during the Void Century as weapons or food sources. The theory suggested these massive living islands could be connected to the advanced technology of the Ancient Kingdom. However, this remains unconfirmed, with the Stomach Baron appearing to be natural organisms rather than engineered creations.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Stomach_Baron",
      "platform": "Forums/Wikia",
      "publishDate": "2010-2015"
    },
    "episodesSpanned": [420],
    "minEpisodeDiscussed": 420,
    "maxEpisodeSpoiled": 600,
    "status": "UNCONFIRMED",
    "statusNote": "No evidence has been provided that the Stomach Baron are anything other than natural carnivorous plants.",
    "popularity": {
      "upvotes": null,
      "discussionCount": null
    },
    "tags": ["boin-archipelago", "stomach-baron", "ancient-kingdom", "unconfirmed"]
  },
  {
    "id": "theory-ep420-006",
    "title": "Each Straw Hat's Separation Location Matches Their Character Development Needs",
    "theoryText": "Fans theorized that Bartholomew Kuma didn't randomly send the Straw Hats to different locations, but strategically chose places where each member could grow stronger in ways specific to their weaknesses. Robin, who needed to understand the Revolutionary Army's fight against oppression, was sent to Tequila Wolf. Usopp, who needed to become a braver warrior, was sent to a dangerous survival environment with a mentor. This theory suggests Kuma knew about the two-year timeskip that would occur and deliberately set up each Straw Hat for optimal training.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://neverwatchedonepiece.tumblr.com/post/138359571214/418-421-the-friends-whereabouts-the-science",
      "platform": "Reddit/Forums/Tumblr",
      "publishDate": "2009-2011"
    },
    "episodesSpanned": [405, 418, 419, 420, 421],
    "minEpisodeDiscussed": 405,
    "maxEpisodeSpoiled": 520,
    "status": "HEAVILY_IMPLIED",
    "statusNote": "While never explicitly confirmed, the perfect match between each location and each Straw Hat's growth needs suggests Kuma had knowledge and intention behind his actions.",
    "popularity": {
      "upvotes": null,
      "discussionCount": null
    },
    "tags": ["bartholomew-kuma", "straw-hats-separation", "character-development", "timeskip", "heavily-implied"]
  }
]
