[
  {
    "name": {
      "japanese": "オリオリの実",
      "romanized": "Ori Ori no Mi",
      "english": "Bind-Bind Fruit",
      "aliases": ["Cage-Cage Fruit"]
    },
    "type": "PARAMECIA",
    "debutEpisode": 130,
    "debutChapter": 217,
    "episodeAppearances": [130],
    "currentUser": "hina",
    "previousUsers": [],
    "description": "A Paramecia-type Devil Fruit that allows the user to bind their foes in iron shackles created by the user's body.",
    "abilities": [
      {
        "name": "Body Pass-Through Binding",
        "description": "The user can let others pass through their body, in the process getting them encaged in a ring of iron.",
        "episodeFirstUsed": 130,
        "type": "OFFENSIVE"
      },
      {
        "name": "Body Transformation Restraint",
        "description": "When the user makes contact with something they intend to bind, their body will bend in an unnatural manner and transform into a giant restraining metal cuff around the spot contact was made.",
        "episodeFirstUsed": 130,
        "type": "OFFENSIVE"
      },
      {
        "name": "Extended Metal Bars",
        "description": "The user can generate flexible metal bars that behave like their body, bending around and restraining anything in their way. This method grants more range and can capture multiple people at once.",
        "episodeFirstUsed": 130,
        "type": "OFFENSIVE"
      }
    ],
    "strengths": [
      "Can bind and restrain multiple opponents simultaneously",
      "Creates iron-like constructs that are extremely difficult to break",
      "Grants extended range through metal bar generation",
      "Effective for capturing enemies alive"
    ],
    "weaknesses": [
      "Standard Devil Fruit weaknesses (sea water, Seastone)",
      "Unknown if the iron restraints can be broken by sufficiently strong opponents"
    ],
    "awakeningStatus": "UNKNOWN",
    "awakeningEpisode": null,
    "userHistory": [
      {
        "userId": "hina",
        "episodeGained": 130,
        "episodeLost": null,
        "methodGained": "CONSUMED",
        "methodLost": null
      }
    ],
    "trivia": [
      "The name 'Ori' means 'cage' in Japanese",
      "Hina's mastery with this fruit earned her the epithet 'Black Cage Hina'",
      "No character has been shown escaping the restraints, suggesting they may be unbreakable"
    ]
  }
]
