[
  {
    "id": "theory-ep256-001",
    "title": "Franky Memorized the Pluton Blueprints Before Burning Them",
    "summary": "A popular theory suggests that Franky, being a genius shipwright, memorized the Pluton blueprints during the years he held them before burning them at Enies Lobby.",
    "fullText": "Despite burning the Pluton blueprints at Enies Lobby, many fans theorize that Franky, as a master shipwright, would have studied and memorized the designs during the time he possessed them. Given his fascination with shipbuilding and his genius-level intellect, it's highly unlikely he didn't examine the blueprints thoroughly. This theory suggests that Franky could potentially rebuild Pluton or incorporate its design elements into the Thousand Sunny in the final saga. The flashback in episode 256, where Iceburg entrusts the blueprints to Franky, is seen as the beginning of this potential plot thread.",
    "author": "Multiple One Piece fans and theorists",
    "source": {
      "url": "https://gamerant.com/one-piece-pluton-franky-theory/",
      "title": "One Piece: This Franky Theory Will Blow Your Mind",
      "platform": "GameRant",
      "accessedAt": "2025-11-18"
    },
    "postedDate": null,
    "episodeRange": [256, 1100],
    "minEpisode": 256,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": ["franky", "iceburg"],
    "relatedLocations": ["water-7"],
    "relatedEvents": ["ep256-event-007"],
    "tags": ["pluton", "ancient-weapons", "franky", "blueprints", "final-saga"]
  },
  {
    "id": "theory-ep256-002",
    "title": "Iceburg Also Memorized the Pluton Blueprints",
    "summary": "Similar to the Franky theory, some fans believe that Iceburg also memorized the Pluton blueprints during the four years he held them after Tom's death.",
    "fullText": "Before giving the Pluton blueprints to Franky, Iceburg held them for four years following Tom's execution. As the mayor of Water 7 and a master shipwright himself, Iceburg likely studied the blueprints extensively during this time. This theory suggests that both of Tom's apprentices may have memorized the ancient weapon's design, creating redundancy in case one of them was captured or killed. The emotional scene in episode 256 where Iceburg entrusts the blueprints to Franky could be seen as Iceburg ensuring the knowledge survives through both of them, even if the physical blueprints are destroyed.",
    "author": "One Piece theory community",
    "source": {
      "url": "https://gamerant.com/one-piece-pluton-franky-theory/",
      "title": "One Piece: This Franky Theory Will Blow Your Mind",
      "platform": "GameRant",
      "accessedAt": "2025-11-18"
    },
    "postedDate": null,
    "episodeRange": [256, 1100],
    "minEpisode": 256,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": ["iceburg", "franky"],
    "relatedLocations": ["water-7"],
    "relatedEvents": ["ep256-event-007"],
    "tags": ["pluton", "ancient-weapons", "iceburg", "blueprints"]
  },
  {
    "id": "theory-ep256-003",
    "title": "Thousand Sunny Will Become the New Pluton",
    "summary": "A theory that Franky is secretly incorporating Pluton design elements into the Thousand Sunny, potentially transforming it into a new ancient weapon.",
    "fullText": "Some fans theorize that Franky, having memorized the Pluton blueprints, is gradually upgrading the Thousand Sunny with elements from the ancient weapon's design. The theory suggests that in the final war, Franky will reveal the Sunny's true form - either as a recreation of Pluton or as an entirely new ship that rivals the ancient weapon's power. This would explain why Franky was so meticulous in designing the Sunny and why it has already shown remarkable durability and features beyond normal ships. The flashback in episode 256 showing Franky receiving the blueprints is seen as foreshadowing this eventual payoff.",
    "author": "One Piece theory community",
    "source": {
      "url": "https://fandomwire.com/let-eiichiro-oda-cook-ancient-weapon-pluton-will-be-constructed-by-a-straw-hat-according-to-one-piece-theory/",
      "title": "Let Eiichiro Oda Cook: Ancient Weapon Pluton Will be Constructed by a Straw Hat",
      "platform": "FandomWire",
      "accessedAt": "2025-11-18"
    },
    "postedDate": null,
    "episodeRange": [256, 1100],
    "minEpisode": 256,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": ["franky"],
    "relatedLocations": ["water-7"],
    "relatedEvents": ["ep256-event-007"],
    "tags": ["pluton", "ancient-weapons", "thousand-sunny", "franky", "final-saga"]
  },
  {
    "id": "theory-ep256-004",
    "title": "Tom's Legacy: The True Purpose of Passing Down the Blueprints",
    "summary": "A theory about why Tom chose to pass the Pluton blueprints to his apprentices rather than destroying them.",
    "fullText": "This theory examines Tom's decision to entrust the Pluton blueprints to Iceburg and Franky instead of destroying them. Fans theorize that Tom foresaw a future where the ancient weapon would be needed to counter other ancient weapons or the World Government's tyranny. By giving the blueprints to his apprentices, Tom ensured that if Pluton (the original) ever fell into the wrong hands, there would be capable shipwrights who could build a counter-weapon. The emotional scene in episode 256 where Iceburg passes the blueprints to Franky while crying suggests he understands the heavy burden and responsibility Tom placed on them - not to build Pluton, but to preserve the option as humanity's last resort.",
    "author": "One Piece analysis community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Pluton",
      "title": "Pluton - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-11-18"
    },
    "postedDate": null,
    "episodeRange": [256, 1100],
    "minEpisode": 256,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": ["tom", "iceburg", "franky"],
    "relatedLocations": ["water-7"],
    "relatedEvents": ["ep256-event-007"],
    "tags": ["pluton", "ancient-weapons", "tom", "legacy", "world-government"]
  }
]
