[
  {
    "name": {
      "english": "Mole-Mole Fruit",
      "japanese": "モグモグの実",
      "romanized": "Mogu Mogu no Mi"
    },
    "type": "ZOAN",
    "debutEpisode": 113,
    "debutChapter": 183,
    "description": "A Zoan-type Devil Fruit that allows the user to transform into a mole or mole-human hybrid at will, granting them the ability to burrow underground and create extensive tunnel networks.",
    "episodeAppearances": [113],
    "users": [
      {
        "characterId": "miss-merry-christmas",
        "episodeStart": 113,
        "episodeEnd": "present",
        "circumstances": "Miss Merry Christmas (Drophy) is revealed to have eaten this fruit prior to the events of the Arabasta Arc"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Mole Transformation",
        "episodeRevealed": 113,
        "description": "User can transform into a full mole or mole-human hybrid, gaining the physical characteristics of a mole including powerful digging claws.",
        "severity": "MAJOR",
        "firstUseContext": "Miss Merry Christmas uses this form to create underground tunnels across the Alubarna battlefield"
      },
      {
        "abilityName": "Underground Tunneling",
        "episodeRevealed": 113,
        "description": "In mole form, the user can burrow underground extremely quickly, creating an extensive network of interconnected tunnels.",
        "severity": "MAJOR",
        "firstUseContext": "Miss Merry Christmas creates a tunnel system that allows her and Mr. 4 to control the battlefield and attack from unexpected angles"
      },
      {
        "abilityName": "Enhanced Digging Speed",
        "episodeRevealed": 113,
        "description": "User can move through dirt and soil as if swimming, allowing rapid underground travel and ambush tactics.",
        "severity": "MINOR",
        "firstUseContext": "Miss Merry Christmas uses this to drag Usopp underground and set up coordinated attacks with Mr. 4"
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim and vulnerability to seawater",
        "episodeRevealed": 113,
        "severity": "MAJOR"
      },
      {
        "weakness": "Tunnel network can be exploited against the user",
        "episodeRevealed": 114,
        "severity": "MINOR"
      }
    ],
    "strengths": [
      {
        "strength": "Complete battlefield control through underground tunnel network",
        "episodeRevealed": 113,
        "description": "The ability to create interconnected tunnels allows the user to attack from any direction and retreat instantly.",
        "severity": "MAJOR"
      },
      {
        "strength": "Powerful digging claws for close combat",
        "episodeRevealed": 113,
        "description": "The mole transformation grants sharp claws the size of bananas, useful for attacking enemies.",
        "severity": "MINOR"
      }
    ],
    "awakening": null,
    "rarity": "COMMON",
    "powerTier": "MEDIUM"
  },
  {
    "name": {
      "english": "Dog-Dog Fruit, Model: Dachshund",
      "japanese": "イヌイヌの実 モデル「ダックスフンド」",
      "romanized": "Inu Inu no Mi, Model: Dachshund"
    },
    "type": "ZOAN",
    "debutEpisode": 113,
    "debutChapter": 184,
    "description": "A Zoan-type Devil Fruit that allows the user to transform into a dachshund or dachshund-human hybrid. Remarkably, this fruit was consumed by an inanimate object (a gun named Lassoo) through technology developed by Vegapunk, making it the first such case shown in the series.",
    "episodeAppearances": [113],
    "users": [
      {
        "characterId": "lassoo",
        "episodeStart": 113,
        "episodeEnd": "present",
        "circumstances": "Lassoo, Mr. 4's gun, consumed this Devil Fruit through special technology, becoming a living gun-dog hybrid"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Dachshund Transformation",
        "episodeRevealed": 113,
        "description": "Lassoo can transform between gun form and dachshund form, combining the mobility of a living creature with the functionality of a firearm.",
        "severity": "MAJOR",
        "firstUseContext": "Lassoo is revealed as a living dog-gun that can move independently and coordinate with Mr. 4 in battle"
      },
      {
        "abilityName": "Explosive Baseball Projectiles",
        "episodeRevealed": 113,
        "description": "Lassoo fires baseball-shaped explosive projectiles that detonate on a timer, which Mr. 4 then hits with his bat to create deadly long-range attacks.",
        "severity": "MAJOR",
        "firstUseContext": "Lassoo coughs up explosive baseballs that Mr. 4 hits at Usopp and Chopper during their battle"
      },
      {
        "abilityName": "Animal Sentience",
        "episodeRevealed": 113,
        "description": "The Devil Fruit grants Lassoo animal-level intelligence and awareness, allowing it to respond to commands and coordinate attacks.",
        "severity": "MINOR",
        "firstUseContext": "Lassoo responds to Mr. 4's commands and positions itself for coordinated attacks"
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - vulnerability to seawater",
        "episodeRevealed": 113,
        "severity": "MAJOR"
      },
      {
        "weakness": "Dependent on Mr. 4 for optimal effectiveness",
        "episodeRevealed": 113,
        "severity": "MINOR"
      }
    ],
    "strengths": [
      {
        "strength": "Combines ranged weapon capabilities with living mobility",
        "episodeRevealed": 113,
        "description": "As a living weapon, Lassoo can move, aim, and fire independently while coordinating with its wielder.",
        "severity": "MAJOR"
      },
      {
        "strength": "Produces unlimited explosive ammunition",
        "episodeRevealed": 113,
        "description": "Lassoo can continuously generate explosive baseballs, providing endless ammunition for Mr. 4's attacks.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "MEDIUM"
  }
]
