[
  {
    "name": {
      "english": "Gum-Gum Fruit",
      "japanese": "ゴムゴムの実",
      "romanized": "Gomu Gomu no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 1,
    "debutChapter": 1,
    "description": "Grants the user's body the properties of rubber, allowing them to stretch and become immune to blunt attacks and electricity.",
    "episodeAppearances": [305],
    "users": [
      {
        "characterId": "luffy",
        "episodeStart": 1,
        "episodeEnd": "present",
        "circumstances": "Luffy accidentally ate the fruit as a child"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Gomu Gomu no Gigant Axe",
        "episodeRevealed": 305,
        "description": "A Gear Third technique where Luffy inflates his leg bone and brings it down in a devastating axe-kick attack.",
        "severity": "MAJOR",
        "firstUseContext": "Used against Rob Lucci during their battle on the Marine battleship, destroying part of the ship and knocking out Marines."
      },
      {
        "abilityName": "Gomu Gomu no Gigant Whip",
        "episodeRevealed": 305,
        "description": "A Gear Third technique where Luffy inflates his leg and swings it in a wide arc, creating a powerful whip-like attack.",
        "severity": "MAJOR",
        "firstUseContext": "Used to attack the masts of the Marine ship during the battle with Lucci, demonstrating Gear Third's versatility for wide-area attacks."
      }
    ],
    "weaknesses": [],
    "strengths": [],
    "awakening": null,
    "rarity": "COMMON",
    "powerTier": "HIGH"
  },
  {
    "name": {
      "english": "Cat-Cat Fruit, Model: Leopard",
      "japanese": "ネコネコの実 モデル:豹",
      "romanized": "Neko Neko no Mi, Moderu: Reoparudo"
    },
    "type": "ZOAN",
    "debutEpisode": 294,
    "debutChapter": 415,
    "description": "A Zoan-type Devil Fruit that allows the user to transform into a leopard and leopard-human hybrid. The fruit grants enhanced speed, strength, and predatory instincts, making it ideal for assassination and combat.",
    "episodeAppearances": [305],
    "users": [
      {
        "characterId": "rob-lucci",
        "episodeStart": 294,
        "episodeEnd": "present",
        "circumstances": "Lucci consumed the fruit at some point before joining CP9"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Rankyaku: Gaicho",
        "episodeRevealed": 305,
        "description": "A powerful Rokushiki technique where Lucci creates a massive bird-shaped compressed air blade using his claws in leopard form. The attack can cleave through battleship hulls.",
        "severity": "MAJOR",
        "firstUseContext": "Used against Luffy during their battle, cutting through the iron hull of a Marine battleship to demonstrate the synergy between his Zoan powers and Rokushiki techniques."
      }
    ],
    "weaknesses": [],
    "strengths": [
      {
        "strength": "Enhanced Rokushiki techniques when combined with Zoan form",
        "episodeRevealed": 305,
        "description": "The leopard form's claws allow for more powerful and precise Rokushiki attacks like Rankyaku: Gaicho.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "UNCOMMON",
    "powerTier": "HIGH"
  }
]
