[
  {
    "name": {
      "english": "Spa Island",
      "japanese": "スパアイランド",
      "romanized": "Supā Airando"
    },
    "debutEpisode": 382,
    "debutChapter": null,
    "episodeAppearances": [382],
    "locationType": "ISLAND",
    "region": "Paradise (Grand Line)",
    "parentLocation": null,
    "keyEvents": [
      {
        "episodeNumber": 382,
        "eventId": "ep382-event-001",
        "title": "Straw Hats Arrive at Spa Island",
        "description": "The Straw Hat Pirates arrive at the luxurious resort island for a vacation.",
        "significance": "Marks the beginning of the Spa Island Arc.",
        "timestamp": "02:00"
      },
      {
        "episodeNumber": 382,
        "eventId": "ep382-event-006",
        "title": "Foxy Pirates Arrive",
        "description": "The Foxy Pirates appear at Spa Island pursuing Lina and Sayo.",
        "significance": "Brings conflict to the vacation setting.",
        "timestamp": "12:30"
      },
      {
        "episodeNumber": 382,
        "eventId": "ep382-event-013",
        "title": "Battle with Foxy",
        "description": "Luffy defeats Foxy and his crew at the resort.",
        "significance": "Resolves the immediate threat but sets up the larger conflict with Doran.",
        "timestamp": "20:30"
      },
      {
        "episodeNumber": 382,
        "eventId": "ep382-event-015",
        "title": "Doran Abducts Sayo",
        "description": "The island's owner Doran reveals his true nature and kidnaps Sayo.",
        "significance": "Establishes the main conflict of the arc.",
        "timestamp": "22:30"
      }
    ],
    "description": "Spa Island is a luxurious artificial resort facility owned by Doran that generates 10 billion Berries annually. The island features comprehensive entertainment and relaxation amenities including spas, baths, pools, saunas, casinos, specialized themed baths (cola baths, milk baths), restaurants, and various water attractions. The island is recognized by the World Government as a legitimate business enterprise.",
    "inhabitants": ["Doran", "Resort Staff"],
    "significantFeatures": [
      "Multiple spa and bathing facilities with various themes",
      "Casino and gaming areas",
      "Water slides and aquatic attractions",
      "Rainbow Candy phenomenon - rare colorful candy that falls from the sky bringing luck",
      "Hidden research facility related to the gem-making formula",
      "Trap mechanisms in the floor that can drop people toward the ocean"
    ],
    "currentStatus": "ACTIVE",
    "statusHistory": [
      {
        "status": "ACTIVE",
        "episodeStart": 382,
        "episodeEnd": "present",
        "description": "Operating as a high-end resort under Doran's ownership"
      }
    ],
    "climate": "Temperate, resort-like",
    "trivia": [
      {
        "fact": "Spa Island generates 10 billion Berries annually, making it one of the most profitable establishments mentioned in One Piece filler content.",
        "category": "ECONOMICS"
      },
      {
        "fact": "The island features the Rainbow Candy phenomenon, where colorful candy falls from the sky and supposedly brings good luck to guests.",
        "category": "PHENOMENA"
      },
      {
        "fact": "Despite being a resort, the island contains hidden trap mechanisms that can drop intruders toward the ocean, suggesting Doran uses it for less legitimate purposes.",
        "category": "ARCHITECTURE"
      }
    ]
  }
]
