[
  {
    "name": {
      "english": "Bubble-Bubble Fruit",
      "japanese": "アワアワの実",
      "romanized": "Awa Awa no Mi"
    },
    "type": "Paramecia",
    "debutEpisode": 271,
    "debutChapter": 401,
    "episodeAppearances": [293],
    "currentUser": "kalifa",
    "formerUsers": [],
    "abilities": [
      {
        "abilityName": "Strength Draining Bubbles",
        "description": "Creates soap bubbles that can 'clean' away the strength and power from opponents, leaving them weakened and unable to fight effectively.",
        "episodeFirstShown": 293,
        "significance": "The core ability of the fruit that makes Kalifa a formidable opponent despite her lower physical combat abilities."
      },
      {
        "abilityName": "Bubble Master: Soap Sheep (Hitsuji Gumo)",
        "description": "Creates sheep-shaped bubbles that pursue and attack opponents while draining their strength on contact.",
        "episodeFirstShown": 293,
        "significance": "Demonstrates the versatility of the fruit in creating offensive bubble constructs."
      },
      {
        "abilityName": "Golden Awa (Golden Bubble)",
        "description": "Applies a smoothing effect that makes surfaces incredibly slippery, preventing opponents from standing, gripping, or maintaining balance.",
        "episodeFirstShown": 293,
        "significance": "Shows the fruit's ability to completely immobilize opponents without direct damage."
      },
      {
        "abilityName": "Soap Armor",
        "description": "Creates a large barrier of soap for defensive purposes, capable of blocking attacks like lightning.",
        "episodeFirstShown": 293,
        "significance": "Reveals the defensive applications of the fruit, making it both an offensive and defensive power."
      },
      {
        "abilityName": "Relax Hour (Hitsuji Gumo Relax Hour)",
        "description": "A relaxation-inducing bubble technique that affects opponents.",
        "episodeFirstShown": 293,
        "significance": "Another application of the bubble creation ability."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Water Vulnerability",
        "description": "The bubbles and their effects can be nullified if washed off with water.",
        "episodeRevealed": 296,
        "severity": "MAJOR"
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 293,
        "eventId": "ep293-event-005",
        "momentType": "POWER_REVEAL",
        "title": "Full Combat Demonstration",
        "description": "Kalifa demonstrates the full range of her Awa Awa no Mi abilities for the first time in battle against Nami.",
        "significance": "First comprehensive showcase of the fruit's offensive, defensive, and immobilizing capabilities.",
        "timestamp": "11:45"
      }
    ],
    "userHistory": [
      {
        "userId": "kalifa",
        "episodeObtained": null,
        "episodeLost": null,
        "obtainedBy": "Eaten",
        "lostBy": null
      }
    ],
    "trivia": [
      "The Awa Awa no Mi is considered one of the more creative Devil Fruits as it can 'clean' abstract concepts like strength and power, not just physical dirt.",
      "Kalifa received the Devil Fruit from Spandam after the events at Water 7, making her a relatively new user during the Enies Lobby arc."
    ]
  }
]
