[
  {
    "id": "theory-ep188-001",
    "title": "The Poneglyph Connection to Joy Boy",
    "theoryText": "The Poneglyph that Kalgara shows Noland in Episode 188 is not just any Poneglyph - it's directly connected to Joy Boy and the ancient promise made to the Fishmen. Some fans theorize that the Shandorians' ancestors were allied with Joy Boy 800 years ago, and the protection of the Poneglyph was part of that alliance. This would explain why they fought so hard to protect something they couldn't read.",
    "author": "Various One Piece Theory Creators",
    "platform": "Reddit/YouTube",
    "dateProposed": "2020-01-01",
    "episodesSpanned": [188, 189, 196],
    "spoilerStatus": true,
    "spoilerMaxEpisode": 1100,
    "popularity": {
      "upvotes": 5000,
      "discussions": 100
    },
    "evidence": [
      "The Shandorians protected the Poneglyph for generations despite not being able to read it",
      "The ancient city of Shandora existed during the Void Century",
      "Robin later discovers important historical information from this Poneglyph"
    ],
    "relatedCharacters": ["kalgara", "noland", "joy-boy"],
    "status": "PLAUSIBLE"
  },
  {
    "id": "theory-ep188-002",
    "title": "Tree Fever as Metaphor for Blind Faith",
    "theoryText": "Many fans interpret Tree Fever not just as a physical disease but as a metaphor for the dangers of blind faith and superstition. The 'fever' represents the harmful effects of following tradition without question. Noland's cure using Kona Tree bark (derived from the very trees deemed sacred) symbolizes how questioning tradition and using reason can solve problems that superstition only makes worse. Kalgara's willingness to let his daughter die represents the extreme danger of blind faith.",
    "author": "One Piece Analysis Community",
    "platform": "Forums/Blogs",
    "dateProposed": "2015-01-01",
    "episodesSpanned": [187, 188, 189],
    "spoilerStatus": false,
    "spoilerMaxEpisode": 189,
    "popularity": {
      "upvotes": 3000,
      "discussions": 50
    },
    "evidence": [
      "The disease comes from the sacred trees themselves",
      "The cure requires cutting down the sacred trees",
      "Kalgara was willing to let his daughter die due to religious beliefs",
      "The Priest's declaration that deaths were 'divine will' made the problem worse"
    ],
    "relatedCharacters": ["kalgara", "noland", "mousse"],
    "status": "THEMATIC_INTERPRETATION"
  },
  {
    "id": "theory-ep188-003",
    "title": "Kashigami Was Not Actually a God",
    "theoryText": "Some fans theorize that Kashigami was never actually a god, but rather a large python that the Shandians elevated to divine status. The earthquake that occurred when Noland first cut down trees was a natural phenomenon that coincidentally happened at that time, not divine punishment. This theory suggests the entire conflict was based on a misunderstanding of natural events, reinforcing One Piece's theme of how mythology and reality often diverge.",
    "author": "One Piece Skeptics Community",
    "platform": "Reddit",
    "dateProposed": "2016-01-01",
    "episodesSpanned": [187, 188],
    "spoilerStatus": false,
    "spoilerMaxEpisode": 188,
    "popularity": {
      "upvotes": 2000,
      "discussions": 30
    },
    "evidence": [
      "The python behaves like a normal animal, attacking when threatened",
      "No supernatural powers are displayed by Kashigami",
      "The earthquake's timing was coincidental",
      "Tree Fever has a scientific, not divine, cause"
    ],
    "relatedCharacters": ["kashigami", "kalgara", "noland"],
    "status": "PLAUSIBLE"
  },
  {
    "id": "theory-ep188-004",
    "title": "Noland's Descendants and the Will of D",
    "theoryText": "Given Noland's explorer nature, his pursuit of truth over convention, and his connection to the Poneglyphs, some fans theorize that Noland might have been connected to the Will of D or at least shared their ideals. His descendant Cricket continues this legacy by seeking the truth about the City of Gold. The theory suggests that Noland's execution for 'lying' parallels how other D bearers have been persecuted for knowing too much truth.",
    "author": "One Piece Lore Theorists",
    "platform": "YouTube/Reddit",
    "dateProposed": "2018-01-01",
    "episodesSpanned": [146, 188, 189],
    "spoilerStatus": true,
    "spoilerMaxEpisode": 1100,
    "popularity": {
      "upvotes": 4000,
      "discussions": 75
    },
    "evidence": [
      "Noland sought truth at any cost",
      "He discovered a Poneglyph",
      "He was executed by the government for his discoveries",
      "His descendant Cricket shares his drive to uncover truth"
    ],
    "relatedCharacters": ["noland", "cricket", "kalgara"],
    "status": "SPECULATIVE"
  },
  {
    "id": "theory-ep188-005",
    "title": "The Golden Bell's True Purpose",
    "theoryText": "Fans theorize that the Golden Bell wasn't just a cultural artifact but served a specific purpose in ancient times - possibly as a beacon or signal related to the Poneglyphs and the ancient kingdom. The fact that it could be heard across vast distances suggests it was meant to communicate something important. Some believe it was meant to signal when someone who could read the Poneglyph arrived, which is why Roger and his crew's visit was so significant.",
    "author": "Ancient History Theorists",
    "platform": "Reddit/Forums",
    "dateProposed": "2017-01-01",
    "episodesSpanned": [188, 189, 191],
    "spoilerStatus": true,
    "spoilerMaxEpisode": 1100,
    "popularity": {
      "upvotes": 6000,
      "discussions": 120
    },
    "evidence": [
      "The bell's sound could be heard across vast distances",
      "It's positioned next to the Poneglyph",
      "Roger left a message at the bell",
      "The Shandorians insisted on keeping the bell despite offering all other gold"
    ],
    "relatedCharacters": ["kalgara", "noland", "gol-d-roger"],
    "status": "PLAUSIBLE"
  }
]
