[
  {
    "id": "hie-hie-no-mi",
    "name": {
      "english": "Ice-Ice Fruit",
      "japanese": "ヒエヒエの実",
      "romanized": "Hie Hie no Mi"
    },
    "type": "LOGIA",
    "debutEpisode": 227,
    "debutChapter": 319,
    "description": "A Logia-type Devil Fruit that allows the user to create, control, and transform into ice at will, making them a Freezing Human. The user can freeze anything they touch and manipulate ice on a massive scale.",
    "episodeAppearances": [227],
    "users": [
      {
        "characterId": "aokiji",
        "episodeStart": 227,
        "episodeEnd": "present",
        "circumstances": "Aokiji consumed the fruit at an unknown time before becoming a Marine Admiral."
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Ice Age",
        "episodeRevealed": 227,
        "description": "The user places their hand in water and instantly freezes a massive area of ocean along with any creatures within it.",
        "severity": "CRITICAL",
        "firstUseContext": "Aokiji uses Ice Age to freeze the ocean to help stranded people cross to safety, also freezing a Sea King in the process."
      },
      {
        "abilityName": "Ice Saber",
        "episodeRevealed": 227,
        "description": "The user freezes grass, water vapor, or other materials to create a blade-like weapon made of ice.",
        "severity": "MAJOR",
        "firstUseContext": "Aokiji creates an Ice Saber by blowing on grass to freeze it, then attempts to attack Robin with it."
      },
      {
        "abilityName": "Ice Time",
        "episodeRevealed": 227,
        "description": "The user freezes their own body while in contact with a target, causing the target to freeze solid as well.",
        "severity": "CRITICAL",
        "firstUseContext": "Aokiji uses Ice Time to freeze Luffy's fist, Zoro's arm, and Sanji's leg simultaneously, then later uses it to completely freeze Robin."
      },
      {
        "abilityName": "Logia Intangibility",
        "episodeRevealed": 227,
        "description": "As a Logia user, Aokiji can transform into ice, allowing attacks to pass through him harmlessly and then reform.",
        "severity": "MAJOR",
        "firstUseContext": "When Robin uses Treinta Fleur: Clutch to shatter Aokiji's body, he breaks apart like ice and then reforms completely unharmed."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 227,
        "severity": "MAJOR"
      },
      {
        "weakness": "Ice can be melted by heat or magma-based attacks",
        "episodeRevealed": null,
        "severity": "MAJOR"
      },
      {
        "weakness": "As ice is solid, the user cannot dissolve as easily as other Logia types and reformation may be slower",
        "episodeRevealed": null,
        "severity": "MINOR"
      }
    ],
    "strengths": [
      {
        "strength": "Massive area-of-effect freezing ability",
        "episodeRevealed": 227,
        "description": "Can freeze entire sections of ocean, effectively neutralizing the Devil Fruit swimming weakness.",
        "severity": "CRITICAL"
      },
      {
        "strength": "Instant contact freezing",
        "episodeRevealed": 227,
        "description": "Anything that touches the user can be instantly frozen solid.",
        "severity": "MAJOR"
      },
      {
        "strength": "Logia-type intangibility",
        "episodeRevealed": 227,
        "description": "Physical attacks pass through the user's ice body harmlessly.",
        "severity": "MAJOR"
      },
      {
        "strength": "Weapon creation",
        "episodeRevealed": 227,
        "description": "Can create various weapons and constructs from ice.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "VERY_HIGH"
  }
]
