[
  {
    "id": "shandora-ruins",
    "name": {
      "english": "Shandora Ruins",
      "japanese": "シャンドラの遺跡",
      "romanized": "Shandora no Iseki"
    },
    "type": "ANCIENT_RUINS",
    "debutEpisode": 172,
    "episodeAppearances": [172],
    "description": "The ancient ruins of the lost golden city of Shandora, located in Upper Yard on Skypiea. The ruins contain monuments and structures with Mayan-inspired architecture that hold secrets to the True History and the Void Century.",
    "keyEvents": [
      {
        "episodeNumber": 172,
        "eventId": "ep172-event-009",
        "title": "Robin Discovers Shandora's Name",
        "description": "Nico Robin discovers a monument revealing the ancient city's name is Shandora.",
        "timestamp": "20:15",
        "significance": "First official revelation of the lost city's name to the audience and characters."
      },
      {
        "episodeNumber": 172,
        "eventId": "ep172-event-010",
        "title": "Robin Seeks True History Clues",
        "description": "Robin takes detailed notes on the ruins, hoping to find information about the True History.",
        "timestamp": "21:30",
        "significance": "Establishes the ruins' importance to understanding the Void Century and world history."
      },
      {
        "episodeNumber": 172,
        "eventId": "ep172-event-011",
        "title": "Yama Appears in the Ruins",
        "description": "Shandia warrior Yama confronts Robin in the ruins.",
        "timestamp": "22:45",
        "significance": "Introduces conflict over control of the sacred ruins."
      }
    ],
    "geography": {
      "region": "Upper Yard, Skypiea",
      "climate": "Sky Island climate",
      "terrain": "Ancient stone ruins with Mayan-inspired architecture"
    },
    "significance": "Shandora is a key location for understanding the True History and the Void Century. It contains important historical monuments and will later reveal a Poneglyph. The ruins represent the lost heritage of the Shandia people.",
    "culturalNotes": [
      "The architecture resembles real-world Mayan ruins",
      "The name 'Shandora' derives from the Sanskrit word 'Chandra' meaning moon",
      "The city is connected to the legend of El Dorado, a lost city of gold",
      "The ruins were once part of Jaya island before being launched into the sky 400 years ago"
    ],
    "images": []
  },
  {
    "id": "upper-yard",
    "name": {
      "english": "Upper Yard",
      "japanese": "アッパーヤード",
      "romanized": "Appā Yādo"
    },
    "type": "ISLAND",
    "episodeAppearances": [172],
    "description": "The sacred land of Skypiea, originally part of Jaya island that was blasted into the sky by the Knock Up Stream 400 years ago. Upper Yard contains the forests, ruins of Shandora, and Giant Jack beanstalk.",
    "keyEvents": [
      {
        "episodeNumber": 172,
        "eventId": "ep172-event-001",
        "title": "Chopper vs Gedatsu Battle",
        "description": "Chopper battles Gedatsu in the Ordeal of Swamp within Upper Yard.",
        "timestamp": "03:15",
        "significance": "Major battle location showcasing the dangerous trials of Upper Yard."
      },
      {
        "episodeNumber": 172,
        "eventId": "ep172-event-008",
        "title": "Gedatsu's Defeat",
        "description": "Gedatsu is defeated and falls into the swamp cloud in Upper Yard.",
        "timestamp": "18:50",
        "significance": "One of Enel's priests is eliminated from the conflict."
      },
      {
        "episodeNumber": 172,
        "eventId": "ep172-event-012",
        "title": "Aisa Attacked by Sky Shark",
        "description": "Aisa's boat stops working in Upper Yard and she is attacked by a Sky Shark before being rescued.",
        "timestamp": "10:30",
        "significance": "Shows the natural dangers present in Upper Yard beyond the priests."
      }
    ],
    "geography": {
      "region": "Skypiea",
      "climate": "Sky Island climate with cloud-based terrain",
      "terrain": "Forest, ruins, swamp clouds, and various trial grounds"
    },
    "significance": "Upper Yard is the central battleground of the Skypiea arc, where the Straw Hats must navigate various trials while uncovering the history of Shandora and confronting Enel's forces.",
    "culturalNotes": [
      "Sacred land fought over by Skypieans and Shandia for 400 years",
      "Contains valuable Vearth (earth/soil), which is extremely rare in the sky",
      "Home to the four trials created by Enel's priests",
      "Part of the original Jaya island that was split in two"
    ],
    "images": []
  }
]
