[
  {
    "name": {
      "english": "Tower of Justice",
      "japanese": "司法の塔",
      "romanized": "Shihō no Tō"
    },
    "debutEpisode": 278,
    "episodeAppearances": [285],
    "locationType": "BUILDING",
    "description": "A massive tower within Enies Lobby that serves as the World Government's judicial headquarters. Contains multiple floors with various rooms including libraries, bathhouses, gardens, kitchens, and dungeons.",
    "keyEvents": [
      {
        "episodeNumber": 285,
        "eventId": "ep285-event-001",
        "title": "Rocketman Crashes Into Tower",
        "description": "The Rocketman sea train crashes directly through the front wall of the Tower of Justice, creating a massive entrance for the Straw Hats and their allies.",
        "significance": "Marks the beginning of the climactic Tower of Justice battles during the Enies Lobby arc.",
        "timestamp": "03:45"
      },
      {
        "episodeNumber": 285,
        "eventId": "ep285-event-005",
        "title": "Battle Strategy Formation",
        "description": "The Straw Hats split up throughout the Tower to engage CP9 members in one-on-one battles to find the keys to Robin's handcuffs.",
        "significance": "Establishes the framework for all major CP9 vs Straw Hat confrontations.",
        "timestamp": "10:45"
      },
      {
        "episodeNumber": 285,
        "eventId": "ep285-event-014",
        "title": "Secret Passageway Discovery",
        "description": "Chimney discovers a hidden corridor within the Tower that leads toward the Gates of Justice, which Spandam used to escape with Robin.",
        "significance": "This secret passage will later prove crucial for Luffy's pursuit of Robin.",
        "timestamp": "22:30"
      }
    ],
    "geography": {
      "region": "Enies Lobby",
      "sea": "Paradise (First Half of Grand Line)",
      "climate": "Always daylight"
    },
    "significance": "The Tower of Justice is the central battlefield for the Enies Lobby arc, where each Straw Hat member faces off against CP9 agents in crucial one-on-one battles. It represents the heart of the World Government's judicial power.",
    "currentStatus": "ACTIVE",
    "images": []
  }
]
