[
  {
    "name": {
      "english": "Love-Love Fruit",
      "japanese": "メロメロの実",
      "romanized": "Mero Mero no Mi"
    },
    "debutEpisode": 411,
    "debutChapter": 516,
    "episodeAppearances": [417],
    "type": "PARAMECIA",
    "currentUser": "boa-hancock",
    "previousUsers": [],
    "abilities": [
      {
        "abilityName": "Petrification Reversal",
        "description": "The user can reverse the petrification effect at will, restoring victims to their normal state with no memory of being turned to stone.",
        "episodeFirstUsed": 417,
        "limitations": "Only the original user can reverse their own petrification effects. Even if someone else consumes the fruit later, they cannot undo Hancock's petrifications."
      },
      {
        "abilityName": "Mero Mero Mellow",
        "description": "The user fires a heart-shaped beam that turns anyone who feels lust toward them into stone.",
        "episodeFirstUsed": 411,
        "limitations": "Only works on those who feel attraction or lust toward the user. Those with pure hearts or no attraction are unaffected."
      },
      {
        "abilityName": "Slave Arrow",
        "description": "The user draws a large heart and fires multiple arrows that petrify on contact.",
        "episodeFirstUsed": 414,
        "limitations": "Requires the user to form the heart shape first."
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 417,
        "eventId": "ep417-event-006",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "Hancock Unfreezes the Marines",
        "description": "Hancock demonstrates her ability to reverse petrification by unfreezing all the Marines aboard Momonga's ship. The Marines have no memory of being frozen.",
        "significance": "Reveals an important aspect of the Mero Mero no Mi - that victims have no memory of being petrified and that the effect is completely reversible at the user's will.",
        "timestamp": "16:30"
      }
    ],
    "consumptionHistory": {
      "episodeConsumed": null,
      "consumedBy": "boa-hancock",
      "circumstances": "Force-fed by a World Noble during her enslavement",
      "episodeLost": null,
      "lostHow": null
    },
    "awakening": {
      "isAwakened": false,
      "awakeningEpisode": null,
      "awakeningAbilities": []
    },
    "description": "The Mero Mero no Mi is a Paramecia-type Devil Fruit that allows the user to turn anyone who feels lust or attraction toward them into stone. The user can also reverse the petrification at will, and victims have no memory of being frozen.",
    "strengths": [
      "Can petrify opponents instantly",
      "Works on multiple targets at once",
      "Reversible at will by the user",
      "Victims have no memory of petrification"
    ],
    "weaknesses": [
      "Does not affect those without lust or attraction to the user",
      "Standard Devil Fruit weaknesses (seawater, Seastone, Haki)",
      "Only the original user can reverse their petrifications"
    ]
  }
]
