[
  {
    "id": "theory-ep636-001",
    "title": "Bartolomeo as Bluejam's Son Theory",
    "summary": "An early theory speculated that Bartolomeo might be the son of Bluejam, the pirate captain from the Goa Kingdom arc, based on their connection to Loguetown and the East Blue.",
    "fullText": "When Bartolomeo was first introduced in the manga, some fans theorized he could be Bluejam's son due to both characters' connection to the East Blue and their ruthless personalities. The theory suggested that Bartolomeo's interest in the Corrida Colosseum and his mysterious connection to Luffy (hinted at in chapter 714) could stem from a family vendetta or connection to Luffy's past in the Goa Kingdom. However, this theory was debunked when chapter 720 revealed that Bartolomeo is actually a devoted Luffy fanboy who witnessed Luffy's near-execution in Loguetown and was inspired to become a pirate.",
    "author": "12Dimension Blog",
    "source": {
      "url": "https://12dimension.wordpress.com/2013/07/16/one-piece-bartolomeo-the-cannibal/",
      "title": "Theory: One Piece - Bartolomeo The Cannibal",
      "platform": "WordPress Blog",
      "accessedAt": "2026-01-15"
    },
    "postedDate": "2013-07-16",
    "episodeRange": [636, 720],
    "minEpisode": 636,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 720
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "DEBUNKED",
    "relatedCharacters": ["bartolomeo", "bluejam", "luffy"],
    "relatedLocations": ["loguetown", "goa-kingdom"],
    "relatedEvents": ["ep636-event-001"],
    "tags": ["bartolomeo", "origin", "family", "debunked"]
  },
  {
    "id": "theory-ep636-002",
    "title": "Cavendish's Split Personality Foreshadowing",
    "summary": "Fans theorized that Cavendish's obsession with fame and his exaggerated reactions in episode 636 were hints at his split personality (Hakuba) that would be revealed later.",
    "fullText": "When episode 636 aired, Cavendish's intense hatred of the Worst Generation and his theatrical behavior led some fans to theorize that he had psychological issues beyond simple jealousy. His knife-marked bounty posters and violent declarations seemed excessive even for a fame-obsessed pirate. These observations proved prescient when it was later revealed that Cavendish suffers from a split personality disorder, transforming into the murderous Hakuba when he falls asleep. The dramatic personality shifts and obsessive behavior shown in episode 636 were early hints at this condition.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Cavendish",
      "title": "Cavendish - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2026-01-15"
    },
    "postedDate": "2014-03-16",
    "episodeRange": [636, 645],
    "minEpisode": 636,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 645
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["cavendish"],
    "relatedLocations": ["corrida-colosseum"],
    "relatedEvents": ["ep636-event-003"],
    "tags": ["cavendish", "hakuba", "personality", "foreshadowing", "confirmed"]
  },
  {
    "id": "theory-ep636-003",
    "title": "Don Chinjao's Head Will Be Restored by Luffy",
    "summary": "After Don Chinjao revealed his flattened head and grudge against Garp in episode 636, fans immediately theorized that Luffy would restore Chinjao's head during their eventual battle.",
    "fullText": "When Don Chinjao explained that Garp flattened his drill-shaped head and that this prevented him from accessing his treasure, fans quickly theorized that Luffy would eventually restore Chinjao's head through combat. The theory suggested that Luffy's punch, similar to his grandfather's, would either re-flatten it (maintaining the grudge) or restore its drill shape (earning Chinjao's respect and gratitude). This theory was confirmed in episodes 646-647 when Luffy's King Kong Gun restored Chinjao's head to its original pointed shape, turning him from an enemy into an ally and allowing him to access his treasure again.",
    "author": "r/OnePiece Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Chinjao",
      "title": "Chinjao - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2026-01-15"
    },
    "postedDate": "2014-03-16",
    "episodeRange": [636, 647],
    "minEpisode": 636,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 647
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["chinjao", "luffy", "garp"],
    "relatedLocations": ["corrida-colosseum"],
    "relatedEvents": ["ep636-event-011"],
    "tags": ["chinjao", "luffy", "restoration", "confirmed", "garp"]
  },
  {
    "id": "theory-ep636-004",
    "title": "Bartolomeo Will Win the Mera Mera no Mi for Luffy",
    "summary": "Based on Bartolomeo's introduction and the tournament setup, fans theorized he would win Block B and potentially the entire tournament to give the Mera Mera no Mi to Luffy.",
    "fullText": "When Bartolomeo was introduced in episode 636 as a notorious rookie pirate, fans speculated about his role in the tournament. His confident demeanor and the narrative focus on him suggested he would be a major player. Many theorized that he would win Block B and possibly the entire tournament. However, the theory about him giving the fruit to Luffy was more complex - some thought he had a connection to Ace, while others believed he was a secret Luffy admirer. The theory was partially confirmed when Bartolomeo won Block B (episode 638) and declared he would win the fruit for someone special, though ultimately Sabo appeared and won the fruit instead.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Bartolomeo",
      "title": "Bartolomeo - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2026-01-15"
    },
    "postedDate": "2014-03-16",
    "episodeRange": [636, 678],
    "minEpisode": 636,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 678
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["bartolomeo", "luffy", "sabo"],
    "relatedLocations": ["corrida-colosseum"],
    "relatedEvents": ["ep636-event-001", "ep636-event-008"],
    "tags": ["bartolomeo", "mera-mera-no-mi", "tournament", "partially-confirmed"]
  },
  {
    "id": "theory-ep636-005",
    "title": "Revolutionary Army's Hidden Agenda in Dressrosa",
    "summary": "Hack's presence in the tournament led fans to theorize that the Revolutionary Army had a larger plan in Dressrosa beyond just winning the Mera Mera no Mi.",
    "fullText": "When Hack was revealed as a Revolutionary Army member participating in Block B, fans immediately began theorizing about the organization's true intentions in Dressrosa. While the stated goal was to prevent the Mera Mera no Mi from falling into the wrong hands, many fans suspected a deeper agenda. Theories ranged from investigating Doflamingo's arms trade (which proved true), to establishing contact with Luffy and Law's alliance, to searching for information about the World Government's secrets. The theory was largely confirmed as the arc progressed, revealing that the Revolutionary Army was indeed investigating Dressrosa's underground, with Sabo eventually appearing to secure the Mera Mera no Mi and support the rebellion against Doflamingo.",
    "author": "One Piece Analysis Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Hack",
      "title": "Hack - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2026-01-15"
    },
    "postedDate": "2014-03-16",
    "episodeRange": [636, 704],
    "minEpisode": 636,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 704
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["hack", "sabo", "koala"],
    "relatedLocations": ["corrida-colosseum", "dressrosa"],
    "relatedEvents": ["ep636-event-012"],
    "tags": ["revolutionary-army", "dressrosa", "conspiracy", "confirmed"]
  }
]
