[
  {
    "name": {
      "english": "Rankyaku Hakurai",
      "japanese": "嵐脚 白雷",
      "romanized": "Rankyaku Hakurai"
    },
    "type": "ROKUSHIKI",
    "debutEpisode": 286,
    "debutChapter": 401,
    "users": ["kaku"],
    "description": "A powerful variant of the Rankyaku (Tempest Kick) technique that creates a white-colored compressed air slash. Kaku performs this by swinging his leg in a specific arc, creating a blade-like projectile of compressed air that can match powerful sword techniques.",
    "firstUse": {
      "episodeNumber": 286,
      "eventId": "ep286-event-002",
      "opponent": "zoro",
      "outcome": "The attack evenly matched Zoro's Nitoryu 72-Pound Cannon technique.",
      "context": "Used during the initial exchanges of Kaku and Zoro's sword battle in the Tower of Justice."
    },
    "strengths": [
      "Can match powerful sword techniques despite being a kick-based attack",
      "Long-range capability",
      "Does not require physical contact with the opponent",
      "Can be used while maintaining distance"
    ],
    "weaknesses": [
      "Requires proper stance and positioning to execute",
      "Can be blocked or countered by equally powerful attacks"
    ],
    "relatedAbilities": ["rankyaku", "nitoryu-72-pound-cannon"]
  },
  {
    "name": {
      "english": "Rankyaku (Enhanced by Giraffe Form)",
      "japanese": "嵐脚",
      "romanized": "Rankyaku"
    },
    "type": "ROKUSHIKI",
    "debutEpisode": 286,
    "debutChapter": 401,
    "users": ["kaku"],
    "description": "Kaku's Rankyaku (Tempest Kick) technique dramatically enhanced by his Ushi Ushi no Mi, Model: Giraffe Devil Fruit hybrid form. The combination of his giraffe legs' power and Rokushiki training creates devastating compressed air slashes capable of cutting massive structures.",
    "firstUse": {
      "episodeNumber": 286,
      "eventId": "ep286-event-010",
      "opponent": "none",
      "outcome": "Successfully sliced the entire Tower of Justice building vertically in half.",
      "context": "Used in anger after being mocked for his giraffe appearance, demonstrating the destructive power of his Devil Fruit-enhanced techniques."
    },
    "strengths": [
      "Massively increased power compared to normal Rankyaku",
      "Capable of destroying entire buildings",
      "Demonstrates the synergy between Devil Fruit powers and Rokushiki",
      "Can be used for both offense and environmental destruction"
    ],
    "weaknesses": [
      "Requires Devil Fruit transformation to achieve maximum power",
      "May cause unintended collateral damage to surroundings"
    ],
    "relatedAbilities": ["rankyaku", "ushi-ushi-no-mi-giraffe-hybrid"]
  },
  {
    "name": {
      "english": "Four Sword Style",
      "japanese": "四刀流",
      "romanized": "Yontōryū"
    },
    "type": "SWORD_STYLE",
    "debutEpisode": 286,
    "debutChapter": 401,
    "users": ["kaku"],
    "description": "Kaku's fighting style that combines two physical swords with two 'leg swords' created by Rankyaku techniques. This allows him to attack with four simultaneous blade attacks, mixing traditional swordsmanship with Rokushiki leg techniques.",
    "firstUse": {
      "episodeNumber": 286,
      "eventId": "ep286-event-001",
      "opponent": "zoro",
      "outcome": "Successfully demonstrated the style against Zoro.",
      "context": "Introduced during the beginning of Kaku's battle with Zoro, claiming himself to be CP9's best swordsman."
    },
    "strengths": [
      "Combines swordsmanship with Rokushiki for unpredictable attacks",
      "Four simultaneous attack vectors",
      "Can attack from unconventional angles using leg-based slashes",
      "Confuses opponents used to traditional sword fighting"
    ],
    "weaknesses": [
      "Requires coordination between hand and leg techniques",
      "Leg-based 'swords' are projectiles and cannot be used for blocking"
    ],
    "relatedAbilities": ["rankyaku", "swordsmanship"]
  },
  {
    "name": {
      "english": "Nitoryu: 72 Pound Cannon",
      "japanese": "二刀流 七十二煩悩鳳",
      "romanized": "Nitōryū: Nanajūni Pondo Hō"
    },
    "type": "SWORD_TECHNIQUE",
    "debutEpisode": null,
    "debutChapter": null,
    "users": ["zoro"],
    "description": "One of Zoro's Two Sword Style techniques where he launches powerful compressed air slashes from both swords simultaneously. The technique creates flying sword slashes that can cut opponents from a distance.",
    "firstUse": {
      "episodeNumber": 286,
      "eventId": "ep286-event-002",
      "opponent": "kaku",
      "outcome": "Evenly matched Kaku's Rankyaku Hakurai technique.",
      "context": "Used during the initial exchange of attacks with Kaku in the Tower of Justice battle."
    },
    "strengths": [
      "Long-range capability",
      "Powerful enough to match Rokushiki techniques",
      "Dual simultaneous attacks",
      "Can cut through multiple targets"
    ],
    "weaknesses": [
      "Requires both swords to be available",
      "Can be blocked or countered by equally powerful techniques"
    ],
    "relatedAbilities": ["santoryu", "ittoryu"]
  },
  {
    "name": {
      "english": "Tekkai Kenpo",
      "japanese": "鉄塊拳法",
      "romanized": "Tekkai Kenpō"
    },
    "type": "ROKUSHIKI",
    "debutEpisode": null,
    "debutChapter": null,
    "users": ["jabra"],
    "description": "Jabra's unique martial arts style that allows him to maintain the defensive benefits of Tekkai (Iron Body) while still being able to move and attack. This is considered an advanced application of Rokushiki that most users cannot achieve, as Tekkai normally requires the user to remain stationary.",
    "firstUse": {
      "episodeNumber": 286,
      "eventId": null,
      "opponent": null,
      "outcome": "Referenced as one of Jabra's signature techniques.",
      "context": "Mentioned as part of Jabra's combat abilities that are enhanced by his Wolf Devil Fruit."
    },
    "strengths": [
      "Combines offense and defense simultaneously",
      "Eliminates the main weakness of standard Tekkai (immobility)",
      "Enhanced further by Devil Fruit transformation",
      "Rare technique that few can master"
    ],
    "weaknesses": [
      "Still vulnerable to sufficiently powerful attacks",
      "Requires intense focus and training to maintain"
    ],
    "relatedAbilities": ["tekkai", "rokushiki"]
  }
]
