[
  {
    "name": {
      "english": "Ox-Ox Fruit, Model: Giraffe",
      "japanese": "ウシウシの実 モデル\"麒麟（ジラフ）\"",
      "romanized": "Ushi Ushi no Mi, Moderu: Jirafu"
    },
    "type": "ZOAN",
    "subtype": "Standard Zoan",
    "debutEpisode": 286,
    "debutChapter": 401,
    "episodeAppearances": [286],
    "currentUser": "kaku",
    "previousUsers": [],
    "abilities": [
      {
        "name": "Full Giraffe Transformation",
        "description": "Allows the user to transform into a full giraffe, granting increased size, strength, and a long neck. Kaku accidentally achieved this form first when trying to transform.",
        "episodeRevealed": 286,
        "limitations": ["In full animal form, the user loses human intelligence and dexterity"]
      },
      {
        "name": "Hybrid Giraffe Form",
        "description": "A hybrid form combining human and giraffe features, granting enhanced strength, extended reach from the long neck, powerful leg strikes, and the ability to use the neck as a weapon. This is the most practical combat form.",
        "episodeRevealed": 286,
        "limitations": ["The long neck presents an exploitable vulnerability"]
      },
      {
        "name": "Enhanced Rankyaku",
        "description": "In hybrid form, Kaku's Rokushiki Rankyaku (Tempest Kick) techniques are dramatically enhanced, capable of slicing entire buildings in half vertically.",
        "episodeRevealed": 286,
        "limitations": []
      }
    ],
    "appearance": "The fruit has a red exterior shaped like banana clusters with decorative swirls and yellow insides with similar spiral patterns.",
    "strengths": [
      "Grants tremendous physical strength in both full and hybrid forms",
      "Extended physical reach from the long giraffe neck",
      "Enhanced running speed",
      "Powerful leg and hoof strikes",
      "Neck can be used as a whip-like weapon",
      "Combines exceptionally well with Rokushiki techniques"
    ],
    "weaknesses": [
      "Standard Devil Fruit weaknesses (sea water, Sea-Prism Stone)",
      "The long neck is an exposed and vulnerable target",
      "The appearance is often considered ridiculous, affecting intimidation factor",
      "Initial transformation was difficult to control"
    ],
    "keyMoments": [
      {
        "episodeNumber": 286,
        "eventId": "ep286-event-006",
        "description": "First revealed when Kaku transforms during his battle with Zoro, accidentally becoming a full giraffe and causing the floor to collapse.",
        "significance": "Major power reveal showing Kaku's newly acquired Devil Fruit ability."
      },
      {
        "episodeNumber": 286,
        "eventId": "ep286-event-009",
        "description": "Kaku successfully achieves his hybrid giraffe form after being mocked for his full transformation.",
        "significance": "Demonstrates Kaku's mastery of the Devil Fruit's most practical combat form."
      },
      {
        "episodeNumber": 286,
        "eventId": "ep286-event-010",
        "description": "Kaku uses his enhanced Rankyaku technique in hybrid form to vertically slice the Tower of Justice in half.",
        "significance": "Showcases the devastating power of combining Devil Fruit transformation with Rokushiki techniques."
      }
    ],
    "trivia": [
      "Kaku received this Devil Fruit from Spandam shortly before the Enies Lobby arc, making him a very inexperienced user.",
      "This is one of the few Devil Fruits whose appearance has been described in detail.",
      "The giraffe transformation is often considered one of the most comedic Devil Fruit forms in the series due to its awkward appearance."
    ]
  },
  {
    "name": {
      "english": "Dog-Dog Fruit, Model: Wolf",
      "japanese": "イヌイヌの実 モデル「狼（ウルフ）」",
      "romanized": "Inu Inu no Mi, Moderu: Urufu"
    },
    "type": "ZOAN",
    "subtype": "Carnivorous Zoan",
    "debutEpisode": 286,
    "debutChapter": 401,
    "episodeAppearances": [286],
    "currentUser": "jabra",
    "previousUsers": [],
    "abilities": [
      {
        "name": "Full Wolf Transformation",
        "description": "Allows the user to transform into a full wolf, granting enhanced speed, senses, and natural predatory instincts.",
        "episodeRevealed": 286,
        "limitations": ["Loses human intelligence and hand dexterity in full animal form"]
      },
      {
        "name": "Hybrid Wolf Form",
        "description": "A hybrid wolfman form that combines human intelligence with wolf strength, featuring enhanced physical power, sharp claws, powerful fangs, and increased ferocity. This form is ideal for combat.",
        "episodeRevealed": 286,
        "limitations": []
      },
      {
        "name": "Enhanced Rokushiki",
        "description": "The wolf transformation enhances Jabra's already formidable Rokushiki techniques, particularly his Tekkai Kenpo which allows him to move while maintaining Iron Body defense.",
        "episodeRevealed": 286,
        "limitations": []
      }
    ],
    "appearance": "Not described in detail in this episode.",
    "strengths": [
      "Grants significantly enhanced physical strength equivalent to an actual wolf",
      "Sharp claws and fangs for close combat",
      "Increased ferocity and predatory instincts",
      "Being a carnivorous Zoan, provides greater combat effectiveness than herbivorous types",
      "Combines excellently with martial arts techniques like Rokushiki",
      "Reportedly increases the user's Doriki (power level) during transformation"
    ],
    "weaknesses": [
      "Standard Devil Fruit weaknesses (sea water, Sea-Prism Stone)",
      "No unique weaknesses specific to this fruit"
    ],
    "keyMoments": [
      {
        "episodeNumber": 286,
        "eventId": "ep286-event-005",
        "description": "First revealed when Jabra wakes up from Sogeking's failed stealth attempt and transforms into his wolf hybrid form.",
        "significance": "Major power reveal establishing Jabra as one of CP9's strongest members with a carnivorous Zoan-type Devil Fruit."
      }
    ],
    "trivia": [
      "Jabra has had this Devil Fruit for a significant amount of time and is an experienced user, unlike Kaku.",
      "Jabra reportedly used this ability for street entertainment, performing acts like jumping through fire hoops in wolf form to earn money.",
      "As a carnivorous Zoan, this fruit is considered more suitable for combat than herbivorous Zoan types."
    ]
  }
]
