[
  {
    "name": {
      "english": "Seastone Handcuffs",
      "japanese": "海楼石の手錠",
      "romanized": "Kairōseki no Tejō"
    },
    "type": "WEAPON",
    "subtype": "Restraint Device",
    "debutEpisode": null,
    "debutChapter": null,
    "episodeAppearances": [286],
    "description": "Handcuffs made from Seastone (Sea-Prism Stone), a rare mineral that emits the same energy as the sea. When placed on Devil Fruit users, these handcuffs nullify their powers and drain their strength, making them as weak as if they were submerged in seawater.",
    "currentOwner": "cp9",
    "previousOwners": [],
    "keyMoments": [
      {
        "episodeNumber": 286,
        "eventId": "ep286-event-008",
        "description": "Sogeking finds unused pairs of seastone handcuffs in the Tower of Justice and attempts to throw them at Kaku and Jabra to neutralize their Devil Fruit powers. However, one handcuff ends up on Zoro's wrist instead.",
        "significance": "Creates a comedic mishap that adds a handicap to Zoro's battle, though he doesn't have Devil Fruit powers so it only serves as a physical burden."
      }
    ],
    "abilities": [
      "Nullifies Devil Fruit powers when in contact with the user",
      "Drains the energy and strength of Devil Fruit users",
      "Cannot be broken by Devil Fruit users due to their weakened state",
      "Affects all Devil Fruit users regardless of fruit type"
    ],
    "properties": [
      "Made from Seastone (Kairōseki), a rare mineral",
      "Emits the same energy as seawater",
      "Extremely durable and difficult to break",
      "Standard equipment for World Government agents dealing with Devil Fruit users"
    ],
    "trivia": [
      "In this episode, the handcuffs ironically end up on Zoro, who doesn't have Devil Fruit powers, so they only serve as a physical hindrance rather than a power nullifier.",
      "CP9 keeps seastone handcuffs available specifically for restraining Devil Fruit users.",
      "The mishap with the handcuffs demonstrates the chaotic nature of the battles in the Tower of Justice."
    ]
  }
]
