[
  {
    "name": {
      "english": "CP9",
      "japanese": "CP9",
      "romanized": "CP9"
    },
    "fullName": "Cipher Pol Number 9",
    "type": "GOVERNMENT_AGENCY",
    "debutEpisode": 264,
    "debutChapter": 375,
    "episodeAppearances": [286],
    "description": "CP9 is a secret Cipher Pol agency operating under the World Government. Unlike other CP units, CP9 agents are authorized to kill in the name of justice and are masters of the Rokushiki martial arts techniques. They operate covertly and are considered among the most elite assassins in the world.",
    "status": "ACTIVE",
    "leadership": [
      {
        "characterId": "spandam",
        "role": "Director",
        "episodeStart": 264,
        "episodeEnd": null
      }
    ],
    "members": [
      {
        "characterId": "rob-lucci",
        "role": "Strongest Member",
        "episodeJoined": 264,
        "episodeLeft": null,
        "rank": "Agent"
      },
      {
        "characterId": "kaku",
        "role": "Second Strongest Member",
        "episodeJoined": 264,
        "episodeLeft": null,
        "rank": "Agent"
      },
      {
        "characterId": "jabra",
        "role": "Third Strongest Member",
        "episodeJoined": 264,
        "episodeLeft": null,
        "rank": "Agent"
      }
    ],
    "affiliations": [
      {
        "organizationId": "world-government",
        "relationType": "SUBORDINATE",
        "episodeEstablished": 264
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 286,
        "eventId": "ep286-event-005",
        "description": "CP9 agent Jabra reveals his Inu Inu no Mi, Model: Wolf Devil Fruit power during battle.",
        "significance": "Demonstrates the enhanced capabilities of CP9 agents who possess Devil Fruit powers in addition to Rokushiki mastery."
      },
      {
        "episodeNumber": 286,
        "eventId": "ep286-event-006",
        "description": "CP9 agent Kaku reveals his Ushi Ushi no Mi, Model: Giraffe Devil Fruit power.",
        "significance": "Shows that Spandam has equipped his top agents with Devil Fruits to increase their combat effectiveness for the Enies Lobby mission."
      }
    ],
    "abilities": [
      {
        "name": "Rokushiki",
        "description": "A specialized martial arts style consisting of six superhuman techniques: Geppo (Moonwalk), Rankyaku (Tempest Kick), Soru (Shave), Shigan (Finger Pistol), Kami-e (Paper Art), and Tekkai (Iron Body). All CP9 agents are masters of these techniques.",
        "episodeRevealed": 264
      },
      {
        "name": "Rokuogan",
        "description": "A secret seventh Rokushiki technique known only to Rob Lucci, the Six King Gun.",
        "episodeRevealed": null
      }
    ],
    "goals": [
      "Serving the World Government through covert operations and assassinations",
      "Maintaining world order through elimination of threats",
      "Capturing Nico Robin for the World Government",
      "Obtaining the Pluton blueprints"
    ],
    "trivia": [
      "CP9 agents are measured by 'Doriki,' a power rating system. Kaku has 2200 Doriki and Jabra has 2180 Doriki.",
      "CP9 is unique among Cipher Pol units in being authorized to kill.",
      "All CP9 agents are masters of Rokushiki, a feat that typically requires years of intense training.",
      "Spandam gave Devil Fruits to Kaku and Kalifa just before the Enies Lobby arc to enhance their combat abilities."
    ]
  }
]
