[
  {
    "id": "theory-001",
    "title": "Enies Lobby Built on the One Piece Treasure",
    "theory": "Some fans theorize that Enies Lobby is built on the One Piece treasure itself, which is the missing part from Jaya Island. This theory suggests that only Luffy managed to enter Enies Lobby and declare war against the World Government, and they went there to rescue Robin, the only person who can read the Poneglyphs, connecting the rescue mission to the ultimate treasure.",
    "author": "Ohara (Content Creator)",
    "source": "YouTube/Online Discussion",
    "episodeNumbers": [263, 264, 306],
    "spoilerStatus": "SPECULATIVE",
    "containsFutureSpoilers": true,
    "popularity": "MEDIUM",
    "credibility": "SPECULATIVE"
  },
  {
    "id": "theory-002",
    "title": "Kokoro's Connection to Fish-Man Island",
    "theory": "Fans speculate about Kokoro's past and her connection to Fish-Man Island, theorizing about why she chose to live on the surface and her possible knowledge of the ancient world. Her reveal as a mermaid sparked discussions about mermaid biology and whether she has important historical knowledge that will be relevant later in the series.",
    "author": "Various Fan Communities",
    "source": "Reddit/Forums",
    "episodeNumbers": [306],
    "spoilerStatus": "SPECULATIVE",
    "containsFutureSpoilers": false,
    "popularity": "LOW",
    "credibility": "SPECULATIVE"
  },
  {
    "id": "theory-003",
    "title": "Jaguar D. Saul Survived the Ohara Buster Call",
    "theory": "Many fans have theorized that Jaguar D. Saul survived being frozen by Kuzan (Aokiji) during the Ohara Buster Call. The theory suggests that Kuzan, who showed hesitation about the Buster Call, may have frozen Saul to preserve him rather than kill him. This theory gained traction with connections to the Elbaf arc and the possibility of Saul's return to the story.",
    "author": "Various Fan Communities",
    "source": "Reddit/Forums/YouTube",
    "episodeNumbers": [275, 276, 277, 306],
    "spoilerStatus": "MAJOR_THEORY",
    "containsFutureSpoilers": true,
    "popularity": "HIGH",
    "credibility": "POSSIBLE"
  },
  {
    "id": "theory-004",
    "title": "Spandam Family Corruption Runs Deeper",
    "theory": "Fans theorize that the Spandam family's corruption and connection to the World Government runs much deeper than revealed in the Enies Lobby arc. The theory suggests that Spandine and Spandam's actions at Ohara and Enies Lobby are part of a larger pattern of World Government cover-ups, potentially connected to the Void Century and ancient weapons.",
    "author": "Various Fan Communities",
    "source": "Forums/Discussion Boards",
    "episodeNumbers": [275, 276, 277, 306],
    "spoilerStatus": "SPECULATIVE",
    "containsFutureSpoilers": true,
    "popularity": "MEDIUM",
    "credibility": "SPECULATIVE"
  }
]
