[
  {
    "name": {
      "english": "Gum-Gum Fruit",
      "japanese": "ゴムゴムの実",
      "romanized": "Gomu Gomu no Mi"
    },
    "episodeAppearances": [559],
    "keyMoments": [
      {
        "episodeNumber": 559,
        "eventId": "ep559-event-006",
        "momentType": "WEAKNESS_EXPLOIT",
        "title": "Luffy's Devil Fruit Weakness Exploited",
        "description": "Luffy's Devil Fruit weakness to water is exploited by Hody Jones, who bursts his air bubble and causes him to begin drowning in the ocean.",
        "significance": "Demonstrates the severe disadvantage Devil Fruit users face in water, particularly against opponents who are fish-men. This is one of the most life-threatening situations caused by Luffy's Devil Fruit curse.",
        "timestamp": "16:50"
      }
    ],
    "reveals": [
      {
        "infoType": "WEAKNESS_DEMONSTRATION",
        "information": "The episode dramatically showcases the deadly consequences of a Devil Fruit user fighting underwater against a fish-man",
        "episodeRevealed": 559,
        "severity": "MAJOR"
      }
    ]
  },
  {
    "name": {
      "english": "Mark-Mark Fruit",
      "japanese": "マトマトの実",
      "romanized": "Mato Mato no Mi"
    },
    "episodeAppearances": [559],
    "keyMoments": [
      {
        "episodeNumber": 559,
        "eventId": "ep559-event-004",
        "momentType": "ABILITY_USE",
        "title": "Vander Decken's Targeted Attack on Shirahoshi",
        "description": "Vander Decken uses his Mark-Mark Fruit powers to launch a barrage of projectiles that automatically target Shirahoshi after she rejects his marriage proposal.",
        "significance": "Continues to demonstrate the persistent threat Vander Decken poses to Shirahoshi through his Devil Fruit ability.",
        "timestamp": "11:45"
      },
      {
        "episodeNumber": 559,
        "eventId": "ep559-event-008",
        "momentType": "POTENTIAL_DEACTIVATION",
        "title": "Hody Stabs Decken to Deactivate Powers",
        "description": "Hody Jones fatally stabs Vander Decken with the intention of killing him to deactivate his Mark-Mark Fruit powers, which would cause Noah to drop directly onto Fish-Man Island.",
        "significance": "This reveals a critical weakness of Devil Fruit powers - they deactivate upon the user's death. Hody attempts to exploit this to weaponize Noah's fall.",
        "timestamp": "20:45"
      }
    ],
    "reveals": [
      {
        "infoType": "POWER_MECHANICS",
        "information": "Hody's plan reveals that Devil Fruit powers deactivate when the user dies, which would cause Noah to fall",
        "episodeRevealed": 559,
        "severity": "MAJOR"
      }
    ]
  }
]
