[
  {
    "name": {
      "english": "Shadow-Shadow Fruit",
      "japanese": "カゲカゲの実",
      "romanized": "Kage Kage no Mi"
    },
    "debutEpisode": 343,
    "debutChapter": 449,
    "episodeAppearances": [350],
    "type": "Paramecia",
    "currentUser": "gecko-moria",
    "formerUsers": [],
    "description": "A Paramecia-type Devil Fruit that allows the user to manifest and control shadows. The user can steal the shadows of other beings and implant them into corpses to create zombies, or into living people to grant them additional strength.",
    "abilities": [
      {
        "abilityName": "Shadow Theft",
        "description": "The user can steal the shadows of living beings by cutting them with scissors. Those who lose their shadows will disintegrate in direct sunlight.",
        "episodeFirstUsed": 343,
        "limitations": ["Shadows can be purified from zombies using salt", "Devil Fruit weakness applies to shadow manipulation"]
      },
      {
        "abilityName": "Zombie Creation",
        "description": "The user can implant stolen shadows into corpses to create zombies that possess the personality and abilities of the shadow's original owner.",
        "episodeFirstUsed": 343,
        "limitations": ["Zombies are weak to salt which can expel the shadow", "Shadow personality may conflict with orders"]
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 350,
        "eventId": "ep350-event-007",
        "momentType": "POWER_REVEAL",
        "title": "Luffy's Shadow Implanted into Oars",
        "description": "Moria uses his Kage Kage no Mi power to implant Luffy's stolen shadow into the corpse of Oars, creating his ultimate zombie weapon - Special Zombie #900.",
        "significance": "Demonstrates the full potential of the Kage Kage no Mi by combining Luffy's abilities with a massive ancient giant, creating the arc's primary physical threat.",
        "timestamp": "16:45"
      },
      {
        "episodeNumber": 350,
        "eventId": "ep350-event-001",
        "momentType": "WORLD_LORE",
        "title": "Zombie Weakness to Salt Explained",
        "description": "Brook explains that zombies created by the Kage Kage no Mi are weak to salt because Devil Fruit powers are negated by seawater properties.",
        "significance": "Reveals a crucial weakness in Moria's zombie army that can be exploited by the Straw Hats.",
        "timestamp": "05:30"
      }
    ],
    "awakening": null,
    "notableQuotes": [],
    "weaknesses": [
      "Standard Devil Fruit weakness to seawater and Seastone",
      "Shadows can be expelled from zombies using salt",
      "Shadow personalities may make zombies difficult to control"
    ],
    "obtainedWhen": "Unknown",
    "obtainedWhere": "Unknown"
  }
]
