[
  {
    "id": "theory-ep350-001",
    "title": "Gecko Moria is Actually Kozuki Moria from Wano",
    "theory": "In One Piece Chapter 1158's cover story, a grave for 'Kozuki Moria' is revealed in Wano Country's Ringo region. This person has several traits in common with Gecko Moria - same given name, being a pirate from the West Blue, and fighting Kaido in Ringo. The wordplay is significant: 'Gecko' is the Kozuki kanji phrase written in reverse, literally meaning 'moonlight.' This suggests Gecko Moria may actually be a member of the Kozuki clan who fought against Kaido to defend his village and was thought to have died, with no body recovered.",
    "theorist": "One Piece Community",
    "sourceUrl": "https://onepiece.fandom.com/wiki/Kouzuki_Moria",
    "sourceType": "WIKI",
    "episodesReferenced": [350, 456],
    "minEpisode": 350,
    "spoilerWarning": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 1100,
      "spoilerDescription": "Contains information from Chapter 1158 and Wano Country arc, major spoilers for late-series content"
    },
    "supportingEvidence": [
      "Chapter 1158 reveals a grave for 'Kozuki Moria' in Wano's Ringo region",
      "The name 'Gecko' is Kozuki written in reverse, meaning 'moonlight'",
      "Both fought against Kaido in Wano",
      "Both originated from West Blue",
      "Kozuki Moria's body was never found",
      "Episode 350 establishes Moria was defeated by Kaido in the New World"
    ],
    "counterEvidence": [
      "Not yet officially confirmed by Oda",
      "Physical appearance differences not fully explained",
      "Timeline details still unclear"
    ],
    "status": "UNCONFIRMED",
    "popularity": "HIGH",
    "dateProposed": "2024-01-01",
    "relatedTheories": [],
    "communityDiscussion": "This theory gained significant traction after Chapter 1158's cover story revealed the Kozuki Moria grave. Fans have noted the clever wordplay with the names and the thematic connection between Moria's past and the Kozuki clan's resistance against Kaido. If true, this would make Moria potentially related to Oden, Momonosuke, and other Kozuki family members."
  },
  {
    "id": "theory-ep350-002",
    "title": "Moria Defeated Kaido in One of His Seven Losses",
    "theory": "It was stated that Kaido has lost seven times in his life. Some fans theorize that one of those defeats was at the hands of Gecko Moria during their battle in Wano. While Moria's crew was ultimately destroyed and he was defeated overall, he may have actually won an initial confrontation or battle against Kaido himself before being overwhelmed by the Beasts Pirates.",
    "theorist": "One Piece Reddit Community",
    "sourceUrl": "https://onetheory.app/posts/theory-gecko-moria-has-beaten-kaido-in-the-past",
    "sourceType": "FORUM",
    "episodesReferenced": [350],
    "minEpisode": 350,
    "spoilerWarning": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 1000,
      "spoilerDescription": "Contains information about Kaido's past and abilities revealed later in the series"
    },
    "supportingEvidence": [
      "Episode 350 confirms Moria fought Kaido in the past",
      "Kaido is stated to have lost 7 times",
      "Moria was described as much stronger in his prime before the defeat",
      "The battle took place in Wano where Moria had potential advantages"
    ],
    "counterEvidence": [
      "Moria's crew was completely destroyed, suggesting total defeat",
      "Moria's current state suggests he was thoroughly beaten",
      "No direct statement that Moria ever won against Kaido",
      "Other defeats of Kaido have been identified or implied"
    ],
    "status": "SPECULATIVE",
    "popularity": "MEDIUM",
    "dateProposed": "2020-01-01",
    "relatedTheories": ["theory-ep350-001"],
    "communityDiscussion": "This theory attempts to reconcile Moria's past strength with Kaido's known defeats. Some fans believe Moria may have initially defeated Kaido in single combat before being overwhelmed by his crew, which would explain both Kaido's respect for strong opponents and Moria's current obsession with having an invulnerable zombie army rather than relying on living crew members."
  },
  {
    "id": "theory-ep350-003",
    "title": "Oars Jr. Was Searching for Moria to Avenge His Ancestor",
    "theory": "Little Oars Jr., who appears during the Marineford War as an ally of Whitebeard, may have had a secondary motivation beyond helping Ace - he might have been searching for Gecko Moria to avenge his ancestor Oars whose body was desecrated and turned into a zombie. This would add another layer to the Marineford conflict and explain Oars Jr.'s particular ferocity.",
    "theorist": "One Piece Theory Community",
    "sourceUrl": "https://onepiece.fandom.com/wiki/Oars",
    "sourceType": "WIKI",
    "episodesReferenced": [350, 456],
    "minEpisode": 350,
    "spoilerWarning": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 489,
      "spoilerDescription": "Contains spoilers about Marineford War and Little Oars Jr."
    },
    "supportingEvidence": [
      "Episode 350 establishes Oars' body was taken by Moria",
      "Little Oars Jr. is confirmed to be Oars' descendant",
      "Both Moria and Oars Jr. appear at Marineford",
      "Desecration of ancestor's body would be strong motivation in One Piece's world"
    ],
    "counterEvidence": [
      "No direct interaction shown between Oars Jr. and Moria at Marineford",
      "Oars Jr.'s stated motivation is helping Ace",
      "No dialogue suggests this connection",
      "Timeline unclear on when Oars Jr. would have learned about this"
    ],
    "status": "SPECULATIVE",
    "popularity": "LOW",
    "dateProposed": "2018-01-01",
    "relatedTheories": [],
    "communityDiscussion": "This is a minor theory that hasn't gained much traction but provides an interesting potential subplot. Most fans believe Oars Jr.'s sole motivation was helping Ace and Whitebeard, but some suggest the coincidence of both him and Moria being at Marineford could have been set up for a confrontation that never happened due to the chaos of the war."
  },
  {
    "id": "theory-ep350-004",
    "title": "Moria May Join Cross Guild as Their Poneglyph Reader",
    "theory": "If Gecko Moria is confirmed to be from the Kozuki clan (as suggested by the Kozuki Moria grave), he would potentially have the ability to read Poneglyphs, as the Kozuki clan created them and passed down the knowledge of decoding them. This could lead him to join the Cross Guild, as they're the only major organization lacking a Poneglyph reader compared to other Emperor crews.",
    "theorist": "One Piece Theory Community",
    "sourceUrl": "https://gamerant.com/one-piece-key-moments-foreshadowed-gecko-moria-lineage/",
    "sourceType": "ARTICLE",
    "episodesReferenced": [350],
    "minEpisode": 350,
    "spoilerWarning": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 1100,
      "spoilerDescription": "Contains major spoilers about Cross Guild, Kozuki Moria theory, and late-series developments"
    },
    "supportingEvidence": [
      "Kozuki clan can read Poneglyphs",
      "Cross Guild lacks a Poneglyph reader",
      "Moria's grudge against Kaido aligns with Cross Guild's goals",
      "Episode 350 establishes Moria's desire for revenge",
      "Buggy and Moria have history from Impel Down/Marineford"
    ],
    "counterEvidence": [
      "Kozuki Moria connection not officially confirmed",
      "Moria's current whereabouts and status unclear",
      "Not all Kozuki members can necessarily read Poneglyphs",
      "Moria's personality may not mesh with Cross Guild leadership"
    ],
    "status": "HIGHLY_SPECULATIVE",
    "popularity": "MEDIUM",
    "dateProposed": "2024-01-01",
    "relatedTheories": ["theory-ep350-001"],
    "communityDiscussion": "This theory builds on the Kozuki Moria theory and attempts to predict Moria's future role in the story. Fans note that Moria's desire for revenge against Kaido (established in Episode 350) could be reframed as reclaiming something stolen from him (home, honor, identity) if he's truly from Wano. The Cross Guild connection provides a potential path for Moria to remain relevant in the final saga while serving a practical purpose for a major faction."
  }
]
