[
  {
    "id": "theory-ep506-001",
    "title": "Robin as the 'Light of the Revolution' - Future Alliance Theory",
    "theoryText": "The Revolutionary Army's interest in Robin, calling her the 'Light of the Revolution,' suggests a deeper connection between Robin's knowledge of the Poneglyphs and the Revolutionary Army's goals. Some fans theorize that Robin's decision to temporarily join the Revolutionary Army after declining their initial offer (shown in Episode 506) was strategic - she could learn about the Void Century from Dragon's perspective while also understanding the true enemy (World Government) better. This sets up a future alliance between the Straw Hats and Revolutionary Army in the Final War, with Robin serving as a bridge between the two groups.",
    "author": "Various One Piece fans",
    "source": "One Piece forums and discussion boards",
    "sourceUrl": "https://worstgen.alwaysdata.net/forum/threads/destiny-unfolds-father-son-revolutionary-army-strawhat-pirates.10714/",
    "publishDate": "2020-01-01",
    "episodeRange": [506, 516],
    "minEpisode": 506,
    "spoilerStatus": "CONTAINS_SPOILERS",
    "maxEpisodeSpoiler": 1100,
    "spoilerDescription": "This theory references events and character developments that occur well beyond Episode 506, including the Revolutionary Army's role in later arcs and the concept of the Final War.",
    "popularity": {
      "upvotes": null,
      "views": null,
      "discussionCount": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["robin", "monkey-d-dragon"],
    "relatedEvents": ["ep506-event-011", "ep506-event-012"]
  },
  {
    "id": "theory-ep506-002",
    "title": "Mihawk's True Motivation for Training Zoro",
    "theoryText": "Episode 506 shows Mihawk saving Zoro from the Humandrills and explaining the events at Marineford. Some fans theorize that Mihawk's eventual decision to train Zoro (shown in later episodes) was influenced by this moment. The theory suggests that Mihawk saw in Zoro's reaction to learning about Ace's death and Luffy's suffering a worthy quality - the ability to care deeply about others while maintaining one's own ambitions. Mihawk, who appears solitary, was impressed by Zoro's loyalty to his captain and saw it as a trait of a true swordsman. This moment in Episode 506 foreshadows why Mihawk breaks his usual solitude to train someone actively seeking to surpass and defeat him.",
    "author": "One Piece theory community",
    "source": "Fandom discussions and Quora",
    "sourceUrl": "https://www.quora.com/Why-did-Mihawk-train-Zoro",
    "publishDate": "2018-01-01",
    "episodeRange": [506, 515],
    "minEpisode": 506,
    "spoilerStatus": "CONTAINS_SPOILERS",
    "maxEpisodeSpoiler": 515,
    "spoilerDescription": "References Zoro's training arc and his relationship with Mihawk through Episode 515.",
    "popularity": {
      "upvotes": null,
      "views": null,
      "discussionCount": null
    },
    "status": "SPECULATIVE",
    "relatedCharacters": ["zoro", "mihawk"],
    "relatedEvents": ["ep506-event-002", "ep506-event-017"]
  },
  {
    "id": "theory-ep506-003",
    "title": "The Straw Hats' Scattered Locations Were Strategically Planned",
    "theoryText": "While it appears that Bartholomew Kuma scattered the Straw Hats randomly when he saved them from Kuma at Sabaody, some fans theorize that Kuma (working with Dragon) deliberately sent each crew member to locations that would maximize their growth. Episode 506 shows all the crew members in their respective training locations: Zoro with the world's greatest swordsman, Nami learning advanced weather science, Robin with the Revolutionary Army, Franky at Vegapunk's lab, etc. The theory suggests that Kuma knew about Ace's impending death and the two-year timeskip that would be needed, so he positioned each Straw Hat where they could train most effectively. Episode 506's revelation of the news about Ace to all crew members simultaneously suggests a coordinated plan.",
    "author": "One Piece theory community",
    "source": "Various fan forums",
    "sourceUrl": "https://onepiece.fandom.com/wiki/Episode_506",
    "publishDate": "2011-07-10",
    "episodeRange": [405, 516],
    "minEpisode": 405,
    "spoilerStatus": "CONTAINS_SPOILERS",
    "maxEpisodeSpoiler": 516,
    "spoilerDescription": "References the timeskip and the strategic locations of all Straw Hat members.",
    "popularity": {
      "upvotes": null,
      "views": null,
      "discussionCount": null
    },
    "status": "WIDELY_ACCEPTED",
    "relatedCharacters": ["bartholomew-kuma", "monkey-d-dragon"],
    "relatedEvents": ["ep506-event-001", "ep506-event-003", "ep506-event-005", "ep506-event-007", "ep506-event-009", "ep506-event-011", "ep506-event-013", "ep506-event-015"]
  }
]
