[
  {
    "id": "theory-ep499-001",
    "title": "Sabo Was Always Planned, Not a Retcon",
    "summary": "Despite some fans believing Sabo was a retcon added during the Post-War Arc, evidence suggests he was planned from the beginning, as shown by the three sake cups in earlier Marineford flashbacks.",
    "fullText": "Some fans initially saw the flashback to Luffy's childhood as a retcon to fit Sabo into his past, as he had never been mentioned at all during the series. However, in Chapter 558 during Marineford, when Luffy reminded Ace he was his brother, there was a flashback showing three sake cups present, not two—a clear hint of Sabo's existence. This suggests that Oda had planned Sabo's character from at least the Marineford arc, if not earlier, and the Post-War flashbacks were meant to reveal what had been foreshadowed.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://www.cbr.com/one-piece-sabo-ace-luffy-brother-planned/",
      "title": "One Piece: Was Sabo Ever Really Intended to Be Ace and Luffy's Brother?",
      "platform": "CBR",
      "accessedAt": "2025-12-15"
    },
    "postedDate": "2024-06-15",
    "episodeRange": [499, 516],
    "minEpisode": 499,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 600
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["sabo", "ace", "luffy"],
    "relatedLocations": [],
    "relatedEvents": ["ep499-event-007"],
    "tags": ["sabo", "foreshadowing", "oda-planning", "marineford"]
  },
  {
    "id": "theory-ep499-002",
    "title": "Ace's Tattoo References Sabo",
    "summary": "Ace's ASCE tattoo with the crossed-out S is a deliberate tribute to his fallen brother Sabo, representing the pirate flag Sabo used as a child.",
    "fullText": "Ace's tattoo has 'ASCE' with the S crossed out. Many fans theorize this is a direct nod to Sabo and the pirate flag he used as a child. The crossed-out S could represent Sabo's 'death' during the Gray Terminal incident, or it could be a subtle way Ace honored his brother throughout his pirate career. This theory gained more credence after the Post-War Arc flashbacks revealed Sabo's existence and his connection to the brothers.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://www.cbr.com/one-piece-sabo-ace-luffy-brother-planned/",
      "title": "One Piece: Was Sabo Ever Really Intended to Be Ace and Luffy's Brother?",
      "platform": "CBR",
      "accessedAt": "2025-12-15"
    },
    "postedDate": "2011-06-01",
    "episodeRange": [95, 516],
    "minEpisode": 95,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 516
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["ace", "sabo"],
    "relatedLocations": [],
    "relatedEvents": [],
    "tags": ["ace", "sabo", "tattoo", "symbolism", "tribute"]
  },
  {
    "id": "theory-ep499-003",
    "title": "Sakazuki's Name and the Sake Cup Connection",
    "summary": "The name 'Sakazuki' (sake cup in Japanese) has ironic significance as the symbol of brotherhood between Ace, Sabo, and Luffy, and Sakazuki (Akainu) killing Ace ultimately cured Sabo's amnesia.",
    "fullText": "'Sakazuki' is the Japanese word for a pact of brotherhood over sake cups, which is what Ace, Sabo, and Luffy did to signify their brotherly bond. The irony is that Admiral Sakazuki (Akainu) is directly responsible for killing Ace, breaking the brotherhood. However, by killing Ace, Sakazuki is also indirectly responsible for curing Sabo's amnesia—the article featuring both Ace and Luffy's names as well as Sakazuki's name triggered the return of Sabo's memories. This creates a tragic irony where the symbol of brotherhood (sakazuki/sake cup) is connected to both the establishment of their bond and its breaking.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://www.cbr.com/one-piece-sakazuki-heal-sabo-theory/",
      "title": "One Piece Theory: The Most-Hated Villain Healed Sabo by Killing Ace",
      "platform": "CBR",
      "accessedAt": "2025-12-15"
    },
    "postedDate": "2024-09-10",
    "episodeRange": [499, 663],
    "minEpisode": 499,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 663
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["ace", "sabo", "luffy", "akainu"],
    "relatedLocations": [],
    "relatedEvents": ["ep499-event-007"],
    "tags": ["symbolism", "sakazuki", "akainu", "sabo", "ace", "irony", "naming"]
  },
  {
    "id": "theory-ep499-004",
    "title": "Brotherhood Over Blood Theme",
    "summary": "The relationship between Ace, Sabo, and Luffy demonstrates One Piece's recurring theme that chosen family (brotherhood by sake cup) is stronger than blood relations.",
    "fullText": "Episode 499 reinforces one of One Piece's central themes: chosen family is more important than blood. Ace's declaration that 'no one is officially the captain' because all three contributed equally shows that their bond isn't about hierarchy or birthright—it's about mutual respect and shared dreams. This is especially poignant given Ace's struggle with being Roger's son (blood) versus being the brother of Luffy and Sabo (choice). The episode emphasizes that the brothers' equality and mutual support is what makes them strong, not individual power or lineage. This theme continues throughout One Piece with the Straw Hat Pirates and other found families.",
    "author": "One Piece Analysis Community",
    "source": {
      "url": "https://neverwatchedonepiece.tumblr.com/post/177839581074/499-504-the-battle-against-the-big-tiger-who-is",
      "title": "499-504: The Battle Against the Big Tiger! Who Is Going to Be Captain?!",
      "platform": "Tumblr",
      "accessedAt": "2025-12-15"
    },
    "postedDate": "2018-08-25",
    "episodeRange": [499, 1000],
    "minEpisode": 499,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 499
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "THEMATIC_ANALYSIS",
    "relatedCharacters": ["ace", "sabo", "luffy"],
    "relatedLocations": [],
    "relatedEvents": ["ep499-event-007"],
    "tags": ["theme", "brotherhood", "chosen-family", "equality", "character-analysis"]
  }
]
