[
  {
    "id": "theory-ep214-001",
    "title": "Davy Back Fight Foreshadows Rocks Pirates Formation",
    "theoryText": "The Davy Back Fight arc, which appears to be a lighthearted filler-heavy diversion, actually serves as crucial foreshadowing for the Rocks Pirates. The revelation that Pirate Island (Hachinosu) - the birthplace of the Davy Back Fight - was also the home base of the Rocks Pirates suggests that Rocks D. Xebec may have used Davy Back Fights to assemble his legendary crew. This would explain how he gathered such powerful individuals like Whitebeard, Big Mom, Kaido, and others under his command. The seemingly insignificant arc introduced over 600 chapters earlier was actually planting seeds for one of the series' most important historical revelations.",
    "author": "One Piece Fan Community",
    "sourceUrl": "https://screenrant.com/one-piece-chapter-1155-davy-back-fight-worst-arc-redeem/",
    "platform": "Various",
    "publishDate": "2024-01-01",
    "episodesSpanned": [207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219],
    "minEpisode": 207,
    "maxEpisode": 1100,
    "spoilerStatus": {
      "containsSpoilers": true,
      "spoilsEpisodes": [1000, 1100],
      "spoilerSeverity": "MAJOR",
      "spoilerDescription": "Contains major spoilers about Rocks Pirates, Pirate Island (Hachinosu), and late-series revelations about how legendary crews were formed"
    },
    "popularity": {
      "upvotes": 0,
      "views": 0,
      "comments": 0
    },
    "tags": ["foreshadowing", "rocks-pirates", "davy-back-fight", "long-term-setup"],
    "status": "PARTIALLY_CONFIRMED",
    "confirmationEpisodes": []
  },
  {
    "id": "theory-ep214-002",
    "title": "Foxy Will Return as Blackbeard's Subordinate",
    "theoryText": "Given that Blackbeard has established his base on Pirate Island (Hachinosu), the birthplace of Davy Back Fights, and that Foxy is obsessed with these competitions, some fans theorize that Foxy may eventually appear as part of Blackbeard's fleet or as a subordinate. Foxy's Noro Noro no Mi ability, while played for laughs, is actually quite powerful and could be formidable in the hands of someone more competent or when used strategically by someone like Blackbeard. The connection between Foxy Pirates, Davy Back Fights, and Pirate Island suggests a potential future reunion.",
    "author": "One Piece Theory Community",
    "sourceUrl": "https://tvtropes.org/pmwiki/pmwiki.php/Recap/OnePieceDavyBackFightArc",
    "platform": "Various Forums",
    "publishDate": "2023-01-01",
    "episodesSpanned": [207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219],
    "minEpisode": 207,
    "maxEpisode": 1100,
    "spoilerStatus": {
      "containsSpoilers": true,
      "spoilsEpisodes": [900, 1000],
      "spoilerSeverity": "MAJOR",
      "spoilerDescription": "Contains spoilers about Blackbeard's current location and activities in later arcs"
    },
    "popularity": {
      "upvotes": 0,
      "views": 0,
      "comments": 0
    },
    "tags": ["future-plot", "blackbeard", "foxy", "pirate-island"],
    "status": "SPECULATION",
    "confirmationEpisodes": []
  },
  {
    "id": "theory-ep214-003",
    "title": "The Davy Back Fight Will Be Important in the Final War",
    "theoryText": "The extensive screen time devoted to the Davy Back Fight rules and competitions suggests it may play a role in the series' endgame. Some theorize that the final conflict might involve a massive Davy Back Fight between pirate factions, or that the Straw Hats will use this tradition strategically to recruit powerful individuals without direct combat. The emphasis on crew loyalty and the bonds between nakama during this arc mirrors the series' core themes and could be revisited in a climactic way during the final saga.",
    "author": "One Piece Theory Crafters",
    "sourceUrl": "https://www.cbr.com/one-piece-defense-the-davy-back-fight-arc/",
    "platform": "Reddit/Forums",
    "publishDate": "2023-06-01",
    "episodesSpanned": [207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219],
    "minEpisode": 207,
    "maxEpisode": 2000,
    "spoilerStatus": {
      "containsSpoilers": true,
      "spoilsEpisodes": [],
      "spoilerSeverity": "MINOR",
      "spoilerDescription": "Speculates about endgame scenarios but doesn't contain concrete spoilers"
    },
    "popularity": {
      "upvotes": 0,
      "views": 0,
      "comments": 0
    },
    "tags": ["endgame", "final-war", "davy-back-fight", "speculation"],
    "status": "SPECULATION",
    "confirmationEpisodes": []
  }
]
