[
  {
    "id": "tower-of-justice",
    "name": {
      "english": "Tower of Justice",
      "japanese": "司法の塔",
      "romanized": "Shihō no Tō",
      "aliases": []
    },
    "type": "BUILDING",
    "debut": {
      "episode": 263,
      "chapter": 375
    },
    "episodeAppearances": [297],
    "description": "The central tower of Enies Lobby where CP9 has taken Nico Robin. The tower contains multiple floors where the Straw Hats must battle CP9 agents to rescue their crewmate.",
    "parentLocation": "enies-lobby",
    "keyEvents": [
      {
        "episodeNumber": 297,
        "timestamp": "03:45",
        "description": "Jabra brutally attacks Sogeking with Jusshigan inside one of the tower's corridors.",
        "significance": "Shows the ongoing battles throughout the tower as the Straw Hats fight to reach Robin."
      },
      {
        "episodeNumber": 297,
        "timestamp": "05:20",
        "description": "Sanji makes his dramatic entrance, rescuing Sogeking and beginning his battle with Jabra in the tower.",
        "significance": "Marks the start of one of the arc's major battles within the Tower of Justice."
      },
      {
        "episodeNumber": 297,
        "timestamp": "19:30",
        "description": "Zoro and Kaku continue their intense battle in another section of the tower.",
        "significance": "Demonstrates the parallel battles occurring throughout the Tower of Justice."
      },
      {
        "episodeNumber": 297,
        "timestamp": "21:00",
        "description": "Luffy and Rob Lucci continue their brutal fight in the tower.",
        "significance": "The climactic battle of the arc continues to unfold within the tower's walls."
      }
    ]
  },
  {
    "id": "enies-lobby",
    "name": {
      "english": "Enies Lobby",
      "japanese": "エニエス・ロビー",
      "romanized": "Eniesu Robī",
      "aliases": ["Judicial Island", "The Island of No Night"]
    },
    "type": "ISLAND",
    "debut": {
      "episode": 263,
      "chapter": 375
    },
    "episodeAppearances": [297],
    "description": "A judicial island under World Government control, known as the island that never experiences night. It serves as a gateway to the Marine Headquarters and Impel Down prison.",
    "keyEvents": [
      {
        "episodeNumber": 297,
        "timestamp": "15:30",
        "description": "Franky rescues Chopper from the waters around Enies Lobby after his Monster Point transformation.",
        "significance": "Shows the ongoing rescue efforts throughout the island complex."
      },
      {
        "episodeNumber": 297,
        "timestamp": "18:00",
        "description": "Franky, guided by Chimney, races through the halls of Enies Lobby toward the Gates of Justice.",
        "significance": "The race to intercept Robin before she reaches the Gates of Justice intensifies."
      }
    ]
  }
]
