[
  {
    "name": {
      "english": "Swamp-Swamp Fruit",
      "japanese": "ヌマヌマの実",
      "romanized": "Numa Numa no Mi"
    },
    "type": "LOGIA",
    "debutEpisode": 491,
    "debutChapter": 600,
    "episodeAppearances": [531],
    "currentUser": {
      "characterId": "caribou",
      "episodeConsumed": null,
      "status": "ACTIVE"
    },
    "abilities": [
      {
        "abilityName": "Swamp Body Transformation",
        "description": "The user can transform their body into bottomless swamp, allowing them to become intangible and avoid physical attacks like other Logia types.",
        "episodeFirstUsed": 531,
        "category": "TRANSFORMATION"
      },
      {
        "abilityName": "Object and Person Storage",
        "description": "The user can store objects and people within their swamp body, effectively making them disappear into a bottomless swamp dimension.",
        "episodeFirstUsed": 531,
        "category": "STORAGE"
      },
      {
        "abilityName": "Mermaid Kidnapping",
        "description": "Caribou uses his swamp body to capture mermaids by pulling them into his body, where they are stored and unable to escape.",
        "episodeFirstUsed": 531,
        "category": "CAPTURE"
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit Weaknesses",
        "description": "Susceptible to seawater and Seastone like all Devil Fruit users. Cannot swim and becomes weakened when submerged.",
        "episodeRevealed": 491
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 531,
        "eventId": "ep531-event-001",
        "title": "Caribou Uses Numa Numa no Mi to Kidnap Mermaids",
        "description": "Caribou demonstrates the kidnapping application of his Devil Fruit by capturing Ishilly, Fillonce, and another mermaid into his swamp body.",
        "significance": "Shows the sinister potential of the Numa Numa no Mi for criminal activities and establishes Caribou as a threat to Fish-Man Island's mermaid population."
      }
    ],
    "trivia": [
      "The Numa Numa no Mi is considered one of the weaker Logia-type Devil Fruits despite its useful storage capabilities.",
      "Caribou uses this fruit primarily for criminal purposes, storing treasure and kidnapping victims."
    ]
  }
]
