[
  {
    "id": "theory-ep531-001",
    "title": "Shirahoshi is the Ancient Weapon Poseidon",
    "theory": "Shirahoshi is theorized to be Poseidon, one of the three Ancient Weapons, based on her identity as the Mermaid Princess and the historical significance of her lineage. The theory suggests that Poseidon is not an object but a hereditary ability passed down to certain members of the royal family every 100 years, granting the power to communicate with and command Sea Kings.",
    "author": "One Piece Community (Multiple Theorists)",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Poseidon",
      "platform": "One Piece Wiki / Community Forums",
      "datePosted": "2012-01-15"
    },
    "episodeSpan": {
      "startEpisode": 531,
      "endEpisode": 548
    },
    "status": "CONFIRMED",
    "spoilerWarning": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 548,
      "spoilerDescription": "This theory is confirmed in Episode 548 when it's revealed that Shirahoshi is indeed Poseidon."
    },
    "evidence": [
      "Shirahoshi is the current Mermaid Princess, a title with historical significance",
      "She possesses an unknown power that has been kept secret",
      "The existence of ancient weapons has been foreshadowed throughout the series",
      "Previous Mermaid Princess during the Void Century was confirmed to be Poseidon",
      "Shirahoshi's ability to communicate with Sea Kings matches the description of Poseidon's power"
    ],
    "popularity": {
      "upvotes": null,
      "discussionThreads": null,
      "views": null
    },
    "tags": ["ancient-weapons", "poseidon", "shirahoshi", "sea-kings", "void-century"],
    "relatedCharacters": ["shirahoshi", "king-neptune"],
    "relatedEvents": ["ep531-event-009"]
  },
  {
    "id": "theory-ep531-002",
    "title": "Joy Boy's Promise to Fish-Man Island",
    "theory": "The theory explores the connection between Joy Boy, the legendary figure from the Void Century, and his unfulfilled promise to Fish-Man Island and the original Poseidon (the Mermaid Princess of that era). Theorists suggest that Luffy may be destined to fulfill Joy Boy's ancient promise through his friendship with Shirahoshi.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Ancient_Weapons",
      "platform": "Community Discussion Boards",
      "datePosted": "2012-02-01"
    },
    "episodeSpan": {
      "startEpisode": 531,
      "endEpisode": 626
    },
    "status": "PARTIALLY_CONFIRMED",
    "spoilerWarning": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 1115,
      "spoilerDescription": "Contains heavy spoilers about Joy Boy, the Void Century, and endgame revelations that extend far beyond the Fish-Man Island arc."
    },
    "evidence": [
      "Joy Boy left an apology to Fish-Man Island on a Poneglyph",
      "The apology was directed to the Mermaid Princess of that time (original Poseidon)",
      "Luffy shares many parallels with Joy Boy's characteristics",
      "The promise involves bringing Fish-Man Island to the surface",
      "Ancient weapons play a role in the larger endgame of One Piece"
    ],
    "popularity": {
      "upvotes": null,
      "discussionThreads": null,
      "views": null
    },
    "tags": ["joy-boy", "void-century", "ancient-promise", "endgame", "luffy"],
    "relatedCharacters": ["shirahoshi", "luffy", "king-neptune"],
    "relatedEvents": ["ep531-event-009"]
  },
  {
    "id": "theory-ep531-003",
    "title": "Shirahoshi's Power Will Save Fish-Man Island",
    "theory": "This theory posits that Shirahoshi's true power as Poseidon will be crucial in saving Fish-Man Island from destruction. Her ability to command Sea Kings will play a decisive role in preventing catastrophe, particularly involving the massive ship Noah.",
    "author": "Fish-Man Island Arc Theorists",
    "source": {
      "url": "https://gamerant.com/one-piece-the-superweapon-poseidon-explained/",
      "platform": "Community Forums",
      "datePosted": "2012-01-20"
    },
    "episodeSpan": {
      "startEpisode": 531,
      "endEpisode": 568
    },
    "status": "CONFIRMED",
    "spoilerWarning": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 568,
      "spoilerDescription": "Confirmed when Shirahoshi uses her power to command Sea Kings to stop Noah from destroying Fish-Man Island."
    },
    "evidence": [
      "Shirahoshi's confinement suggests she has dangerous or powerful abilities",
      "The giant ship Noah is connected to Fish-Man Island's fate",
      "Shirahoshi's emotional nature may be connected to uncontrolled power awakening",
      "Sea Kings have been shown near Fish-Man Island multiple times",
      "Ancient weapons are said to have world-changing destructive or protective capabilities"
    ],
    "popularity": {
      "upvotes": null,
      "discussionThreads": null,
      "views": null
    },
    "tags": ["shirahoshi", "poseidon", "sea-kings", "noah", "fish-man-island"],
    "relatedCharacters": ["shirahoshi", "luffy"],
    "relatedEvents": ["ep531-event-009", "ep531-event-010"]
  }
]
