[
  {
    "name": {
      "english": "Brook",
      "japanese": "ブルック",
      "romanized": "Burukku"
    },
    "debutEpisode": 338,
    "debutChapter": 443,
    "episodeAppearances": [338],
    "keyMoments": [
      {
        "episodeNumber": 338,
        "eventId": "ep338-event-001",
        "momentType": "FIRST_APPEARANCE",
        "title": "Brook Boards the Thousand Sunny",
        "description": "Brook climbs aboard the Thousand Sunny and greets the crew with overwhelming joy, expressing how happy he is to finally see people after being alone for so long.",
        "significance": "Brook's debut appearance and first meeting with the Straw Hat Pirates. This moment begins his relationship with the crew that will lead to his eventual membership.",
        "timestamp": "03:00",
        "quote": "It's been so long since I've seen people! I'm so happy!"
      },
      {
        "episodeNumber": 338,
        "eventId": "ep338-event-002",
        "momentType": "BACKSTORY_REVEAL",
        "title": "Brook Reveals the Yomi Yomi no Mi",
        "description": "Brook explains to the Straw Hats that he ate the Yomi Yomi no Mi Devil Fruit, which allowed his soul to return to life after death. However, his body had decayed into bones by the time he found it.",
        "significance": "The revelation of Brook's Devil Fruit power and the explanation for his skeletal form. This is one of the most unique Devil Fruit abilities in the series.",
        "timestamp": "05:30",
        "quote": "I ate the Yomi Yomi no Mi, which gives you a second life. When I died, my soul came back to find my body... but by that time, I was already just bones!"
      },
      {
        "episodeNumber": 338,
        "eventId": "ep338-event-003",
        "momentType": "BACKSTORY_REVEAL",
        "title": "Brook's Soul Wandered for a Year",
        "description": "Brook reveals that after his death, his soul spent an entire year wandering the thick fog of the Florian Triangle before finally locating his decayed body.",
        "significance": "Adds depth to Brook's tragic backstory and explains the specific circumstances that led to his current skeletal state.",
        "timestamp": "08:15",
        "quote": "My soul wandered the fog for an entire year before I could find my body. By then, there was nothing left but bones."
      },
      {
        "episodeNumber": 338,
        "eventId": "ep338-event-004",
        "momentType": "BACKSTORY_REVEAL",
        "title": "Brook's Shadow Was Stolen",
        "description": "Brook reveals that his shadow has been stolen, and without it, exposure to sunlight would instantly destroy him, forcing him to remain in the perpetually dark Florian Triangle.",
        "significance": "Establishes the central problem that must be solved and sets up the conflict of the Thriller Bark arc.",
        "timestamp": "11:00",
        "quote": "My shadow was stolen. If I step into sunlight, I'll be burned away into nothingness."
      },
      {
        "episodeNumber": 338,
        "eventId": "ep338-event-006",
        "momentType": "MAJOR_DECISION",
        "title": "Brook Initially Accepts Then Declines Crew Membership",
        "description": "After Luffy invites him to join the crew, Brook joyfully accepts but then withdraws his acceptance, stating he cannot truly join until he recovers his stolen shadow.",
        "significance": "Creates a conditional acceptance that drives the arc's plot. Shows Brook's honorable character and sets up his eventual full joining later.",
        "timestamp": "15:00",
        "quote": "I would love to join you! But... I cannot join your crew until I get my shadow back. I would only be a burden."
      }
    ],
    "status": "ALIVE",
    "statusHistory": [
      {
        "status": "ALIVE",
        "episodeStart": 338,
        "episodeEnd": "present"
      }
    ],
    "occupations": ["Pirate", "Musician"],
    "affiliations": [],
    "birthday": "April 3",
    "age": 90,
    "height": "277 cm",
    "bloodType": "X",
    "bounties": [],
    "devilFruitProgression": {
      "fruitId": "yomi-yomi-no-mi",
      "episodeConsumed": null,
      "episodeLost": null,
      "awakeningEpisode": null
    },
    "abilities": [],
    "relationships": [
      {
        "targetCharacterId": "luffy",
        "relationshipType": "FRIEND",
        "description": "Luffy immediately befriends Brook and invites him to join the Straw Hat Pirates as their musician.",
        "episodeEstablished": 338,
        "evolutionMoments": [
          {
            "episodeNumber": 338,
            "description": "Luffy enthusiastically invites Brook to join the crew after hearing his story.",
            "newRelationshipType": "FRIEND"
          }
        ]
      }
    ],
    "reveals": [
      {
        "infoType": "ABILITY",
        "information": "Ate the Yomi Yomi no Mi Devil Fruit, which allowed his soul to return after death",
        "episodeRevealed": 338,
        "severity": "CRITICAL"
      },
      {
        "infoType": "BACKSTORY",
        "information": "Died as a pirate and his soul wandered for a year before finding his decayed body",
        "episodeRevealed": 338,
        "severity": "MAJOR"
      },
      {
        "infoType": "AFFLICTION",
        "information": "His shadow was stolen, preventing him from surviving in sunlight",
        "episodeRevealed": 338,
        "severity": "CRITICAL"
      },
      {
        "infoType": "PERSONAL",
        "information": "Has been isolated in the Florian Triangle for many years, desperately lonely",
        "episodeRevealed": 338,
        "severity": "MAJOR"
      }
    ],
    "voiceActors": {
      "japanese": "Chō",
      "english": "Ian Sinclair"
    }
  }
]
