[
  {
    "name": {
      "english": "Revive-Revive Fruit",
      "japanese": "ヨミヨミの実",
      "romanized": "Yomi Yomi no Mi"
    },
    "debutEpisode": 338,
    "debutChapter": 443,
    "episodeAppearances": [338],
    "type": "PARAMECIA",
    "currentUser": {
      "characterId": "brook",
      "episodeGained": null,
      "episodeLost": null,
      "status": "ACTIVE"
    },
    "previousUsers": [],
    "abilities": [
      {
        "abilityName": "Resurrection",
        "description": "Allows the user's soul to return to the living world once after death, granting a second life. The user must find their body after death for their soul to reenter it.",
        "episodeFirstUsed": null,
        "episodeRevealed": 338,
        "abilityType": "PASSIVE"
      },
      {
        "abilityName": "Enhanced Soul",
        "description": "The Devil Fruit strengthens the user's soul, enabling it to function independently and return from the afterlife. This enhanced soul can sustain the user's consciousness even in a skeletal body.",
        "episodeFirstUsed": null,
        "episodeRevealed": 338,
        "abilityType": "PASSIVE"
      }
    ],
    "awakening": null,
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness to seawater and Sea Prism Stone",
        "episodeRevealed": 338
      },
      {
        "weakness": "The resurrection ability only works once - if the user dies again after being revived, they die permanently",
        "episodeRevealed": 338
      },
      {
        "weakness": "The Devil Fruit provides no immediate benefit until the user actually dies",
        "episodeRevealed": 338
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 338,
        "eventId": "ep338-event-002",
        "momentType": "POWER_REVEAL",
        "title": "Yomi Yomi no Mi Revealed",
        "description": "Brook reveals to the Straw Hat Pirates that he ate the Yomi Yomi no Mi, explaining how it allowed his soul to return after death and find his body, though by that time only bones remained.",
        "significance": "The debut and full explanation of one of the most unique Devil Fruits in One Piece. Unlike most fruits that grant immediate powers, the Yomi Yomi no Mi only activates upon the user's death.",
        "timestamp": "05:30"
      },
      {
        "episodeNumber": 338,
        "eventId": "ep338-event-003",
        "momentType": "BACKSTORY_REVEAL",
        "title": "The Year-Long Search",
        "description": "Brook explains that after dying, his soul spent an entire year wandering the Florian Triangle's thick fog before finally locating his deceased body, which had already decomposed to bones.",
        "significance": "Demonstrates the limitations and challenges of the Yomi Yomi no Mi's resurrection ability - the user must actively search for their body, and time continues to pass while they do so.",
        "timestamp": "08:15"
      }
    ],
    "reveals": [
      {
        "infoType": "ABILITY",
        "information": "The Yomi Yomi no Mi grants resurrection after death by strengthening the user's soul",
        "episodeRevealed": 338,
        "severity": "CRITICAL"
      },
      {
        "infoType": "LIMITATION",
        "information": "The soul must find and reenter the body after death, which can take time",
        "episodeRevealed": 338,
        "severity": "MAJOR"
      },
      {
        "infoType": "LIMITATION",
        "information": "If the body decays before the soul returns, the user will be a skeleton",
        "episodeRevealed": 338,
        "severity": "MAJOR"
      }
    ],
    "trivia": [
      "The Yomi Yomi no Mi is one of the few Devil Fruits that provides no immediate benefit when consumed - its primary power only activates when the user dies.",
      "The fruit's name 'Yomi' refers to the Japanese underworld or land of the dead, fitting its resurrection theme.",
      "Brook's skeletal appearance is not a direct power of the fruit, but rather a consequence of the year-long delay between his death and his soul's return to his body."
    ]
  }
]
