[
  {
    "id": "theory-ep463-001",
    "title": "Akainu is the Leader of SWORD",
    "summary": "Based on clues like Akainu's sword tattoo on his right shoulder, fans theorize that Admiral (later Fleet Admiral) Akainu secretly leads SWORD, a covert Navy group that operates outside normal command structures.",
    "fullText": "Fans have noticed a peculiar tattoo of a sword on Akainu's right shoulder that appeared in manga cover stories. Combined with his ruthless dedication to 'Absolute Justice' and willingness to go against traditional Navy protocols, some theorize that Akainu founded or leads SWORD, the secret Marine organization. This would explain his extreme methods and give context to his actions during and after Marineford. The theory suggests his magma powers and uncompromising nature make him the perfect leader for a group that operates in the shadows.",
    "author": "One Piece Community (Multiple Sources)",
    "source": {
      "url": "https://gamerant.com/one-piece-akainu-leader-of-sword/",
      "title": "One Piece: Is Akainu The Leader Of Sword?",
      "platform": "GameRant",
      "accessedAt": "2025-12-13"
    },
    "postedDate": "2024-01-01",
    "episodeRange": [463, 1100],
    "minEpisode": 463,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["akainu"],
    "relatedLocations": ["marineford"],
    "relatedEvents": ["ep463-event-005"],
    "tags": ["akainu", "sword", "organization", "absolute-justice"]
  },
  {
    "id": "theory-ep463-002",
    "title": "Akainu Could Find the One Piece in One Year",
    "summary": "Series creator Eiichiro Oda stated that if Akainu were the protagonist instead of Luffy, he would find the One Piece treasure in just one year, suggesting his power level and efficiency are far beyond what we've seen.",
    "fullText": "In an interview or SBS, Eiichiro Oda revealed that if Akainu was the main character of One Piece instead of Luffy, he would find the One Piece treasure in approximately one year due to his overwhelming power and ruthless efficiency. This statement has led fans to theorize that Akainu's true power level, first glimpsed in Episode 463, is far greater than initially shown. The theory suggests that Oda deliberately holds back showing Akainu's full capabilities to maintain narrative tension, and that his Magu Magu no Mi might be one of the most powerful Devil Fruits in existence. Episode 463's display of his powers was just the tip of the iceberg.",
    "author": "Based on Eiichiro Oda Statement",
    "source": {
      "url": "https://gamerant.com/one-piece-oda-reveals-overpowered-akainu/",
      "title": "'He Would Find The One Piece In A Year': Oda Reveals How Overpowered Akainu Really Is",
      "platform": "GameRant",
      "accessedAt": "2025-12-13"
    },
    "postedDate": "2024-01-01",
    "episodeRange": [463, 1100],
    "minEpisode": 463,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 463
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED_BY_ODA",
    "relatedCharacters": ["akainu"],
    "relatedLocations": [],
    "relatedEvents": ["ep463-event-005", "ep463-event-006"],
    "tags": ["akainu", "power-scaling", "oda-statement", "magu-magu-no-mi"]
  },
  {
    "id": "theory-ep463-003",
    "title": "Little Oars Jr.'s Arrival Foreshadows Ancient Giant Lore",
    "summary": "Little Oars Jr.'s introduction as a descendant of the legendary Oars hints at deeper connections to the Ancient Kingdom and the Void Century through the giant race's history.",
    "fullText": "The debut of Little Oars Jr. in Episode 463, standing 60 meters tall as a descendant of the legendary Oars, has sparked theories about the role of giants in One Piece's ancient history. Fans theorize that the original Oars and his descendants may have connections to the Ancient Kingdom from the Void Century. The fact that Little Oars Jr. is three times larger than normal giants suggests a special bloodline that might tie into the series' deeper mysteries. His friendship with Ace and willingness to fight at Marineford demonstrates that giants have been involved in major historical events for centuries. Some theorize that the giants' absence from certain historical records is deliberate, and that families like Oars' descendants hold keys to understanding the Void Century.",
    "author": "One Piece Community Speculation",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Little_Oars_Jr.",
      "title": "Little Oars Jr. - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-13"
    },
    "postedDate": "2010-08-22",
    "episodeRange": [463, 1100],
    "minEpisode": 463,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["little-oars-jr", "oars", "ace"],
    "relatedLocations": ["marineford"],
    "relatedEvents": ["ep463-event-010"],
    "tags": ["giants", "ancient-kingdom", "void-century", "oars", "lore"]
  }
]
