[
  {
    "name": {
      "english": "Bentham",
      "japanese": "ベンサム",
      "romanized": "Bensamu",
      "aliases": ["Mr. 2 Bon Clay", "Mr. 2", "Bon Clay", "Bon Kurei", "Bon-chan"]
    },
    "episodeAppearances": [451],
    "keyMoments": [
      {
        "episodeNumber": 451,
        "eventId": "ep451-event-004",
        "momentType": "MAJOR_DECISION",
        "title": "Decides to Sacrifice Himself for Luffy",
        "description": "Bentham volunteers to stay behind at the Gate of Justice to operate the controls, knowing he will be left in Impel Down with no chance of escape. He makes this choice willingly to save Luffy and the 241 other escaped prisoners.",
        "significance": "Represents the culmination of Bentham's character development from Baroque Works villain to selfless hero willing to sacrifice everything for friendship.",
        "timestamp": "11:20",
        "quote": "Luffy-boy, make sure you save your brother!"
      },
      {
        "episodeNumber": 451,
        "eventId": "ep451-event-005",
        "momentType": "POWER_REVEAL",
        "title": "Uses Mane Mane no Mi to Disguise as Magellan",
        "description": "Bentham transforms into Warden Magellan using his Clone-Clone Fruit powers to access the Gate of Justice control room and operate the mechanism without raising alarm.",
        "significance": "Critical use of his Devil Fruit ability that enables the entire prison break to succeed. Shows how his unique power becomes the key to saving hundreds of lives.",
        "timestamp": "14:35",
        "quote": ""
      },
      {
        "episodeNumber": 451,
        "eventId": "ep451-event-006",
        "momentType": "CULTURAL_MOMENT",
        "title": "Opens the Gate of Justice",
        "description": "Bentham successfully operates the control panel to open the Gate of Justice, then destroys the mechanism to ensure it cannot be closed again. This action seals his own fate while guaranteeing the prisoners' freedom.",
        "significance": "The pivotal heroic action that saves everyone. Destroying the mechanism shows Bentham's total commitment to others' freedom over any possibility of his own escape.",
        "timestamp": "16:50",
        "quote": ""
      },
      {
        "episodeNumber": 451,
        "eventId": "ep451-event-008",
        "momentType": "CULTURAL_MOMENT",
        "title": "Declaration of No Regrets",
        "description": "When Magellan asks for his final words, Bentham proudly declares he has no regrets. Despite sobbing, he remains defiant and resolute, encouraging Luffy one last time to save Ace.",
        "significance": "Embodies the One Piece philosophy of living without regrets while staying true to one's values and bonds. One of the most emotionally powerful moments in the entire series.",
        "timestamp": "19:30",
        "quote": "I have no regrets!"
      },
      {
        "episodeNumber": 451,
        "eventId": "ep451-event-007",
        "momentType": "BATTLE_START",
        "title": "Confronts Magellan in Final Stand",
        "description": "The real Magellan discovers Bentham in the control room and confronts him. Bentham drops his disguise and faces the Warden directly, knowing he cannot win but refusing to flee or back down.",
        "significance": "Represents Bentham's courage and acceptance of the consequences of his choice. Facing Impel Down's most powerful figure alone shows his willingness to pay the ultimate price for friendship.",
        "timestamp": "18:15",
        "quote": ""
      }
    ],
    "status": "ALIVE",
    "statusHistory": [
      {
        "status": "CAPTURED",
        "episodeStart": 451,
        "episodeEnd": 666,
        "note": "Left behind in Impel Down after sacrificing himself to open the Gate of Justice"
      }
    ],
    "reveals": [
      {
        "infoType": "CHARACTER_TRAIT",
        "information": "Bentham's ultimate loyalty to Luffy and willingness to sacrifice his own freedom and life for his friend's sake",
        "episodeRevealed": 451,
        "severity": "CRITICAL"
      },
      {
        "infoType": "FATE",
        "information": "Bentham remains in Impel Down after opening the Gate of Justice, facing Magellan in what appears to be a final confrontation",
        "episodeRevealed": 451,
        "severity": "CRITICAL"
      }
    ],
    "relationships": [
      {
        "targetCharacterId": "luffy",
        "relationshipType": "FRIEND",
        "description": "Bentham's bond with Luffy has grown so strong that he willingly sacrifices his freedom and potentially his life to help Luffy escape Impel Down and reach Ace.",
        "episodeEstablished": 127,
        "evolutionMoments": [
          {
            "episodeNumber": 451,
            "description": "Bentham makes the ultimate sacrifice, staying behind to open the Gate of Justice so Luffy and others can escape, demonstrating the depth of his loyalty and friendship.",
            "newRelationshipType": "FRIEND"
          }
        ]
      },
      {
        "targetCharacterId": "magellan",
        "relationshipType": "ENEMY",
        "description": "Bentham faces Magellan in the control room after opening the Gate of Justice. Magellan, enraged by the deception and prison break, confronts Bentham who defies him with pride.",
        "episodeEstablished": 425,
        "evolutionMoments": [
          {
            "episodeNumber": 451,
            "description": "Bentham directly confronts Magellan after being discovered in the control room, accepting the consequences of his actions while declaring he has no regrets.",
            "newRelationshipType": "ENEMY"
          }
        ]
      }
    ],
    "abilities": [
      {
        "abilityName": "Mane Mane no Mi (Clone-Clone Fruit)",
        "abilityType": "DEVIL_FRUIT",
        "episodeFirstUsed": 127,
        "description": "Allows Bentham to perfectly transform into anyone he has touched, copying their appearance, voice, and body completely. Used in this episode to disguise as Magellan."
      }
    ],
    "voiceActors": {
      "japanese": "Kazuki Yao",
      "english": "Barry Yandell"
    }
  }
]
