[
  {
    "name": {
      "english": "Gate of Justice",
      "japanese": "正義の門",
      "romanized": "Seigi no Mon"
    },
    "episodeAppearances": [451],
    "locationType": "GOVERNMENT_FACILITY",
    "firstMentioned": 375,
    "keyEvents": [
      {
        "episodeNumber": 451,
        "eventId": "ep451-event-003",
        "eventType": "LOCATION_ARRIVAL",
        "title": "Gate Blocks Escape Route",
        "description": "The escaped prisoners arrive at the massive Gate of Justice, finding it closed and blocking their path to freedom. The gate serves as the final barrier between Impel Down and the open sea.",
        "significance": "Creates the critical obstacle that necessitates Bentham's sacrifice. The gate's closure represents the seemingly impossible barrier to freedom.",
        "timestamp": "08:45"
      },
      {
        "episodeNumber": 451,
        "eventId": "ep451-event-006",
        "eventType": "CULTURAL_MOMENT",
        "title": "Bentham Opens the Gate",
        "description": "Bentham, disguised as Magellan, operates the control room mechanism to open the Gate of Justice. He then destroys the controls to prevent the gate from being closed again.",
        "significance": "The pivotal moment that enables the escape of 241 prisoners from Impel Down. The destruction of the mechanism symbolizes burning bridges and the irreversibility of Bentham's sacrifice.",
        "timestamp": "16:50"
      },
      {
        "episodeNumber": 451,
        "eventId": "ep451-event-007",
        "eventType": "BATTLE_START",
        "title": "Magellan Confronts Bentham in Control Room",
        "description": "The Gate of Justice control room becomes the setting for the confrontation between the real Magellan and Bentham, who has just opened the gate for the prisoners.",
        "significance": "The control room serves as the stage for Bentham's final stand, where he faces the consequences of his heroic choice.",
        "timestamp": "18:15"
      }
    ],
    "geography": {
      "region": "Grand Line",
      "island": null,
      "sea": "Tarai Current",
      "climate": "Ocean waters between Impel Down, Enies Lobby, and Marineford"
    },
    "significance": "The Gates of Justice are three massive gates that form a triangle connecting the World Government's three key strongholds: Impel Down (prison), Enies Lobby (judiciary), and Marineford (Marine Headquarters). They control the Tarai Current, allowing rapid transit between these facilities while keeping them secure from outside intrusion.",
    "controlledBy": "World Government",
    "statusChanges": [
      {
        "status": "Gate opened and control mechanism destroyed",
        "episodeNumber": 451,
        "description": "Bentham opened the gate and destroyed the control mechanism, allowing prisoners to escape and preventing the gate from being immediately closed",
        "permanence": "TEMPORARY"
      }
    ],
    "reveals": [
      {
        "infoType": "FUNCTION",
        "information": "The Gate of Justice can be operated from a control room, and destroying the mechanism prevents it from being closed again",
        "episodeRevealed": 451,
        "severity": "MAJOR"
      },
      {
        "infoType": "SECURITY",
        "information": "Access to the control room requires authorization, which Bentham bypasses by disguising as Warden Magellan",
        "episodeRevealed": 451,
        "severity": "MAJOR"
      }
    ]
  }
]
