[
  {
    "id": "crocodile-motivation-theory-001",
    "title": "Crocodile's Anti-World Government Motivation",
    "theory": "Crocodile saved Ace from execution not out of any loyalty to Whitebeard or his crew, but purely out of his deep-seated hatred for the World Government. By preventing Ace's execution, he denies the Marines and World Government their victory, which is more important to him than his personal rivalry with Whitebeard. This theory suggests Crocodile's actions at Marineford are driven entirely by spite against the WG rather than any positive motivation.",
    "author": "Moon Gothic",
    "source": "https://moongothic.tumblr.com/post/763361129096527873/re-analyzing-crocodile-in-marineford-from-two",
    "platform": "Tumblr",
    "dateProposed": null,
    "episodesSpanned": [475, 476],
    "spoilerWarning": "MAJOR",
    "relatedCharacters": ["crocodile", "ace", "sengoku"],
    "relatedEvents": ["ep475-event-004"],
    "supportingEvidence": [
      "Crocodile explicitly states he doesn't want the Marines to taste victory",
      "Crocodile confirms to Doflamingo that he hasn't taken Whitebeard's side",
      "Crocodile's history of opposition to the World Government throughout the series"
    ],
    "popularity": "MODERATE",
    "canonStatus": "UNCONFIRMED"
  },
  {
    "id": "crocodile-motivation-theory-002",
    "title": "Crocodile Helps for Luffy's Sake",
    "theory": "An alternative theory suggests that Crocodile saved Ace not for spite against the World Government or for Whitebeard, but for Luffy's sake. Having witnessed Luffy's desperation and the extraordinary efforts he goes to for his loved ones throughout Impel Down and Marineford, Crocodile may have developed a reluctant respect for Luffy's determination. By saving Ace, Crocodile indirectly helps Luffy achieve his goal, possibly recognizing something admirable in Luffy's unwavering loyalty to his brother.",
    "author": "Midnight in Town",
    "source": "https://www.tumblr.com/midnight-in-town/736228049420419072/my-take-on-sir-crocodiles-past-including-the",
    "platform": "Tumblr",
    "dateProposed": null,
    "episodesSpanned": [475, 476],
    "spoilerWarning": "MAJOR",
    "relatedCharacters": ["crocodile", "luffy", "ace"],
    "relatedEvents": ["ep475-event-004"],
    "supportingEvidence": [
      "Crocodile worked alongside Luffy during the Impel Down breakout",
      "Crocodile has protected Luffy on multiple occasions during Marineford",
      "Crocodile seems to have developed some level of respect for Luffy's conviction"
    ],
    "popularity": "MODERATE",
    "canonStatus": "UNCONFIRMED"
  },
  {
    "id": "crocodile-motivation-theory-003",
    "title": "The CrocoParent Theory Connection",
    "theory": "A more speculative theory connects Crocodile's actions to the 'CrocoParent' theory - the idea that Crocodile might be Luffy's biological parent (possibly having been transformed from female to male by Ivankov's powers). Under this theory, Crocodile's intervention to save Ace occurs after learning that Luffy is Dragon's son, making Ace important to Crocodile's own child. This would explain why Crocodile helps both Ace and Luffy at Marineford despite having no obvious reason to do so. The theory suggests Crocodile's protective actions stem from a hidden parental connection.",
    "author": "Juhavs",
    "source": "https://www.tumblr.com/juhavs/655541081856933888",
    "platform": "Tumblr",
    "dateProposed": null,
    "episodesSpanned": [430, 460, 475, 476],
    "spoilerWarning": "MAJOR",
    "relatedCharacters": ["crocodile", "luffy", "ace", "ivankov", "dragon"],
    "relatedEvents": ["ep475-event-004"],
    "supportingEvidence": [
      "Ivankov's mysterious knowledge about Crocodile's past that keeps him in line",
      "Crocodile's protective actions toward Luffy during Marineford",
      "The timing of Crocodile's intervention coinciding with when he would know about Luffy's heritage",
      "Crocodile saving Ace benefits Luffy, who he has no obvious reason to help"
    ],
    "popularity": "HIGH",
    "canonStatus": "SPECULATIVE"
  }
]
