[
  {
    "id": "theory-ep030-001",
    "title": "Sanji's All Blue Dream Connected to the Destruction of the Red Line",
    "summary": "A popular fan theory suggests that the All Blue doesn't currently exist but will be created when the Red Line is destroyed at the end of the series, causing all four seas to meet.",
    "fullText": "Fans have theorized that Sanji's dream of finding the All Blue is intrinsically connected to the series' endgame. The theory posits that the All Blue doesn't exist yet because the Red Line separates the seas. When Luffy achieves his dream and the world changes (potentially destroying the Red Line), all four seas will meet, creating the All Blue that Sanji seeks. This would mean all the Straw Hats' dreams are interconnected and will be fulfilled together at the series' conclusion.",
    "author": "Reddit/YouTube One Piece Theory Community",
    "source": {
      "url": "https://www.reddit.com/r/OnePiece/",
      "title": "All Blue Theory - Red Line Destruction",
      "platform": "Reddit",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2020-01-15",
    "episodeRange": [30, 1100],
    "minEpisode": 30,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": 5000,
      "comments": 800,
      "shares": 200
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["sanji", "luffy"],
    "relatedLocations": ["all-blue"],
    "relatedEvents": ["ep030-event-002"],
    "tags": ["all-blue", "red-line", "endgame", "dreams"]
  },
  {
    "id": "theory-ep030-002",
    "title": "Sanji and Zeff's Shared Past with the All Blue Legend",
    "summary": "A theory exploring the deeper connection between Sanji and Zeff's shared dream, suggesting that Zeff may have actually found clues to the All Blue's location during his Grand Line journey.",
    "fullText": "Some fans theorize that Zeff's journey through the Grand Line wasn't just about piracy but a genuine search for the All Blue. The theory suggests that Zeff may have discovered important clues or partial information about the All Blue's existence before his crew was destroyed. By passing his dream to Sanji in Episode 30, Zeff is not just inspiring him but potentially passing along secret knowledge that will prove crucial to finding the legendary sea. This would explain why Zeff is so insistent that Sanji pursue this particular dream.",
    "author": "One Piece Theory Forums",
    "source": {
      "url": "https://theoryforum.example.com/sanji-zeff-all-blue",
      "title": "Zeff's Hidden Knowledge of All Blue",
      "platform": "Theory Forum",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2019-06-10",
    "episodeRange": [20, 30],
    "minEpisode": 20,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 30
    },
    "popularity": {
      "upvotes": 1200,
      "comments": 300,
      "shares": 50
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["sanji", "zeff"],
    "relatedLocations": ["all-blue", "grand-line"],
    "relatedEvents": ["ep030-event-002", "ep030-event-005"],
    "tags": ["all-blue", "zeff", "backstory", "grand-line"]
  },
  {
    "id": "theory-ep030-003",
    "title": "The Number 13 Straw Hats Theory and Sanji's Joining Order",
    "summary": "A broader theory about the eventual size of the Straw Hat crew that includes analyzing Sanji's position as the fourth member and his significance in the crew's ultimate formation.",
    "fullText": "A popular fan theory suggests the Straw Hat Pirates will ultimately have 13 members (including Luffy). This theory gained traction when Oda assigned Chinese zodiac animals to each crew member, with only the rat, rabbit, and dragon remaining unassigned. Sanji, as the fourth member to join in Episode 30, represents an important position in this structure. His role as the cook who fights establishes a pattern of dual-purpose crew members that continues throughout the series. The theory analyzes how each member's joining order and role contributes to the crew's eventual completion.",
    "author": "Reddit r/OnePiece Community",
    "source": {
      "url": "https://www.reddit.com/r/OnePiece/",
      "title": "13 Straw Hats Theory - Complete Crew Analysis",
      "platform": "Reddit",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2021-03-20",
    "episodeRange": [1, 1100],
    "minEpisode": 1,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": 8000,
      "comments": 1500,
      "shares": 400
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["luffy", "sanji", "zoro", "nami", "usopp"],
    "relatedLocations": [],
    "relatedEvents": ["ep030-event-007"],
    "tags": ["straw-hats", "crew-formation", "chinese-zodiac", "recruitment"]
  }
]
