[
  {
    "id": "straw-hat-pirates",
    "name": {
      "english": "Straw Hat Pirates",
      "japanese": "麦わらの一味",
      "romanized": "Mugiwara no Ichimi"
    },
    "episodeAppearances": [38],
    "keyMoments": [
      {
        "episodeNumber": 38,
        "eventId": "ep038-event-001",
        "momentType": "BATTLE_START",
        "title": "Assault on Arlong Park",
        "description": "The Straw Hat Pirates launch their assault on Arlong Park, with all active members (Luffy, Zoro, Sanji, and Usopp) charging into battle against the fish-men to save Nami.",
        "significance": "The crew's first major coordinated assault as a team, demonstrating their unity and commitment to saving one of their own. Each member takes on a specific opponent in a multi-front battle.",
        "timestamp": "03:45"
      },
      {
        "episodeNumber": 38,
        "eventId": "ep038-event-013",
        "momentType": "PROPHECY_FORESHADOWING",
        "title": "Fighting to Save Their Captain",
        "description": "With Luffy drowning, the crew must each win their individual battles against Arlong's officers quickly or their captain will die. This tests their abilities to function independently while working toward a common goal.",
        "significance": "Demonstrates the crew's interdependence and trust. Each member must succeed in their role for the crew to survive as a whole.",
        "timestamp": "21:50"
      }
    ]
  },
  {
    "id": "arlong-pirates",
    "name": {
      "english": "Arlong Pirates",
      "japanese": "アーロン一味",
      "romanized": "Āron Ichimi"
    },
    "episodeAppearances": [38],
    "keyMoments": [
      {
        "episodeNumber": 38,
        "eventId": "ep038-event-001",
        "momentType": "BATTLE_START",
        "title": "Defense of Arlong Park",
        "description": "The Arlong Pirates face the Straw Hat crew's assault on their headquarters. Most lower-ranking members are defeated by Luffy's Kazaguruma, leaving only Arlong and his three officers (Kuroobi, Hatchan, and Chew) to fight.",
        "significance": "Shows the hierarchy within the Arlong Pirates and establishes that only the elite officers can match the Straw Hats in combat.",
        "timestamp": "03:45"
      },
      {
        "episodeNumber": 38,
        "eventId": "ep038-event-004",
        "momentType": "MAJOR_DECISION",
        "title": "Arlong's Tactical Trap",
        "description": "Under Arlong's leadership, the fish-men exploit Luffy's vulnerability by throwing him into the pool, creating a psychological and tactical advantage by forcing the Straw Hats to fight while their captain drowns.",
        "significance": "Demonstrates Arlong's cruel intelligence and tactical thinking as a captain, using his crew's natural advantages (fish-men in water) to maximum effect.",
        "timestamp": "08:15"
      }
    ]
  }
]
