[
  {
    "id": "arlong-park",
    "name": {
      "english": "Arlong Park",
      "japanese": "アーロンパーク",
      "romanized": "Āron Pāku"
    },
    "episodeAppearances": [38],
    "keyEvents": [
      {
        "episodeNumber": 38,
        "eventId": "ep038-event-001",
        "eventType": "BATTLE_START",
        "title": "Straw Hats vs Arlong Pirates Battle Begins",
        "description": "The Straw Hat crew launches their assault on Arlong Park, beginning the climactic battle against the fish-men to save Nami.",
        "significance": "The location becomes the battleground for the arc's final confrontation, where multiple simultaneous battles take place.",
        "timestamp": "03:45"
      },
      {
        "episodeNumber": 38,
        "eventId": "ep038-event-004",
        "eventType": "MAJOR_DECISION",
        "title": "Luffy Thrown Into Pool",
        "description": "Arlong throws Luffy into the pool at Arlong Park with concrete attached to his feet, creating the episode's central crisis.",
        "significance": "The pool becomes a critical location element, serving as both a death trap for Luffy and a demonstration of the fish-men's tactical advantage.",
        "timestamp": "08:15"
      },
      {
        "episodeNumber": 38,
        "eventId": "ep038-event-013",
        "eventType": "PROPHECY_FORESHADOWING",
        "title": "Multi-Front Battle Unfolds",
        "description": "Arlong Park becomes the site of three simultaneous officer battles (Sanji vs Kuroobi, Zoro vs Hatchan, Usopp vs Chew) while Luffy drowns in the pool and villagers watch from outside.",
        "significance": "The location's layout enables the complex multi-front battle structure that defines this phase of the arc.",
        "timestamp": "21:50"
      }
    ],
    "description": "Arlong Park is the headquarters of the Arlong Pirates, an imposing structure with a large pool and multiple battle areas. It serves as the main battleground for the Straw Hats' assault to free Nami and the villagers from Arlong's tyranny."
  }
]
