[
  {
    "id": "theory-ep341-001",
    "title": "Sanji's True Motivation for Wanting the Clear-Clear Fruit",
    "theorist": "One Piece Community",
    "platform": "Multiple Forums/Reddit",
    "dateProposed": "2008-02-03",
    "episodesSpanned": [341, 342, 343, 362, 366],
    "spoilerStatus": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 366,
      "spoilerDescription": "Involves Sanji's fight with Absalom later in the arc"
    },
    "theoryText": "When Sanji learns that Absalom has the Clear-Clear Fruit (Suke Suke no Mi), he becomes furious not just because Nami is in danger, but because Absalom possesses the Devil Fruit that Sanji has always wanted. The theory explores whether Sanji's anger is more about losing the fruit he desired for voyeuristic purposes or genuine concern for Nami's safety. This becomes a point of character analysis and debate about whether Oda intentionally made Sanji's pervert trait too prominent, potentially damaging his character.",
    "evidence": [
      "Sanji explicitly states he has always wanted the Clear-Clear Fruit in Episode 341-342 range",
      "Sanji admits he would use the invisibility to spy on women",
      "His anger when fighting Absalom has dual motivations"
    ],
    "debunked": false,
    "canonStatus": "PARTIALLY_CONFIRMED",
    "popularity": {
      "discussionCount": "High",
      "supportPercentage": 70,
      "note": "Widely discussed as a controversial character moment"
    },
    "relatedTheories": [],
    "sources": [
      {
        "url": "https://fandomwire.com/absolutely-killed-all-the-momentum-eiichiro-oda-may-have-gone-too-far-in-thriller-bark-arc-to-ruin-sanji-with-the-worst-running-gag/",
        "title": "Eiichiro Oda May Have Gone Too Far in Thriller Bark Arc to Ruin Sanji",
        "platform": "FandomWire",
        "accessedAt": "2025-11-19"
      }
    ]
  },
  {
    "id": "theory-ep341-002",
    "title": "Absalom's Fruit Later Goes to Shiryu - Foreshadowing",
    "theorist": "One Piece Theorists",
    "platform": "Reddit/Forums",
    "dateProposed": "2019-01-01",
    "episodesSpanned": [341, 925],
    "spoilerStatus": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 925,
      "spoilerDescription": "ULTRA SECRET - Spoils Absalom's death and Shiryu gaining his fruit"
    },
    "theoryText": "Some fans theorized after Absalom's introduction that his Clear-Clear Fruit would eventually be taken by the Blackbeard Pirates, as the fruit's power is too valuable to remain with a mid-tier antagonist. This theory was later confirmed when it was revealed that Absalom was killed by the Blackbeard Pirates and his fruit was given to Shiryu. The early introduction of this fruit's power in Episode 341 serves as long-term setup for this eventual power transfer.",
    "evidence": [
      "Absalom's fruit is shown to be extremely powerful but underutilized",
      "The Blackbeard Pirates are known to hunt Devil Fruit users",
      "Shiryu later appears with the Clear-Clear Fruit"
    ],
    "debunked": false,
    "canonStatus": "CONFIRMED",
    "popularity": {
      "discussionCount": "Moderate",
      "supportPercentage": 100,
      "note": "Theory was confirmed in later chapters/episodes"
    },
    "relatedTheories": [],
    "sources": [
      {
        "url": "https://gamerant.com/one-piece-shiryus-suke-suke-no-mi-explained/",
        "title": "One Piece: Shiryu's Suke Suke no Mi, Explained",
        "platform": "GameRant",
        "accessedAt": "2025-11-19"
      }
    ]
  },
  {
    "id": "theory-ep341-003",
    "title": "The Absalom-Nami Scene as Commentary on Vulnerability",
    "theorist": "Analytical Fans",
    "platform": "Tumblr/Blog Posts",
    "dateProposed": "2016-04-10",
    "episodesSpanned": [341, 362, 366],
    "spoilerStatus": {
      "containsSpoilers": false,
      "maxEpisodeSpoiler": 366,
      "spoilerDescription": "Only involves Thriller Bark arc events"
    },
    "theoryText": "Some fans have theorized that the controversial bathroom attack scene in Episode 341 was meant to establish serious stakes and demonstrate the genuine danger the crew faces when separated, rather than being played purely for fanservice. The theory suggests Oda intended to show that even powerful crew members like Nami can be vulnerable to unexpected threats, making the crew's later triumph more meaningful. However, critics argue the execution undermined this intent by framing the assault with comedic elements.",
    "evidence": [
      "Nami successfully defends herself by kicking Absalom",
      "Usopp and Chopper immediately rush to her defense",
      "The scene leads to genuine character development and motivation for later confrontation"
    ],
    "debunked": false,
    "canonStatus": "UNCONFIRMED",
    "popularity": {
      "discussionCount": "High",
      "supportPercentage": 40,
      "note": "Heavily debated with mixed interpretations"
    },
    "relatedTheories": [],
    "sources": [
      {
        "url": "https://theadultswimsquad.wordpress.com/2016/04/10/one-piece-episode-341-recap/",
        "title": "One Piece Episode 341 Recap",
        "platform": "Swim Squad Blog",
        "accessedAt": "2025-11-19"
      }
    ]
  }
]
