[
  {
    "id": "theory-ep604-001",
    "title": "Gomu Gomu no UFO Foreshadows Uranus Ancient Weapon",
    "summary": "The Gomu Gomu no UFO technique that debuts in this episode may foreshadow Luffy's eventual ability to fly and rain down attacks from the sky, potentially connecting to the ancient weapon Uranus.",
    "fullText": "Fans have theorized that Luffy's UFO attack, which allows him to hover and spin in the air, could be early foreshadowing of his awakened abilities. The theory suggests that Uranus, the ancient weapon named after the God of the Sky, would be a flying weapon capable of powerful attacks from above. Post-awakening, Luffy could potentially fly while bombarding enemies below with powerful attacks. The UFO technique's helicopter-like spinning motion and aerial positioning may have been Oda subtly hinting at Luffy's future sky-based combat abilities. This theory gained more traction after Gear 5's reveal showed Luffy's cartoon-like physics-defying abilities.",
    "author": "Various One Piece Theory Forums",
    "source": {
      "url": "https://worstgen.alwaysdata.net/forum/threads/luffys-awakened-gear-5-form-is-uranus.21385/",
      "title": "Luffy's Awakened Gear 5 form is Uranus",
      "platform": "Worstgen Forums",
      "accessedAt": "2026-01-04"
    },
    "postedDate": "2020-06-15",
    "episodeRange": [604, 1071],
    "minEpisode": 604,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1071
    },
    "popularity": {
      "upvotes": 89,
      "comments": 156,
      "shares": 23
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["luffy"],
    "relatedLocations": [],
    "relatedEvents": ["ep604-event-005"],
    "tags": ["gomu-gomu-no-mi", "luffy", "gear-5", "awakening", "ancient-weapon", "uranus", "foreshadowing"]
  },
  {
    "id": "theory-ep604-002",
    "title": "G-5 Marines Redemption Arc Theory",
    "summary": "The G-5 Marines' cooperation with the Straw Hats and their willingness to sacrifice themselves represents a redemption arc for marines who were previously portrayed as brutal and corrupt.",
    "fullText": "The G-5 Marines were initially introduced as one of the most brutal and lawless Marine units, known for their violence and disregard for proper conduct. However, during the Punk Hazard arc (particularly around episode 604-606), fans noticed a significant shift in their portrayal. The theory suggests that Oda intentionally set up the G-5 Marines as seemingly villainous to make their later sacrifice and cooperation with the Straw Hats more impactful. Their willingness to seal the breach, protect their captain Tashigi, and ally with pirates to save children shows that even 'bad' Marines can have honor and compassion. This serves the broader One Piece theme that good and evil aren't defined by faction but by individual choices and morality. The sacrifice scenes in episodes 605-606 (set up by episode 604's cooperation) became some of the most emotionally powerful moments for characters initially presented as antagonists.",
    "author": "One Piece Fandom Discussion",
    "source": {
      "url": "https://neverwatchedonepiece.tumblr.com/post/181649593839/605-606-tashigis-tears-g-5s-desperate",
      "title": "605-606: Tashigi's Tears! G-5's Desperate",
      "platform": "Tumblr",
      "accessedAt": "2026-01-04"
    },
    "postedDate": "2019-03-10",
    "episodeRange": [579, 610],
    "minEpisode": 579,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 610
    },
    "popularity": {
      "upvotes": 234,
      "comments": 87,
      "shares": 41
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["smoker", "tashigi", "g5-marines"],
    "relatedLocations": ["punk-hazard-laboratory"],
    "relatedEvents": ["ep604-event-002", "ep604-event-009"],
    "tags": ["g5-marines", "redemption", "sacrifice", "punk-hazard", "character-development", "theme"]
  },
  {
    "id": "theory-ep604-003",
    "title": "Law's Two-Hour Deadline and SAD Factory Plan",
    "summary": "Law's specific two-hour deadline mentioned in episode 604 is theorized to be the exact time needed for him to destroy Caesar's SAD production facility, which is part of his larger plan against Doflamingo.",
    "fullText": "When Law tells everyone they have two hours before he makes the facility unsafe, fans theorized this wasn't arbitrary. Law's ultimate goal in the Punk Hazard arc was to destroy Caesar's SAD production to cut off Doflamingo's SMILE supply and disrupt Kaido's army. The two-hour deadline likely corresponds to the time Law calculated for: (1) getting everyone to safety, (2) capturing Caesar, and (3) destroying the SAD production facility. This shows Law's meticulous planning - he had already calculated every step of his plan before revealing the escape route. The theory was later confirmed as Law did indeed plan to destroy the facility, and his time management throughout the arc proved remarkably precise. Episode 604's revelation of the two-hour window was the first clear indication that Law had a specific, timed plan beyond just escape.",
    "author": "Reddit One Piece Theorists",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Punk_Hazard_Arc",
      "title": "Punk Hazard Arc",
      "platform": "One Piece Wiki",
      "accessedAt": "2026-01-04"
    },
    "postedDate": "2013-07-20",
    "episodeRange": [604, 625],
    "minEpisode": 604,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 625
    },
    "popularity": {
      "upvotes": 567,
      "comments": 203,
      "shares": 89
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["law", "caesar-clown", "doflamingo"],
    "relatedLocations": ["punk-hazard-laboratory", "building-r"],
    "relatedEvents": ["ep604-event-003"],
    "tags": ["law", "plan", "sad-factory", "doflamingo", "strategy", "punk-hazard"]
  }
]
