[
  {
    "name": {
      "english": "Venom-Venom Fruit",
      "japanese": "ドクドクの実",
      "romanized": "Doku Doku no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 425,
    "debutChapter": 528,
    "description": "A Paramecia-type Devil Fruit that grants the user the ability to produce and control all different types of poison, as well as grants absolute immunity to poison, making the user a Poison Human. The poison can range from mild irritants to highly corrosive, deadly toxins.",
    "episodeAppearances": [425],
    "users": [
      {
        "characterId": "magellan",
        "episodeStart": 425,
        "episodeEnd": "present",
        "circumstances": "Magellan is revealed to be the user of this Devil Fruit, having consumed it before his debut."
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Poison Breath",
        "episodeRevealed": 425,
        "description": "Magellan exhales poisonous smoke that immediately affects those who breathe it in. The poison is quick-acting and requires antidotes to counter its effects.",
        "severity": "MAJOR",
        "firstUseContext": "Magellan uses poison breath to attack Hannyabal for his insubordinate comments, demonstrating the power's potency."
      },
      {
        "abilityName": "Poison Immunity",
        "episodeRevealed": 425,
        "description": "The user has absolute immunity to all forms of poison, making poison-based attacks completely ineffective against them.",
        "severity": "MAJOR",
        "firstUseContext": "Mentioned as an inherent ability of the Doku Doku no Mi when Domino explains Magellan's powers to Hancock."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 425,
        "severity": "MAJOR"
      },
      {
        "weakness": "Consuming poisoned food causes severe digestive issues",
        "episodeRevealed": 425,
        "severity": "MINOR"
      }
    ],
    "strengths": [
      {
        "strength": "Can create poisons ranging from mild irritants to deadly toxins",
        "episodeRevealed": 425,
        "description": "The fruit allows creation of various poison types with different potency levels.",
        "severity": "MAJOR"
      },
      {
        "strength": "Absolute poison immunity",
        "episodeRevealed": 425,
        "description": "User is completely immune to all forms of poison.",
        "severity": "MAJOR"
      },
      {
        "strength": "Quick-acting poison that requires immediate antidotes",
        "episodeRevealed": 425,
        "description": "The poison works almost instantly, as shown when Hannyabal needed an immediate antidote.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "HIGH"
  }
]
