[
  {
    "name": {
      "english": "Return-Return Fruit",
      "japanese": "モドモドの実",
      "romanized": "Modo Modo no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 577,
    "debutChapter": null,
    "episodeAppearances": [577],
    "currentUser": {
      "characterId": "ain",
      "episodeAcquired": null,
      "episodeLost": null
    },
    "previousUsers": [],
    "description": "A Paramecia-type Devil Fruit that grants the user the ability to generate pink energy which returns anyone and anything twelve years younger, making the user a Return Return Human.",
    "awakening": {
      "isAwakened": false,
      "episodeAwakened": null,
      "awakeningAbilities": []
    },
    "abilities": [
      {
        "abilityName": "Modo Modo Shot",
        "description": "Ain shoots an energy ball at a target that returns it to how it was twelve years ago. Can affect living beings and inanimate objects.",
        "episodeFirstUsed": 577,
        "limitations": "The effects are undone if the user is rendered unconscious. Each touch or hit regresses the target by exactly twelve years.",
        "combatApplications": [
          "Can revert enemies to weaker, younger states",
          "Can turn solid ground back into magma if it solidified within twelve years",
          "Repeated applications can eventually regress targets to non-existence"
        ]
      },
      {
        "abilityName": "Age Regression Touch",
        "description": "Physical contact spreads pink energy throughout the target's body, reversing their age by twelve years.",
        "episodeFirstUsed": 577,
        "limitations": "Requires direct contact with the target",
        "combatApplications": [
          "Close-range age manipulation",
          "Can weaken opponents by making them younger and less experienced"
        ]
      }
    ],
    "strengths": [
      "Can affect both living beings and inanimate objects",
      "Extremely versatile in combat applications",
      "Can potentially eliminate opponents by regressing them to non-existence",
      "Can manipulate the battlefield by reverting terrain"
    ],
    "weaknesses": [
      "Standard Devil Fruit weakness to seawater and Seastone",
      "Effects are reversed if user becomes unconscious",
      "Fixed twelve-year regression increment",
      "Requires either contact or successful projectile hit"
    ],
    "keyMoments": [
      {
        "episodeNumber": 577,
        "eventId": "ep577-event-007",
        "momentType": "POWER_REVEAL",
        "title": "First Demonstration in TV Anime",
        "description": "Ain uses Modo Modo Shot to revert solid ground back to magma during her five-hour battle with Shuzo, demonstrating the tactical versatility of the fruit.",
        "significance": "First appearance and demonstration of the Modo Modo no Mi's powers in the One Piece TV anime.",
        "timestamp": "16:00"
      }
    ],
    "trivia": [
      {
        "fact": "The Modo Modo no Mi is a non-canon Devil Fruit created specifically for One Piece Film: Z and its prologue arc.",
        "category": "PRODUCTION",
        "sources": []
      },
      {
        "fact": "The fruit's ability to revert things exactly twelve years is highly specific, suggesting it may have limitations that prevent arbitrary time manipulation.",
        "category": "POWER_MECHANICS",
        "sources": []
      },
      {
        "fact": "Ain's use of the fruit to turn solid ground back to magma during her battle with Shuzo demonstrates creative environmental manipulation beyond simple age regression of living beings.",
        "category": "COMBAT_APPLICATION",
        "sources": []
      }
    ]
  },
  {
    "name": {
      "english": "Mini-Mini Fruit",
      "japanese": "ミニミニの実",
      "romanized": "Mini Mini no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 575,
    "debutChapter": null,
    "episodeAppearances": [577],
    "currentUser": {
      "characterId": "lily-enstomach",
      "episodeAcquired": null,
      "episodeLost": null
    },
    "previousUsers": [],
    "description": "A Paramecia-type Devil Fruit that allows the user to shrink and grow their body size from five millimeters to giant proportions while maintaining their natural strength.",
    "awakening": {
      "isAwakened": false,
      "episodeAwakened": null,
      "awakeningAbilities": []
    },
    "abilities": [
      {
        "abilityName": "Size Manipulation",
        "description": "Lily can change her body size from as small as five millimeters to her natural giant size, maintaining her giant strength regardless of current size.",
        "episodeFirstUsed": 575,
        "limitations": "Standard Devil Fruit weaknesses",
        "combatApplications": [
          "Can shrink to avoid attacks or infiltrate small spaces",
          "Can grow to giant size for maximum combat power",
          "Maintains giant strength even at tiny size"
        ]
      }
    ],
    "strengths": [
      "Extreme size versatility",
      "Maintains physical strength at all sizes",
      "Useful for stealth and infiltration when shrunk",
      "Full combat power when at giant size"
    ],
    "weaknesses": [
      "Standard Devil Fruit weakness to seawater and Seastone",
      "Cannot swim due to Devil Fruit curse"
    ],
    "keyMoments": [],
    "trivia": [
      {
        "fact": "The Mini Mini no Mi is a non-canon Devil Fruit created for the Z's Ambition Arc.",
        "category": "PRODUCTION",
        "sources": []
      },
      {
        "fact": "Despite being born a giant, Lily typically appears in shrunken form due to her Devil Fruit, making her unique among giant characters.",
        "category": "CHARACTER",
        "sources": []
      }
    ]
  }
]
