[
  {
    "name": {
      "english": "Jacket-Jacket Fruit",
      "japanese": "ジャケジャケの実",
      "romanized": "Jake Jake no Mi"
    },
    "type": "Paramecia",
    "debutEpisode": 646,
    "debutChapter": 716,
    "episodeAppearances": [646],
    "currentUser": {
      "characterId": "kelly-funk",
      "episodeObtained": null,
      "episodeLost": null
    },
    "previousUsers": [],
    "abilities": [
      {
        "abilityName": "Jacket Transformation",
        "description": "The user can transform their entire body into a jacket that can be worn by another person or creature.",
        "episodeFirstUsed": 646,
        "limitations": [
          "Requires a willing or compliant host to wear the jacket",
          "The user cannot use the ability effectively without another person",
          "Standard Devil Fruit weakness to seawater and Seastone"
        ]
      },
      {
        "abilityName": "Body Control",
        "description": "While being worn as a jacket, the user can take complete control of the wearer's body, utilizing their physical abilities and strength.",
        "episodeFirstUsed": 646,
        "limitations": [
          "Effectiveness depends on the physical capabilities of the host body"
        ]
      },
      {
        "abilityName": "Combined Strength",
        "description": "The user can combine their own speed and skill with the host's strength and physique, creating a more formidable fighter.",
        "episodeFirstUsed": 646,
        "limitations": []
      }
    ],
    "awakening": null,
    "keyMoments": [
      {
        "episodeNumber": 646,
        "eventId": "ep646-event-002",
        "momentType": "POWER_REVEAL",
        "title": "Jake Jake no Mi Revealed",
        "description": "Kelly Funk reveals his Devil Fruit power in Block C of the Corrida Colosseum, transforming into a jacket for his brother Bobby to wear.",
        "significance": "First appearance of the Jake Jake no Mi in the series, showcasing one of the more unusual Paramecia-type Devil Fruits.",
        "timestamp": "06:20"
      }
    ],
    "reveals": [
      {
        "infoType": "ABILITY",
        "information": "The Jake Jake no Mi allows the user to become a jacket that can be worn by others, granting control over the host's body",
        "episodeRevealed": 646,
        "severity": "MAJOR"
      },
      {
        "infoType": "USER",
        "information": "Kelly Funk is the current user of the Jake Jake no Mi",
        "episodeRevealed": 646,
        "severity": "MAJOR"
      },
      {
        "infoType": "APPLICATION",
        "information": "The Funk Brothers use this ability to combine Bobby's strength with Kelly's control and skill",
        "episodeRevealed": 646,
        "severity": "MINOR"
      }
    ],
    "trivia": [
      "The Jake Jake no Mi is one of the most unusual Paramecia-type Devil Fruits, as it requires cooperation with another person to be used effectively.",
      "The fruit's name comes from 'jacket' (jaketto in Japanese), following the pattern of many Paramecia fruits being named after objects or concepts.",
      "Unlike most Devil Fruits that grant individual power, the Jake Jake no Mi is specifically designed for teamwork and combination attacks."
    ]
  }
]
