[
  {
    "id": "theory-ep467-001",
    "title": "Sabo's Existence Foreshadowed by Third Sake Cup Shadow",
    "theory": "The flashback in Episode 467 showing Luffy and Ace's sake cup brotherhood ceremony subtly includes a shadow of a third cup, foreshadowing the eventual revelation of Sabo, their third brother. While the anime only barely showed this shadow, the manga version made it more visible, suggesting that Eiichiro Oda had planned Sabo's existence from early on in the series.",
    "author": "One Piece Fan Community",
    "episodesSpanned": [467, 493, 494, 504],
    "minEpisodeSpoiler": 467,
    "maxEpisodeSpoiler": 504,
    "spoilerSeverity": "MAJOR",
    "supportingEvidence": [
      "The shadow of a third sake cup visible in the manga version of the flashback",
      "Chapter 668's cover story showing three cups at Ace's grave",
      "Revelation in Chapter 731/Episode 663 that Sabo is alive"
    ],
    "debunkingEvidence": [
      "Some fans argue the shadow is too subtle in the anime to be intentional foreshadowing",
      "The anime adaptation may have de-emphasized this detail"
    ],
    "popularity": "HIGH",
    "status": "CONFIRMED",
    "sources": [
      {
        "url": "https://onepiece.fandom.com/wiki/Episode_467",
        "title": "Episode 467 - One Piece Wiki",
        "platform": "Fandom",
        "accessedAt": "2025-12-14"
      },
      {
        "url": "https://tvtropes.org/pmwiki/pmwiki.php/Foreshadowing/OnePiece",
        "title": "Foreshadowing / One Piece - TV Tropes",
        "platform": "TV Tropes",
        "accessedAt": "2025-12-14"
      }
    ],
    "tags": ["foreshadowing", "sabo", "ace", "luffy", "brotherhood"]
  },
  {
    "id": "theory-ep467-002",
    "title": "Why Whitebeard Immediately Protects Luffy After Dragon Revelation",
    "theory": "When Sengoku reveals that Luffy is Dragon's son, Whitebeard immediately orders his crew to protect Luffy. Some fans theorize that Whitebeard may have had prior knowledge or suspicions about Luffy's heritage, or that he respects Dragon and the Revolutionary Army. Others theorize that Whitebeard simply admires Luffy's determination and sees protecting him as honoring Ace's bond with his brother.",
    "author": "One Piece Fan Community",
    "episodesSpanned": [467, 468, 469, 470],
    "minEpisodeSpoiler": 467,
    "maxEpisodeSpoiler": 470,
    "spoilerSeverity": "MAJOR",
    "supportingEvidence": [
      "Whitebeard's immediate response to protect Luffy after the Dragon revelation",
      "Whitebeard's statement 'we cannot let that boy die'",
      "Whitebeard's general character as someone who protects those he considers allies"
    ],
    "debunkingEvidence": [
      "The episode shows Whitebeard is primarily moved by Luffy's determination to save Ace, not the Dragon connection",
      "Whitebeard explicitly mentions their 'common goal' of saving Ace as the reason"
    ],
    "popularity": "MEDIUM",
    "status": "DEBATED",
    "sources": [
      {
        "url": "https://www.quora.com/Why-does-Whitebeard-protect-Luffy-in-Marine-Ford",
        "title": "Why does Whitebeard protect Luffy in Marine Ford? - Quora",
        "platform": "Quora",
        "accessedAt": "2025-12-14"
      }
    ],
    "tags": ["whitebeard", "luffy", "dragon", "marineford", "character-motivation"]
  },
  {
    "id": "theory-ep467-003",
    "title": "Why Dragon Didn't Intervene at Marineford",
    "theory": "Despite his son Luffy being in grave danger at Marineford and the revelation of their relationship to the world, Dragon did not intervene in the war. Fan theories suggest: (1) Dragon respected Luffy's choice to fight his own battles, (2) Dragon interfering would have escalated the war beyond control and endangered more lives, (3) Dragon had Revolutionary Army obligations that took priority, or (4) Dragon trusted in Luffy's ability to survive.",
    "author": "One Piece Fan Community",
    "episodesSpanned": [467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483, 484, 485, 486, 487, 488, 489, 490],
    "minEpisodeSpoiler": 467,
    "maxEpisodeSpoiler": 490,
    "spoilerSeverity": "MAJOR",
    "supportingEvidence": [
      "Ivankov wondering if Dragon would come to help",
      "Dragon's previous intervention at Loguetown when Luffy was in danger",
      "Dragon's established character as someone who acts in service of a greater cause"
    ],
    "debunkingEvidence": [
      "Dragon may not have had sufficient time to reach Marineford",
      "Dragon appearing would have made the war even more catastrophic",
      "Dragon's philosophy of letting people forge their own paths"
    ],
    "popularity": "HIGH",
    "status": "DEBATED",
    "sources": [
      {
        "url": "https://onepiece.fandom.com/wiki/Marineford_Arc",
        "title": "Marineford Arc - One Piece Wiki",
        "platform": "Fandom",
        "accessedAt": "2025-12-14"
      }
    ],
    "tags": ["dragon", "luffy", "marineford", "revolutionary-army", "character-absence"]
  }
]
