[
  {
    "id": "theory-ep568-001",
    "title": "Luffy is Joy Boy's Successor and Will Fulfill the Promise",
    "summary": "Based on the Sea Kings comparing Luffy to Roger and mentioning Joy Boy's broken promise, fans theorize that Luffy is the one destined to fulfill the 800-year-old promise made with Poseidon and complete Noah's mission.",
    "fullText": "In Episode 568, the Sea Kings note that Luffy can hear their voices just like Gol D. Roger could, and they discuss Joy Boy's unfulfilled promise from the Void Century. This has led fans to theorize that Luffy represents the reincarnation or successor of Joy Boy's will, and that he will be the one to finally fulfill the ancient promise to use Noah for its intended purpose - likely to bring Fish-Man Island's inhabitants to the surface and achieve true equality between humans and fish-men. The Sea Kings asking if Noah can be repaired 'by the appointed time' suggests this event is predestined to occur during Luffy's era.",
    "author": "One Piece Community",
    "source": {
      "url": "https://gamerant.com/one-piece-ancient-weapons-could-be-connected-to-haki/",
      "title": "One Piece: How The Ancient Weapons Could Be Connected To Haki",
      "platform": "GameRant",
      "accessedAt": "2025-12-26"
    },
    "postedDate": "2024-01-15",
    "episodeRange": [568, 1100],
    "minEpisode": 568,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["luffy", "shirahoshi", "joy-boy"],
    "relatedLocations": ["noah", "fish-man-island"],
    "relatedEvents": ["ep568-event-003", "ep568-event-004"],
    "tags": ["joy-boy", "luffy", "ancient-promise", "poseidon", "noah"]
  },
  {
    "id": "theory-ep568-002",
    "title": "All Ancient Weapons Are Living Beings, Not Objects",
    "summary": "The revelation that Poseidon is Shirahoshi, a living person rather than an inanimate weapon, has led to theories that all three Ancient Weapons (Pluton, Poseidon, Uranus) might actually be people or living entities.",
    "fullText": "Episode 568 confirms that Poseidon is not a ship or weapon in the traditional sense, but rather a mermaid princess with the power to command Sea Kings. This revelation has sparked theories that the other Ancient Weapons might similarly be living beings. Some fans theorize that Pluton could be a person with shipbuilding abilities or the ability to control a legendary battleship, while Uranus might be someone with power over the skies or weather. This would align with One Piece's recurring theme that people and their inherited wills are more powerful than any object or weapon.",
    "author": "One Piece Theory Community",
    "source": {
      "url": "https://merlinsmusings.com/2025/05/15/the-living-ancient-weapons-a-quick-one-piece-fan-theory/",
      "title": "The Living Ancient Weapons: A Quick One Piece Fan Theory",
      "platform": "Merlin's Musings",
      "accessedAt": "2025-12-26"
    },
    "postedDate": "2023-06-20",
    "episodeRange": [568, 1100],
    "minEpisode": 568,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["shirahoshi"],
    "relatedLocations": [],
    "relatedEvents": ["ep568-event-002"],
    "tags": ["ancient-weapons", "poseidon", "pluton", "uranus", "theory"]
  },
  {
    "id": "theory-ep568-003",
    "title": "Poseidon's Power is Connected to Conqueror's Haki",
    "summary": "Some fans theorize that Shirahoshi's ability to command the Sea Kings might be a specialized form of Conqueror's Haki or a related power, as both involve imposing one's will on other beings.",
    "fullText": "The mechanism by which Shirahoshi commands the Sea Kings has led to speculation about its connection to Haki. Both Poseidon's power and Conqueror's Haki involve exerting one's will over other beings - Conqueror's Haki can dominate the will of weaker individuals, while Poseidon can command Sea Kings. Some theorists suggest that the Ancient Weapons might represent the ultimate evolution of different types of Haki: Poseidon as advanced Conqueror's Haki (commanding others), Pluton as advanced Armament Haki (ultimate destructive power), and Uranus as advanced Observation Haki (seeing and controlling fate/destiny).",
    "author": "One Piece Haki Theory Community",
    "source": {
      "url": "https://gamerant.com/one-piece-ancient-weapons-could-be-connected-to-haki/",
      "title": "One Piece: How The Ancient Weapons Could Be Connected To Haki",
      "platform": "GameRant",
      "accessedAt": "2025-12-26"
    },
    "postedDate": "2023-11-10",
    "episodeRange": [568, 1100],
    "minEpisode": 568,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1000
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["shirahoshi", "luffy"],
    "relatedLocations": [],
    "relatedEvents": ["ep568-event-002"],
    "tags": ["haki", "poseidon", "ancient-weapons", "conquerors-haki"]
  },
  {
    "id": "theory-ep568-004",
    "title": "Noah Will Be Used to Bring Fish-Men to the Surface",
    "summary": "The theory that Noah's true purpose is to transport the citizens of Fish-Man Island to the surface world, finally achieving the equality and coexistence that Queen Otohime dreamed of.",
    "fullText": "Episode 568 establishes that Noah has a specific purpose tied to a promise made 800 years ago between Joy Boy and Poseidon. Given Queen Otohime's dream of fish-men living peacefully on the surface and the recurring theme of Fish-Man Island being in danger of destruction, many fans theorize that Noah is meant to be an ark that will transport Fish-Man Island's inhabitants to the surface. The Sea Kings' ability to pull Noah and Shirahoshi's command over them suggests this migration will happen when the 'appointed time' arrives - likely when Luffy helps fulfill Joy Boy's promise and creates a world where humans and fish-men can truly coexist.",
    "author": "Fish-Man Island Arc Theorists",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Noah",
      "title": "Noah - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-26"
    },
    "postedDate": "2022-05-15",
    "episodeRange": [568, 1100],
    "minEpisode": 568,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 900
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["shirahoshi", "luffy", "otohime"],
    "relatedLocations": ["noah", "fish-man-island"],
    "relatedEvents": ["ep568-event-003"],
    "tags": ["noah", "fish-man-island", "otohime", "migration", "surface"]
  },
  {
    "id": "theory-ep568-005",
    "title": "Luffy and Shirahoshi are the Two Sovereigns",
    "summary": "The Sea Kings mention waiting for two sovereigns to be born. Fans theorize these are Shirahoshi (Poseidon) and Luffy (Joy Boy's successor), who together will change the world.",
    "fullText": "In discussions about the ancient weapons and prophecies, the Sea Kings have mentioned waiting for 'two sovereigns' to be born in the same era. Episode 568 confirms Shirahoshi as one sovereign (Poseidon), while the Sea Kings' comparison of Luffy to Roger and Joy Boy suggests Luffy is the second sovereign. This theory proposes that these two individuals - one with power over the seas (Shirahoshi commanding Sea Kings) and one with power to unite people (Luffy's ability to gain allies) - are destined to work together to fulfill the ancient promise and bring about a new era of peace and equality.",
    "author": "Dual Sovereigns Theory Community",
    "source": {
      "url": "https://gamerant.com/how-shirahoshi-can-alter-the-power-balance/",
      "title": "How Shirahoshi Can Alter The Power Balance In One Piece",
      "platform": "GameRant",
      "accessedAt": "2025-12-26"
    },
    "postedDate": "2023-08-22",
    "episodeRange": [568, 1100],
    "minEpisode": 568,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1000
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["luffy", "shirahoshi"],
    "relatedLocations": [],
    "relatedEvents": ["ep568-event-002", "ep568-event-004"],
    "tags": ["two-sovereigns", "prophecy", "luffy", "shirahoshi", "poseidon"]
  }
]
