[
  {
    "id": "theory-ep385-001",
    "title": "The Red Line Destruction Theory",
    "theoryText": "The theory proposes that the One Piece treasure is actually one or more of the Ancient Weapons (Pluton, Uranus, or both), and these weapons are meant to be used to destroy the Red Line. By destroying the Red Line at Reverse Mountain and at the halfway point (where Mary Geoise sits), several Straw Hat dreams would be accomplished: Brook would reunite with Laboon, Franky's ship would have sailed around the world, the All Blue would be created for Sanji as all the seas merge, and Luffy would become Pirate King by his own definition. Additionally, destroying the Red Line at the halfway point would eliminate Mary Geoise and the Celestial Dragons, while allowing Fish-Man Island to rise to the surface and end the discrimination against fish-men.",
    "author": "Various One Piece fans",
    "sourceUrl": "https://onepiece.fandom.com/f/p/2995246669538264836",
    "platform": "One Piece Wiki Forum",
    "postDate": "",
    "episodesCovered": [385],
    "minEpisode": 385,
    "spoilerStatus": {
      "containsSpoilers": true,
      "spoilsUpToEpisode": 1000,
      "isFuturePrediction": true
    },
    "popularity": {
      "upvotes": 0,
      "downvotes": 0,
      "views": 0,
      "comments": 0
    },
    "theoryStatus": "UNRESOLVED",
    "relatedCharacters": ["luffy", "sanji", "brook", "franky"],
    "relatedLocations": ["red-line", "mariejois", "reverse-mountain", "fishman-island"],
    "tags": ["endgame-theory", "ancient-weapons", "straw-hat-dreams", "red-line"],
    "evidence": [
      "The Red Line divides the world's oceans, preventing the creation of the All Blue",
      "Destroying it would allow Brook to reunite with Laboon at Reverse Mountain",
      "The destruction would cause Mary Geoise and the World Government to fall",
      "Fish-Man Island could rise to the surface if the Red Line above it is destroyed",
      "Multiple Straw Hat dreams converge on this single event"
    ],
    "counterEvidence": [
      "The Ancient Weapons may have different purposes than destroying the Red Line",
      "Such massive destruction could cause worldwide catastrophe",
      "No concrete evidence yet that this is Luffy's endgame plan"
    ]
  },
  {
    "id": "theory-ep385-002",
    "title": "The Red Line is Artificially Created",
    "theoryText": "This theory suggests that the Red Line is not a natural formation but was artificially created by the World Government or Imu in the distant past. After winning the war during the Void Century, the theory proposes that Imu and the World Government created the Red Line as a means of dividing and controlling the world, separating the seas and preventing free travel and communication between different regions. This artificial barrier allowed them to maintain power by keeping the world fragmented.",
    "author": "Reddit One Piece theorists",
    "sourceUrl": "https://gamerant.com/one-piece-theory-the-red-line-is-artificial/",
    "platform": "Reddit/GameRant",
    "postDate": "",
    "episodesCovered": [385],
    "minEpisode": 385,
    "spoilerStatus": {
      "containsSpoilers": true,
      "spoilsUpToEpisode": 900,
      "isFuturePrediction": true
    },
    "popularity": {
      "upvotes": 0,
      "downvotes": 0,
      "views": 0,
      "comments": 0
    },
    "theoryStatus": "UNRESOLVED",
    "relatedCharacters": ["imu"],
    "relatedLocations": ["red-line", "mariejois"],
    "tags": ["void-century", "world-government", "ancient-history", "red-line"],
    "evidence": [
      "The convenient placement of the Red Line for controlling world geography",
      "Mary Geoise's position atop the Red Line suggests intentional construction",
      "The Void Century erased history that might explain the Red Line's origins",
      "The World Government's extreme control over information about ancient history"
    ],
    "counterEvidence": [
      "No direct evidence yet of the Red Line being artificial",
      "The scale of such construction seems beyond even Ancient Weapon capabilities",
      "Natural geological formations of this scale exist in the One Piece world"
    ]
  },
  {
    "id": "theory-ep385-003",
    "title": "Red Line Connection to Norse Mythology",
    "theoryText": "This theory draws parallels between the Red Line and Norse mythology, specifically the concept of Yggdrasil (the World Tree) or the barriers between different realms. The theory suggests that the Red Line may have deeper mythological significance in the One Piece world, potentially connecting to the origins of the world itself or serving as a barrier between different planes of existence or eras of history.",
    "author": "Fandom Wire",
    "sourceUrl": "https://fandomwire.com/the-existence-of-the-red-line-may-hold-much-greater-significance-in-one-piece-with-a-deep-connection-to-norse-mythology/",
    "platform": "Fandom Wire",
    "postDate": "",
    "episodesCovered": [385],
    "minEpisode": 385,
    "spoilerStatus": {
      "containsSpoilers": false,
      "spoilsUpToEpisode": 385,
      "isFuturePrediction": true
    },
    "popularity": {
      "upvotes": 0,
      "downvotes": 0,
      "views": 0,
      "comments": 0
    },
    "theoryStatus": "SPECULATION",
    "relatedCharacters": [],
    "relatedLocations": ["red-line"],
    "tags": ["mythology", "world-building", "red-line"],
    "evidence": [
      "One Piece frequently draws from real-world mythology",
      "The Red Line's significance as a world-dividing barrier",
      "Oda's use of Norse mythology in other elements (Elbaf giants)"
    ],
    "counterEvidence": [
      "Theory is primarily based on symbolic parallels rather than textual evidence",
      "No direct Norse mythology references regarding the Red Line have been confirmed"
    ]
  }
]
