[
  {
    "name": {
      "english": "Red Line",
      "japanese": "赤い土の大陸",
      "romanized": "Akai Tsuchi no Tairiku"
    },
    "debutEpisode": 385,
    "debutChapter": 490,
    "episodeAppearances": [385],
    "locationType": "Continent",
    "parentLocation": null,
    "childLocations": ["mariejois"],
    "keyEvents": [
      {
        "episodeNumber": 385,
        "eventId": "ep385-event-002",
        "title": "Straw Hats Reach the Red Line",
        "description": "The Straw Hat Pirates arrive at the Red Line, marking the halfway point of their journey through the Grand Line.",
        "significance": "A major milestone representing the crew's progress and the challenges that lie ahead.",
        "timestamp": "05:15"
      }
    ],
    "description": "The Red Line is a vast continent that circles the entire world from north to south, perpendicular to the Grand Line. It divides the world's ocean into two halves and is one of the two barriers that must be crossed to circumnavigate the world. At the point where the Red Line intersects the Grand Line, it marks the halfway point of the pirate route.",
    "geography": {
      "climate": "Varies by location",
      "terrain": "Massive red rock cliff walls reaching high into the sky",
      "notable_features": [
        "Divides the world's ocean into two halves",
        "Intersection with Grand Line marks the halfway point",
        "Mary Geoise sits atop the Red Line at the Grand Line intersection",
        "Fish-Man Island lies in an underwater passage beneath the Red Line"
      ]
    },
    "status": "ACTIVE",
    "controlledBy": "World Government (at Mary Geoise)",
    "population": "Unknown (varies by region)",
    "culturalSignificance": "The Red Line is one of the most important geographical features in the world, serving as both a natural barrier and the location of the World Government's seat of power at Mary Geoise. Its presence shapes global navigation and politics.",
    "images": [],
    "sources": []
  }
]
