[
  {
    "name": {
      "english": "Gum-Gum Fruit",
      "japanese": "ゴムゴムの実",
      "romanized": "Gomu Gomu no Mi"
    },
    "debutEpisode": 1,
    "debutChapter": 1,
    "episodeAppearances": [124],
    "fruitType": "PARAMECIA",
    "currentUser": "luffy",
    "previousUsers": [],
    "status": "ACTIVE",
    "keyMoments": [
      {
        "episodeNumber": 124,
        "eventId": "ep124-event-002",
        "title": "Blood-Enhanced Rubber Attacks",
        "description": "Luffy uses his rubber body in combination with his own blood to strike Crocodile, coating his rubber limbs in blood to harden Crocodile's sand and deliver effective blows.",
        "significance": "Shows Luffy's creative use of his Devil Fruit powers in combination with other strategies. The rubber body's ability to stretch and deliver powerful punches is enhanced by the blood coating technique.",
        "timestamp": "08:15"
      }
    ],
    "abilities": [
      {
        "abilityName": "Blood-Coated Rubber Attacks",
        "episodeFirstUsed": 124,
        "description": "Luffy coats his rubber body parts in his own blood while using his stretching abilities to deliver powerful strikes that can hit Crocodile's Logia sand body.",
        "limitations": "Requires Luffy to be bleeding, which means he must sustain injuries to use this technique effectively."
      }
    ],
    "weaknesses": [
      "Standard Devil Fruit weakness to seawater and Sea-Prism Stone",
      "Vulnerability to cutting and piercing attacks",
      "Cannot swim"
    ]
  },
  {
    "name": {
      "english": "Sand-Sand Fruit",
      "japanese": "スナスナの実",
      "romanized": "Suna Suna no Mi"
    },
    "debutEpisode": 76,
    "debutChapter": 126,
    "episodeAppearances": [124],
    "fruitType": "LOGIA",
    "currentUser": "crocodile",
    "previousUsers": [],
    "status": "ACTIVE",
    "keyMoments": [
      {
        "episodeNumber": 124,
        "eventId": "ep124-event-002",
        "title": "Weakness to Blood Revealed",
        "description": "Crocodile's sand body is shown to be vulnerable not just to water but also to blood, which can harden his sand and allow physical attacks to connect. He expresses confusion about how Luffy can strike him without water.",
        "significance": "Reveals an additional weakness of the Sand-Sand Fruit beyond water. This vulnerability to blood is crucial for Luffy's ability to fight Crocodile effectively in their final battle.",
        "timestamp": "08:15"
      }
    ],
    "abilities": [],
    "weaknesses": [
      "Standard Devil Fruit weakness to seawater and Sea-Prism Stone",
      "Water can solidify the sand body, making it vulnerable to physical attacks",
      "Blood can also harden the sand body, allowing physical attacks to connect",
      "Cannot swim"
    ]
  }
]
