[
  {
    "name": {
      "english": "Tomb of the Kings",
      "japanese": "王の墓",
      "romanized": "Ō no Haka"
    },
    "debutEpisode": 122,
    "debutChapter": 201,
    "episodeAppearances": [124],
    "locationType": "HISTORICAL_SITE",
    "parentLocation": "Alubarna",
    "keyEvents": [
      {
        "episodeNumber": 124,
        "eventId": "ep124-event-001",
        "title": "Third Battle Between Luffy and Crocodile Begins",
        "description": "The underground tomb becomes the battlefield for the climactic third confrontation between Luffy and Crocodile.",
        "significance": "This ancient burial site serves as the stage for one of the most important battles in the Arabasta Arc, where the fate of the kingdom hangs in the balance.",
        "timestamp": "05:30"
      },
      {
        "episodeNumber": 124,
        "eventId": "ep124-event-002",
        "title": "Luffy Uses Blood to Strike Crocodile",
        "description": "Luffy demonstrates his new strategy of using blood to overcome Crocodile's Logia powers in the tomb's underground chamber.",
        "significance": "The tomb witnesses Luffy's tactical evolution and his discovery of a way to harm a seemingly invincible enemy.",
        "timestamp": "08:15"
      },
      {
        "episodeNumber": 124,
        "eventId": "ep124-event-003",
        "title": "Crocodile Reveals His Poison Hook",
        "description": "In the depths of the tomb, Crocodile unveils his deadly poison hook against Luffy.",
        "significance": "The tomb becomes the setting for Crocodile's use of his rarely-seen ultimate weapon.",
        "timestamp": "12:45"
      }
    ],
    "description": "An ancient underground burial chamber beneath Alubarna where the former kings of Arabasta are entombed. The tomb features stone corridors and chambers, creating a dramatic underground battlefield.",
    "geography": "Underground chamber system beneath the capital city of Alubarna",
    "climate": "Dark, dry underground environment",
    "inhabitants": [],
    "controllingForce": "Arabasta Kingdom (historically)",
    "firstMentioned": 122,
    "status": "ACTIVE",
    "statusHistory": [
      {
        "status": "ACTIVE",
        "episodeStart": 122,
        "episodeEnd": "present",
        "description": "Serves as the battlefield for Luffy vs Crocodile"
      }
    ]
  },
  {
    "name": {
      "english": "Alubarna Clock Tower",
      "japanese": "アルバーナの時計塔",
      "romanized": "Arubāna no Tokeitō"
    },
    "debutEpisode": 124,
    "debutChapter": 205,
    "episodeAppearances": [124],
    "locationType": "BUILDING",
    "parentLocation": "Alubarna",
    "keyEvents": [
      {
        "episodeNumber": 124,
        "eventId": "ep124-event-005",
        "title": "Vivi Discovers the Bomb",
        "description": "Vivi arrives at the clock tower and discovers Crocodile's bomb with a timer counting down to detonation.",
        "significance": "The clock tower is revealed as the location of Crocodile's ultimate weapon - a bomb capable of destroying the city center with a 5-kilometer blast radius.",
        "timestamp": "18:00"
      },
      {
        "episodeNumber": 124,
        "eventId": "ep124-event-006",
        "title": "Mr. 7 and Miss Father's Day Guard the Bomb",
        "description": "The Baroque Works sniper duo reveals themselves inside the clock tower, guarding the bomb from any interference.",
        "significance": "The clock tower becomes a crucial battleground where Vivi must overcome trained assassins to reach the bomb.",
        "timestamp": "19:30"
      },
      {
        "episodeNumber": 124,
        "eventId": "ep124-event-007",
        "title": "Battle at the Clock Tower Begins",
        "description": "Vivi confronts Mr. 7 and Miss Father's Day at the clock tower with the bomb ticking down in the background.",
        "significance": "The clock tower serves as the setting for a desperate race against time to prevent the destruction of Alubarna.",
        "timestamp": "21:00"
      }
    ],
    "description": "A prominent clock tower in the center of Alubarna, the capital of Arabasta. The tower is tall enough to be visible from across the city and has internal chambers where Crocodile hid his bomb. Vivi recognized it from her childhood memories of the city.",
    "geography": "Central Alubarna, capital city of Arabasta Kingdom",
    "climate": "Hot, arid desert climate",
    "inhabitants": [],
    "controllingForce": "Arabasta Kingdom",
    "firstMentioned": 124,
    "status": "ACTIVE",
    "statusHistory": [
      {
        "status": "ACTIVE",
        "episodeStart": 124,
        "episodeEnd": "present",
        "description": "Contains Crocodile's bomb threatening to destroy the city"
      }
    ]
  },
  {
    "name": {
      "english": "Alubarna",
      "japanese": "アルバーナ",
      "romanized": "Arubāna"
    },
    "debutEpisode": 92,
    "debutChapter": 160,
    "episodeAppearances": [124],
    "locationType": "CITY",
    "parentLocation": "Arabasta Kingdom",
    "keyEvents": [
      {
        "episodeNumber": 124,
        "eventId": "ep124-event-005",
        "title": "City Threatened by Bomb",
        "description": "The entire capital city faces destruction from Crocodile's bomb planted in the clock tower, with a 5-kilometer blast radius that would kill everyone in the city center.",
        "significance": "The city itself becomes the stakes of the episode, with thousands of lives hanging in the balance as the bomb counts down.",
        "timestamp": "18:00"
      }
    ],
    "description": "The capital city of the Arabasta Kingdom, where the Royal Palace is located. The city is experiencing civil war between the Royal Army and the Rebel Army, manipulated by Crocodile's schemes. The city features the prominent clock tower and ancient underground tombs.",
    "geography": "Capital city in the Arabasta Kingdom, located in the Grand Line",
    "climate": "Hot, arid desert climate typical of Arabasta",
    "inhabitants": ["Arabasta citizens", "Royal Army", "Rebel Army"],
    "controllingForce": "Arabasta Kingdom (contested)",
    "firstMentioned": 92,
    "status": "ACTIVE",
    "statusHistory": [
      {
        "status": "ACTIVE",
        "episodeStart": 92,
        "episodeEnd": "present",
        "description": "Capital under threat from civil war and Crocodile's bomb"
      }
    ]
  }
]
