[
  {
    "name": {
      "english": "Nico Robin",
      "japanese": "ニコ・ロビン",
      "romanized": "Niko Robin"
    },
    "episodeAppearances": [263],
    "keyMoments": [
      {
        "episodeNumber": 263,
        "eventId": "ep263-event-001",
        "momentType": "BACKSTORY_REVEAL",
        "title": "First Glimpse of Robin's Past - Buster Call on Ohara",
        "description": "Robin's traumatic past is revealed for the first time as Blueno mentions the Buster Call that destroyed her homeland Ohara when she was a child. A brief flashback shows young Robin witnessing the devastating attack.",
        "significance": "This is the first definitive glimpse of Robin's long-unexplained past in the anime, setting up the emotional foundation for the Enies Lobby arc and explaining her willingness to sacrifice herself.",
        "timestamp": "03:15",
        "quote": ""
      },
      {
        "episodeNumber": 263,
        "eventId": "ep263-event-006",
        "momentType": "MAJOR_DECISION",
        "title": "Robin Protects Sanji and Sogeking",
        "description": "Robin uses her Hana Hana no Mi powers to restrain Blueno, preventing him from further attacking Sanji and Sogeking. She promises not to escape if he stops hurting her friends.",
        "significance": "Demonstrates Robin's deep care for her crewmates despite her decision to leave them, showing the internal conflict between her desire to protect them and her belief that she endangers them.",
        "timestamp": "11:45",
        "quote": "I promise that I won't escape. Please don't hurt them anymore."
      },
      {
        "episodeNumber": 263,
        "eventId": "ep263-event-008",
        "momentType": "LOCATION_ARRIVAL",
        "title": "Arrival at Enies Lobby",
        "description": "Robin arrives at Enies Lobby as a prisoner of CP9, marking her entry into World Government custody at the Judicial Island.",
        "significance": "This arrival marks the point of no return for Robin's capture, raising the stakes for the Straw Hats' rescue mission.",
        "timestamp": "17:45",
        "quote": ""
      }
    ],
    "reveals": [
      {
        "infoType": "BACKSTORY",
        "information": "Robin witnessed the Buster Call that destroyed Ohara as a child",
        "episodeRevealed": 263,
        "severity": "CRITICAL"
      }
    ]
  },
  {
    "name": {
      "english": "Usopp (as Sogeking)",
      "japanese": "ウソップ (そげキング)",
      "romanized": "Usoppu (Sogekingu)"
    },
    "episodeAppearances": [263],
    "keyMoments": [
      {
        "episodeNumber": 263,
        "eventId": "ep263-event-005",
        "momentType": "BATTLE_START",
        "title": "Sogeking Stands Up to Blueno",
        "description": "Despite being vastly outmatched, Sogeking demands that Blueno let Robin go and declares that a pirate isn't allowed to leave their crew without their captain's permission. Blueno repeatedly stabs him with Shigan, but Sogeking refuses to back down.",
        "significance": "Demonstrates Usopp's growth and courage as he articulates the sacred bond of the pirate crew, even while facing a CP9 agent far stronger than himself.",
        "timestamp": "10:30",
        "quote": "There is one last thing - a pirate isn't allowed to leave their crew without their captain's permission!"
      }
    ],
    "reveals": []
  },
  {
    "name": {
      "english": "Blueno",
      "japanese": "ブルーノ",
      "romanized": "Burūno"
    },
    "episodeAppearances": [263],
    "keyMoments": [
      {
        "episodeNumber": 263,
        "eventId": "ep263-event-002",
        "momentType": "POWER_REVEAL",
        "title": "Blueno Demonstrates Doa Doa no Mi Powers",
        "description": "Blueno uses his Door-Door Fruit abilities extensively, creating doors in the air and through solid objects to separate Robin from her would-be rescuers and to create tactical advantages.",
        "significance": "First major combat demonstration of Blueno's Devil Fruit abilities, showcasing the versatility of the Doa Doa no Mi.",
        "timestamp": "05:30",
        "quote": ""
      },
      {
        "episodeNumber": 263,
        "eventId": "ep263-event-003",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "Blueno Uses Rankyaku",
        "description": "Blueno emerges from a door behind Sanji and unleashes Rankyaku (Storm Leg), a Rokushiki technique that sends a slicing air blade attack.",
        "significance": "Demonstrates Blueno's mastery of Rokushiki techniques beyond his Devil Fruit powers.",
        "timestamp": "08:45",
        "quote": ""
      },
      {
        "episodeNumber": 263,
        "eventId": "ep263-event-005",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "Blueno Uses Shigan",
        "description": "Blueno uses Shigan (Finger Gun) to stab Sogeking multiple times, demonstrating the lethal effectiveness of this Rokushiki technique.",
        "significance": "Shows the full combat capabilities of CP9 agents who combine Devil Fruit powers with superhuman martial arts.",
        "timestamp": "10:30",
        "quote": ""
      }
    ],
    "abilities": [
      {
        "abilityName": "Rankyaku",
        "abilityType": "ROKUSHIKI",
        "episodeFirstUsed": 263,
        "description": "A kicking technique that sends out a slicing blade of air as a ranged attack."
      },
      {
        "abilityName": "Shigan",
        "abilityType": "ROKUSHIKI",
        "episodeFirstUsed": 263,
        "description": "Blueno stabs an opponent with his finger, leaving a wound similar to a bullet wound."
      }
    ],
    "reveals": [
      {
        "infoType": "ABILITY",
        "information": "Blueno can use Rokushiki techniques Rankyaku and Shigan",
        "episodeRevealed": 263,
        "severity": "MAJOR"
      }
    ]
  },
  {
    "name": {
      "english": "Sanji",
      "japanese": "サンジ",
      "romanized": "Sanji"
    },
    "episodeAppearances": [263],
    "keyMoments": [
      {
        "episodeNumber": 263,
        "eventId": "ep263-event-004",
        "momentType": "BATTLE_START",
        "title": "Sanji Fights Blueno on the Train",
        "description": "Sanji is hit by Blueno's Rankyaku attack and nearly falls off the speeding Puffing Tom train. Despite his efforts, he is unable to protect Robin from being taken.",
        "significance": "Shows the overwhelming power gap between the Straw Hats and CP9 at this point, demonstrating why the crew needs to grow stronger.",
        "timestamp": "09:15",
        "quote": ""
      }
    ],
    "reveals": []
  },
  {
    "name": {
      "english": "Yokozuna",
      "japanese": "横綱",
      "romanized": "Yokozuna"
    },
    "episodeAppearances": [263],
    "keyMoments": [
      {
        "episodeNumber": 263,
        "eventId": "ep263-event-007",
        "momentType": "FIRST_APPEARANCE",
        "title": "Yokozuna Joins the Rescue Mission",
        "description": "The giant sumo frog Yokozuna jumps onto the Rocketman and, after Kokoro explains the mission, decides to join the group in their assault on Enies Lobby to save Franky.",
        "significance": "Yokozuna adds his strength to the rescue party, showing that Tom's old companions are invested in saving Franky.",
        "timestamp": "14:20",
        "quote": ""
      }
    ],
    "reveals": []
  }
]
