[
  {
    "name": {
      "english": "Weatheria",
      "japanese": "ウェザリア",
      "romanized": "Wezaria"
    },
    "debutEpisode": 418,
    "debutChapter": 523,
    "episodeAppearances": [418],
    "locationType": "SKY_ISLAND",
    "region": "Sky",
    "description": "An artificial sky island that floats atop a large bubble and constantly drifts with the wind. Weatheria is dedicated entirely to the scientific study of weather phenomena, inhabited by elderly scientists dressed as wizards who research weather manipulation technology.",
    "climate": "Variable - can control its own weather",
    "inhabitants": ["Weatheria Scientists", "Haredas"],
    "affiliations": [],
    "keyEvents": [
      {
        "episodeNumber": 418,
        "eventId": "ep418-event-003",
        "eventType": "LOCATION_ARRIVAL",
        "title": "Nami Lands on Weatheria",
        "description": "Nami crash-lands on Weatheria after being sent flying by Bartholomew Kuma, beginning her journey on the sky island.",
        "significance": "Marks the beginning of Nami's residence on Weatheria where she will train in weather science during the timeskip.",
        "timestamp": "06:45"
      },
      {
        "episodeNumber": 418,
        "eventId": "ep418-event-008",
        "eventType": "TECHNIQUE_DEBUT",
        "title": "Nami Disperses Cyclone",
        "description": "Nami uses Wind Knots combined with her Perfect Clima-Tact to successfully disperse a dangerous cyclone threatening Weatheria.",
        "significance": "First demonstration of combining Weatheria's technology with Nami's weapons.",
        "timestamp": "16:45"
      },
      {
        "episodeNumber": 418,
        "eventId": "ep418-event-009",
        "eventType": "WORLD_LORE",
        "title": "Weatheria Revealed",
        "description": "Nami discovers that she is on an artificial sky island dedicated to weather science research.",
        "significance": "Reveals the nature and purpose of Weatheria to viewers and Nami.",
        "timestamp": "18:30"
      }
    ],
    "currentStatus": "ACTIVE",
    "statusHistory": [
      {
        "status": "ACTIVE",
        "episodeStart": 418,
        "description": "Weatheria is operational as a weather research facility"
      }
    ],
    "notableFeatures": [
      {
        "feature": "Bubble Foundation",
        "description": "The island floats atop a large bubble and drifts with the wind, making its location unpredictable."
      },
      {
        "feature": "Weather Research Facility",
        "description": "Contains advanced weather manipulation technology including Wind Knots and Weather Balls."
      },
      {
        "feature": "Weather Alteration Service",
        "description": "Residents can temporarily land on other islands and alter their weather for payment, such as bringing rain to drought-ridden countries."
      }
    ],
    "historicalSignificance": "Birthplace of advanced weather manipulation science and future training ground for Nami during the two-year timeskip.",
    "culturalNotes": "The inhabitants dress as stereotypical wizards, fitting the weather manipulation theme. Despite their advanced technology, they are described as weak and naïve with limited law enforcement.",
    "connections": {
      "connectedLocations": [],
      "accessibleFrom": "Sky - drifts with wind patterns",
      "landmarks": ["Haredas's House", "Weather Research Laboratory"]
    }
  },
  {
    "name": {
      "english": "Karakuri Island",
      "japanese": "カラクリ島",
      "romanized": "Karakuri-tō"
    },
    "debutEpisode": 418,
    "debutChapter": 523,
    "episodeAppearances": [418],
    "locationType": "WINTER_ISLAND",
    "region": "Paradise (Grand Line)",
    "description": "A snow-covered winter island also known as the Future Country Baldimore. The island is the birthplace of the genius scientist Dr. Vegapunk and contains his old laboratory filled with abandoned experiments and advanced technology. The name 'karakuri' refers to traditional Japanese mechanized crafts.",
    "climate": "Winter - perpetual snow and cold temperatures",
    "inhabitants": ["Kitton", "Kitton's Grandfather", "Taroimo", "Various cyborg animals"],
    "affiliations": [],
    "keyEvents": [
      {
        "episodeNumber": 418,
        "eventId": "ep418-event-010",
        "eventType": "LOCATION_ARRIVAL",
        "title": "Franky Arrives on Karakuri Island",
        "description": "Franky crash-lands in a snowy field on Karakuri Island after being sent flying by Bartholomew Kuma.",
        "significance": "Establishes Franky's location where he will discover Vegapunk's technology and upgrade himself during the timeskip.",
        "timestamp": "20:15"
      },
      {
        "episodeNumber": 418,
        "eventId": "ep418-event-014",
        "eventType": "WORLD_LORE",
        "title": "Vegapunk's Laboratory Revealed",
        "description": "A mysterious abandoned building bearing Dr. Vegapunk's name is shown, containing many of his early experiments and inventions.",
        "significance": "Introduces the advanced technology that Franky will study and use for his upgrades.",
        "timestamp": "25:00"
      }
    ],
    "currentStatus": "ACTIVE",
    "statusHistory": [
      {
        "status": "ACTIVE",
        "episodeStart": 418,
        "description": "Karakuri Island is inhabited with Vegapunk's laboratory abandoned but intact"
      }
    ],
    "notableFeatures": [
      {
        "feature": "Vegapunk's Laboratory",
        "description": "An abandoned laboratory containing many of Dr. Vegapunk's early experiments and advanced technology, considered a treasure of mankind."
      },
      {
        "feature": "Cyborg Animals",
        "description": "The island has various animals that Vegapunk modified into cyborgs, including beetles, lions, gorillas, and snakes, originally meant to be a labor force for building a heating system."
      },
      {
        "feature": "Failed Heating System",
        "description": "Vegapunk attempted to construct an in-ground heating system for the perpetually cold island, but the project was never completed."
      },
      {
        "feature": "Weather Control Bolts",
        "description": "Bolts visible on the island's highest mountain were a weather-controlling creation of Dr. Vegapunk that failed to work."
      }
    ],
    "historicalSignificance": "Birthplace of Dr. Vegapunk, the world's greatest scientist, and repository of his early technological experiments. The island represents the cutting edge of science and technology in the One Piece world.",
    "culturalNotes": "Also known as Future Country Baldimore. The name 'karakuri' references traditional Japanese mechanized crafts where furniture and dolls appear to come to life as if by magic.",
    "connections": {
      "connectedLocations": [],
      "accessibleFrom": "Grand Line - Paradise section",
      "landmarks": ["Vegapunk's Laboratory", "Mechanical Igloo Settlement"]
    }
  },
  {
    "name": {
      "english": "Vegapunk's Laboratory",
      "japanese": "ベガパンクの研究所",
      "romanized": "Begapanku no Kenkyūjo"
    },
    "debutEpisode": 418,
    "debutChapter": 523,
    "episodeAppearances": [418],
    "locationType": "BUILDING",
    "region": "Karakuri Island",
    "description": "Dr. Vegapunk's abandoned laboratory on Karakuri Island, containing numerous unfinished experiments and advanced technological inventions. The building bears Vegapunk's name and houses weapons-based inventions and other scientific marvels created during his youth.",
    "climate": "Indoor - protected from Karakuri Island's winter conditions",
    "inhabitants": [],
    "affiliations": ["World Government (Marines guard it)"],
    "keyEvents": [
      {
        "episodeNumber": 418,
        "eventId": "ep418-event-014",
        "eventType": "WORLD_LORE",
        "title": "Laboratory Revealed",
        "description": "As Franky explores Karakuri Island, the mysterious abandoned laboratory bearing Dr. Vegapunk's name is shown for the first time.",
        "significance": "Introduces the repository of Vegapunk's early work that will enable Franky's technological upgrades.",
        "timestamp": "25:00"
      }
    ],
    "currentStatus": "ABANDONED",
    "statusHistory": [
      {
        "status": "ACTIVE",
        "episodeStart": null,
        "description": "Once operated by Dr. Vegapunk during his youth on Karakuri Island"
      },
      {
        "status": "ABANDONED",
        "episodeStart": 418,
        "description": "Laboratory abandoned after Vegapunk left the island, though guarded by Marines as a treasure of mankind"
      }
    ],
    "notableFeatures": [
      {
        "feature": "Unfinished Experiments",
        "description": "Contains many of Vegapunk's experiments that were never completed, representing early work by the world's greatest scientist."
      },
      {
        "feature": "Weapons-Based Inventions",
        "description": "Houses numerous weapons-based inventions and technological marvels created by Vegapunk."
      },
      {
        "feature": "Marine Protection",
        "description": "Considered a treasure of mankind and is more valuable than money, guarded by the Marines."
      }
    ],
    "historicalSignificance": "Contains the early work of Dr. Vegapunk, providing insight into the genius scientist's development and serving as a source of advanced technology. Franky's study of this laboratory will lead to his post-timeskip upgrades.",
    "culturalNotes": "Represents the peak of scientific achievement in the One Piece world and foreshadows Vegapunk's importance to the overall story.",
    "connections": {
      "connectedLocations": ["Karakuri Island"],
      "accessibleFrom": "Within Karakuri Island",
      "landmarks": []
    }
  }
]
