[
  {
    "theoryTitle": "Aokiji's True Justice and Future Defection",
    "theoryText": "Aokiji's revelation about protecting Robin for 20 years despite his Marine duties suggests his concept of 'Lazy Justice' is more complex than initially shown. His willingness to honor Saul's wish over his duty hints at future conflicts with the World Government. Many fans theorized this episode foreshadowed Aokiji eventually leaving the Marines, which was later confirmed when he left after losing to Akainu.",
    "author": "One Piece Community (various forum discussions)",
    "source": "Multiple anime/manga forums and discussion boards",
    "sourceUrl": "https://onepiece.fandom.com/wiki/Episode_315",
    "dateProposed": "2007-06-24",
    "episodesSpanned": [315, 573, 574, 650],
    "spoilerStatus": "CONFIRMED_LATER",
    "popularity": "HIGH",
    "evidenceFromEpisode": [
      "Aokiji prioritizes his promise to Saul over capturing Robin",
      "He questions whether Robin is truly dangerous after seeing the Straw Hats rescue her",
      "His 'Lazy Justice' philosophy allows personal judgment over strict adherence to rules"
    ],
    "communityReception": "Widely discussed theory that gained traction after this episode aired, later confirmed in the story."
  },
  {
    "theoryTitle": "Dr. Vegapunk as Future Major Character",
    "theoryText": "The first mention of Dr. Vegapunk in this episode sparked immediate fan speculation about his eventual appearance and importance to the story. Fans theorized he would be crucial to understanding Devil Fruits, the Ancient Kingdom, and advanced technology. His mention alongside Seastone technology suggested he would be connected to major plot revelations.",
    "author": "One Piece Community",
    "source": "Chapter 433 and Episode 315 discussion threads",
    "sourceUrl": "https://onepiece.fandom.com/wiki/Chapter_433",
    "dateProposed": "2007-06-24",
    "episodesSpanned": [315, 433, 610, 1070, 1071, 1090],
    "spoilerStatus": "CONFIRMED_LATER",
    "popularity": "VERY_HIGH",
    "evidenceFromEpisode": [
      "Koby credits Vegapunk with understanding Devil Fruit power transmission",
      "Vegapunk developed Seastone ship technology",
      "Described as a genius scientist with world-changing inventions"
    ],
    "communityReception": "One of the most anticipated character reveals in the series. Fans correctly predicted Vegapunk would be central to major story revelations about Devil Fruits and the world's secrets."
  },
  {
    "theoryTitle": "Koby Will Become Admiral",
    "theoryText": "After Koby declares his dream to become Admiral in this episode, fans began theorizing about his eventual rise through Marine ranks. The parallel structure between Luffy's dream (Pirate King) and Koby's dream (Admiral) suggested both would achieve their goals by series end, with Koby potentially becoming a force for change within the Marines.",
    "author": "One Piece Community",
    "source": "Episode 315 discussion forums",
    "sourceUrl": "https://onepiece.fandom.com/wiki/Episode_315",
    "dateProposed": "2007-06-24",
    "episodesSpanned": [1, 2, 315, 1088],
    "spoilerStatus": "ONGOING",
    "popularity": "HIGH",
    "evidenceFromEpisode": [
      "Koby boldly declares his Admiral dream to Luffy",
      "Parallel structure with Luffy's Pirate King dream",
      "Both characters challenge each other to meet in the New World",
      "Koby's growth from Episode 1 shows his potential"
    ],
    "communityReception": "Popular ongoing theory. Koby has shown remarkable growth, achieving Captain rank during the Rocky Port incident and displaying advanced Haki. Fans continue to believe he will eventually become Admiral."
  }
]
