[
  {
    "id": "brook",
    "name": {
      "english": "Brook",
      "japanese": "ブルック",
      "romanized": "Burukku"
    },
    "epithet": "Soul King",
    "debut": {
      "episode": 337,
      "chapter": 442
    },
    "episodeAppearances": [379],
    "keyMoments": [
      {
        "episodeNumber": 379,
        "title": "Brook's Life with the Rumbar Pirates",
        "description": "Brook is shown fifty years in the past as the musician of the Rumbar Pirates, alive and human. He wakes his crew with 'Black Handkerchief of Happiness' and plays 'Bink's Sake' at Captain Yorki's request. He suggests playing music to cheer up baby Laboon and develops a particularly close bond with the whale.",
        "timestamp": "02:15",
        "significance": "Reveals Brook's past life as a living, breathing musician and establishes his deep connection with Laboon, providing crucial context for his character's motivations and tragedy."
      },
      {
        "episodeNumber": 379,
        "title": "Brook's Heartbreak at Leaving Laboon",
        "description": "Brook participates in the painful decision to leave Laboon at Twin Capes, explaining that the Grand Line is too dangerous for the young whale. He is part of the crew's promise to return in 2-3 years.",
        "timestamp": "16:00",
        "significance": "Shows Brook's compassionate nature and his role in making the promise to Laboon that would haunt him for 50 years."
      },
      {
        "episodeNumber": 379,
        "title": "Only Brook Survives",
        "description": "The episode concludes by revealing that three years after leaving Laboon, only Brook remains of the Rumbar Pirates, now a living skeleton on a ruined ship. The promise to return to Laboon remains unfulfilled.",
        "timestamp": "20:30",
        "significance": "Reveals the tragic fate of the Rumbar Pirates and establishes Brook's 50-year burden of being unable to fulfill his crew's promise to Laboon."
      }
    ],
    "reveals": [
      {
        "type": "BACKSTORY",
        "episodeNumber": 379,
        "description": "Brook was 38 years old when he was part of the Rumbar Pirates fifty years ago. He served as the crew's musician and played violin to wake the crew and entertain Laboon."
      },
      {
        "type": "RELATIONSHIP",
        "episodeNumber": 379,
        "description": "Brook developed a special bond with Laboon, who particularly loved Brook's music. This connection explains Brook's intense desire to reunite with Laboon after 50 years."
      },
      {
        "type": "BACKSTORY",
        "episodeNumber": 379,
        "description": "Brook was present when the Rumbar Pirates promised to return for Laboon in 2-3 years, a promise that could not be kept due to the crew's demise."
      }
    ],
    "affiliations": [
      {
        "type": "CREW",
        "crewId": "rumbar-pirates",
        "role": "Musician",
        "episodeJoined": 379,
        "status": "FORMER",
        "note": "Shown in flashback as member of the Rumbar Pirates fifty years ago"
      }
    ],
    "relationships": [
      {
        "characterId": "laboon",
        "type": "FRIEND",
        "description": "Brook bonded deeply with Laboon through music fifty years ago. Laboon particularly loved Brook's violin playing, creating a special connection between them.",
        "episodeEstablished": 379
      },
      {
        "characterId": "yorki",
        "type": "CREWMATE",
        "description": "Yorki was Brook's captain in the Rumbar Pirates. Brook served him as the crew's musician.",
        "episodeEstablished": 379
      }
    ]
  },
  {
    "id": "yorki",
    "name": {
      "english": "Yorki",
      "japanese": "ヨーキ",
      "romanized": "Yōki"
    },
    "epithet": "Calico Yorki",
    "debut": {
      "episode": 379,
      "chapter": 487
    },
    "episodeAppearances": [379],
    "keyMoments": [
      {
        "episodeNumber": 379,
        "title": "Captain Yorki Leads the Rumbar Pirates",
        "description": "Captain Yorki is shown leading the Rumbar Pirates, requesting Brook to play 'Bink's Sake' and guiding the crew through their adventures with Laboon.",
        "timestamp": "03:30",
        "significance": "Introduces Yorki as the captain of the Rumbar Pirates and establishes his role as a caring leader."
      },
      {
        "episodeNumber": 379,
        "title": "Yorki's Promise to Laboon",
        "description": "Captain Yorki makes a solemn promise to Laboon that the Rumbar Pirates will return in 2-3 years after sailing around the Grand Line. He leads the crew in saying farewell to their beloved whale friend.",
        "timestamp": "17:30",
        "significance": "Yorki's promise becomes the central tragedy of Brook's backstory, as the crew would never be able to fulfill it."
      }
    ],
    "reveals": [
      {
        "type": "DEBUT",
        "episodeNumber": 379,
        "description": "Yorki debuts as the captain of the Rumbar Pirates in this flashback episode set fifty years before the present timeline."
      },
      {
        "type": "PERSONALITY",
        "episodeNumber": 379,
        "description": "Yorki is shown as a caring and responsible captain who loves music and makes difficult decisions to protect those under his care."
      }
    ],
    "affiliations": [
      {
        "type": "CREW",
        "crewId": "rumbar-pirates",
        "role": "Captain",
        "episodeJoined": 379,
        "status": "FORMER",
        "note": "Captain of the Rumbar Pirates fifty years ago"
      }
    ],
    "relationships": [
      {
        "characterId": "brook",
        "type": "CREWMATE",
        "description": "Yorki was Brook's captain in the Rumbar Pirates, often requesting Brook to play music for the crew.",
        "episodeEstablished": 379
      },
      {
        "characterId": "laboon",
        "type": "FRIEND",
        "description": "Yorki bonded with Laboon during their time together and made the promise to return for him.",
        "episodeEstablished": 379
      }
    ]
  },
  {
    "id": "laboon",
    "name": {
      "english": "Laboon",
      "japanese": "ラブーン",
      "romanized": "Rabūn"
    },
    "debut": {
      "episode": 62,
      "chapter": 102
    },
    "episodeAppearances": [379],
    "keyMoments": [
      {
        "episodeNumber": 379,
        "title": "Baby Laboon Meets the Rumbar Pirates",
        "description": "As a baby whale in the West Blue, Laboon encounters the Rumbar Pirates and is drawn to their ship by their music, particularly Brook's playing. The crew names him Laboon.",
        "timestamp": "05:00",
        "significance": "Shows the origin of Laboon's relationship with the Rumbar Pirates and establishes music as the bond that connected them."
      },
      {
        "episodeNumber": 379,
        "title": "Laboon Saves Crewmates",
        "description": "During a pirate battle, Laboon rescues two Rumbar Pirates who fell overboard, demonstrating his loyalty and intelligence. The crew praises him for his heroic act.",
        "timestamp": "08:30",
        "significance": "Establishes Laboon as a loyal and heroic companion, strengthening the bond between him and the pirates."
      },
      {
        "episodeNumber": 379,
        "title": "Laboon's Promise to Wait",
        "description": "At Twin Capes, Laboon accepts being left behind with Crocus when the Rumbar Pirates promise to return in 2-3 years. Despite his desire to follow them, he agrees to wait at the entrance to the Grand Line.",
        "timestamp": "17:30",
        "significance": "This promise leads to Laboon waiting for 50 years, creating one of One Piece's most tragic storylines."
      }
    ],
    "reveals": [
      {
        "type": "BACKSTORY",
        "episodeNumber": 379,
        "description": "Fifty years ago, Laboon was a baby Island Whale who got lost in the West Blue and followed the Rumbar Pirates, becoming deeply attached to them and their music."
      },
      {
        "type": "BACKSTORY",
        "episodeNumber": 379,
        "description": "Laboon saved Rumbar Pirates crew members during battles and was defended by them against Sea Kings, establishing a mutual protective relationship."
      },
      {
        "type": "BACKSTORY",
        "episodeNumber": 379,
        "description": "Laboon was left at Twin Capes with Crocus with the promise that the Rumbar Pirates would return in 2-3 years, a promise never fulfilled."
      }
    ],
    "relationships": [
      {
        "characterId": "brook",
        "type": "FRIEND",
        "description": "Laboon bonded especially closely with Brook fifty years ago, loving his music and developing a deep friendship that drives Brook's desire to reunite with him.",
        "episodeEstablished": 379
      },
      {
        "characterId": "yorki",
        "type": "FRIEND",
        "description": "Captain Yorki made the promise to return for Laboon and cared deeply for the young whale's safety.",
        "episodeEstablished": 379
      },
      {
        "characterId": "crocus",
        "type": "CARETAKER",
        "description": "Crocus agreed to watch over Laboon at Twin Capes fifty years ago when the Rumbar Pirates left him behind, beginning a 50-year relationship.",
        "episodeEstablished": 379
      }
    ]
  },
  {
    "id": "crocus",
    "name": {
      "english": "Crocus",
      "japanese": "クロッカス",
      "romanized": "Kurokkasu"
    },
    "debut": {
      "episode": 62,
      "chapter": 102
    },
    "episodeAppearances": [379],
    "keyMoments": [
      {
        "episodeNumber": 379,
        "title": "Crocus Meets the Rumbar Pirates",
        "description": "Fifty years ago, Crocus met the Rumbar Pirates when they arrived at Twin Capes. He allowed them to stay at the lighthouse for three months while they repaired their ship.",
        "timestamp": "14:30",
        "significance": "Establishes Crocus's connection to the Rumbar Pirates and explains why he knows about their promise to Laboon."
      },
      {
        "episodeNumber": 379,
        "title": "Crocus Agrees to Care for Laboon",
        "description": "When the Rumbar Pirates decide to leave Laboon behind, Crocus agrees to watch over the young whale at Twin Capes until the crew returns.",
        "timestamp": "19:00",
        "significance": "This agreement begins Crocus's 50-year role as Laboon's caretaker, explaining his relationship with the whale when the Straw Hats meet them."
      }
    ],
    "reveals": [
      {
        "type": "BACKSTORY",
        "episodeNumber": 379,
        "description": "Fifty years ago, Crocus was already the lighthouse keeper at Twin Capes and met the Rumbar Pirates when they arrived to enter the Grand Line."
      },
      {
        "type": "BACKSTORY",
        "episodeNumber": 379,
        "description": "Crocus agreed to care for Laboon when the Rumbar Pirates left him behind, beginning a relationship that would last 50 years."
      }
    ],
    "affiliations": [
      {
        "type": "OCCUPATION",
        "organizationId": "twin-capes-lighthouse",
        "role": "Lighthouse Keeper",
        "episodeJoined": 379,
        "status": "ACTIVE",
        "note": "Shown as lighthouse keeper fifty years ago in flashback"
      }
    ],
    "relationships": [
      {
        "characterId": "laboon",
        "type": "CARETAKER",
        "description": "Crocus became Laboon's caretaker fifty years ago when the Rumbar Pirates entrusted the whale to him.",
        "episodeEstablished": 379
      },
      {
        "characterId": "yorki",
        "type": "ACQUAINTANCE",
        "description": "Crocus met Captain Yorki and the Rumbar Pirates when they stayed at Twin Capes for three months.",
        "episodeEstablished": 379
      },
      {
        "characterId": "brook",
        "type": "ACQUAINTANCE",
        "description": "Crocus met Brook as part of the Rumbar Pirates fifty years ago at Twin Capes.",
        "episodeEstablished": 379
      }
    ]
  }
]
