[
  {
    "id": "rumbar-pirates",
    "name": {
      "english": "Rumbar Pirates",
      "japanese": "ルンバー海賊団",
      "romanized": "Runbā Kaizoku-dan"
    },
    "debut": {
      "episode": 379,
      "chapter": 487
    },
    "status": "DISBANDED",
    "origin": "West Blue",
    "ship": {
      "name": "Unknown",
      "description": "A pirate ship bearing the Rumbar Pirates' jolly roger, eventually left in ruins in the Florian Triangle"
    },
    "captain": {
      "characterId": "yorki",
      "name": "Yorki",
      "episodeStart": 379,
      "note": "Original captain who later contracted an incurable disease"
    },
    "members": [
      {
        "characterId": "brook",
        "name": "Brook",
        "role": "Musician",
        "episodeJoined": 379,
        "status": "SOLE_SURVIVOR",
        "note": "Became acting captain after Yorki's departure; only survivor through Yomi Yomi no Mi"
      },
      {
        "characterId": "yorki",
        "name": "Yorki",
        "role": "Captain",
        "episodeJoined": 379,
        "status": "DECEASED",
        "note": "Left the crew via Calm Belt after contracting an incurable disease"
      },
      {
        "characterId": "mizuta-madaisuki",
        "name": "Mizuta Madaisuki",
        "role": "Crew Member",
        "episodeJoined": 379,
        "status": "DECEASED"
      },
      {
        "characterId": "mizuta-mawaritosuki",
        "name": "Mizuta Mawaritosuki",
        "role": "Crew Member",
        "episodeJoined": 379,
        "status": "DECEASED"
      },
      {
        "characterId": "rumbar-pirates-doctor",
        "name": "Rumbar Pirates' Doctor",
        "role": "Ship's Doctor",
        "episodeJoined": 379,
        "status": "DECEASED",
        "note": "Killed during poison attack in Florian Triangle"
      }
    ],
    "formerMembers": [
      {
        "characterId": "laboon",
        "name": "Laboon",
        "episodeJoined": 379,
        "episodeLeft": 379,
        "reason": "Left at Twin Capes for his safety before the crew entered the Grand Line"
      }
    ],
    "episodeAppearances": [379],
    "keyMoments": [
      {
        "episodeNumber": 379,
        "title": "The Rumbar Pirates Befriend Laboon",
        "description": "The Rumbar Pirates encounter baby Laboon in the West Blue. The musical crew bonds with the whale through their songs, particularly 'Bink's Sake,' and Laboon becomes an unofficial member of the crew.",
        "timestamp": "05:00",
        "significance": "Establishes the Rumbar Pirates as a musical crew and begins the tragic story of their promise to Laboon."
      },
      {
        "episodeNumber": 379,
        "title": "The Promise to Return for Laboon",
        "description": "At Twin Capes, the Rumbar Pirates make the difficult decision to leave Laboon behind for his safety. Captain Yorki promises they will return in 2-3 years after sailing around the Grand Line. The entire crew says farewell to Laboon.",
        "timestamp": "17:30",
        "significance": "This promise becomes the central tragedy of the crew's story, as they would never be able to fulfill it due to their deaths in the Grand Line."
      },
      {
        "episodeNumber": 379,
        "title": "The Fate of the Rumbar Pirates",
        "description": "The episode reveals that three years after leaving Laboon, the Rumbar Pirates' ship lies in ruins. Only Brook survived as a skeleton through his Devil Fruit power, with all other crew members deceased.",
        "timestamp": "20:30",
        "significance": "Reveals the tragic end of the Rumbar Pirates and establishes Brook's 50-year solitude and guilt over the broken promise to Laboon."
      }
    ],
    "description": "The Rumbar Pirates were a musical pirate crew from the West Blue. Every member was skilled in music and dance, creating a unique 'family of music rhythms and dance styles.' Fifty years before the main story, they befriended a baby Island Whale named Laboon and promised to return for him after circling the Grand Line. The crew was eventually decimated by disease and a poisoned attack in the Florian Triangle, with only Brook surviving as a skeleton through the power of the Yomi Yomi no Mi.",
    "specialTraits": [
      "All crew members were skilled musicians and singers",
      "Known for playing 'Bink's Sake' as their signature song",
      "Befriended the Island Whale Laboon in the West Blue"
    ],
    "fate": "The crew was destroyed approximately 47 years before the main story. Captain Yorki and some crew members left via the Calm Belt after contracting an incurable disease. The remaining crew, led by acting captain Brook, died from poisoned weapons in the Florian Triangle. Brook revived as a skeleton due to his Devil Fruit.",
    "trivia": [
      {
        "fact": "The Rumbar Pirates stayed at Twin Capes for three months while repairing their ship before entering the Grand Line.",
        "category": "HISTORY"
      },
      {
        "fact": "The crew's promise to return for Laboon in 2-3 years led to the whale waiting at Twin Capes for 50 years.",
        "category": "LEGACY"
      }
    ]
  }
]
