[
  {
    "id": "yomi-yomi-no-mi",
    "name": {
      "english": "Revive-Revive Fruit",
      "japanese": "ヨミヨミの実",
      "romanized": "Yomi Yomi no Mi"
    },
    "type": "Paramecia",
    "debut": {
      "episode": 337,
      "chapter": 443
    },
    "episodeAppearances": [379],
    "currentUser": {
      "characterId": "brook",
      "name": "Brook",
      "episodeObtained": 379,
      "note": "Shown in flashback - Brook had already consumed this fruit while alive with the Rumbar Pirates"
    },
    "abilities": [
      {
        "name": "One-Time Resurrection",
        "description": "Allows the user to return to life once after death",
        "firstShown": 379,
        "episodeNumber": 379,
        "note": "Result is shown - Brook survived death but returned as a skeleton"
      },
      {
        "name": "Continued Existence as Skeleton",
        "description": "After resurrection, the user continues to exist as a living skeleton, seemingly ageless",
        "firstShown": 379,
        "episodeNumber": 379,
        "note": "Brook is shown as a skeleton on the ruined ship, having survived while the rest of the crew perished"
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 379,
        "title": "The Result of the Yomi Yomi no Mi",
        "description": "The episode's ending reveals Brook as the only survivor of the Rumbar Pirates, existing as a living skeleton on the crew's ruined ship three years after leaving Laboon. This shows the effect of the Yomi Yomi no Mi - Brook died along with his crewmates but revived.",
        "timestamp": "20:30",
        "significance": "Demonstrates the bittersweet nature of the Yomi Yomi no Mi - while it saved Brook from permanent death, it also condemned him to 50 years of solitude and the inability to fulfill the promise to Laboon as the crew intended."
      }
    ],
    "weaknesses": [
      "Standard Devil Fruit weakness to seawater and Seastone",
      "Only allows resurrection once - a second death would be permanent",
      "User returns as a skeleton, potentially unrecognizable to those who knew them alive"
    ],
    "trivia": [
      {
        "fact": "The Yomi Yomi no Mi allowed Brook to survive the death of the Rumbar Pirates, but his soul took so long to find his body that it had already decomposed to just bones.",
        "category": "ABILITY"
      }
    ]
  }
]
