[
  {
    "id": "west-blue",
    "name": {
      "english": "West Blue",
      "japanese": "西の海",
      "romanized": "Nishi no Umi"
    },
    "type": "SEA",
    "debut": {
      "episode": 379,
      "chapter": 487,
      "note": "First shown in flashback"
    },
    "episodeAppearances": [379],
    "keyEvents": [
      {
        "episodeNumber": 379,
        "title": "Rumbar Pirates Befriend Baby Laboon in West Blue",
        "description": "In the West Blue fifty years ago, the Rumbar Pirates encounter a lost baby Island Whale who follows their ship. They name him Laboon and bond with him through music, particularly 'Bink's Sake.'",
        "timestamp": "05:00",
        "significance": "The West Blue is where the relationship between Laboon and the Rumbar Pirates begins, setting up one of One Piece's most emotional storylines."
      }
    ],
    "description": "The West Blue is one of the four seas that make up the Blue Sea. It is the origin of the Rumbar Pirates and where they first encountered baby Laboon fifty years before the main story.",
    "climate": "Varies by region",
    "inhabitants": "Various pirate crews, merchants, and civilians",
    "notableFeatures": [
      "One of the four Blues separated from the Grand Line",
      "Home to various pirate crews including the Rumbar Pirates"
    ]
  },
  {
    "id": "twin-capes",
    "name": {
      "english": "Twin Capes",
      "japanese": "双子岬",
      "romanized": "Futago Misaki"
    },
    "type": "LANDMARK",
    "debut": {
      "episode": 62,
      "chapter": 102
    },
    "episodeAppearances": [379],
    "keyEvents": [
      {
        "episodeNumber": 379,
        "title": "The Rumbar Pirates Arrive at Twin Capes",
        "description": "Fifty years ago, the Rumbar Pirates arrived at Twin Capes via Reverse Mountain with Laboon following them. They met lighthouse keeper Crocus and stayed for three months while repairing their ship.",
        "timestamp": "13:00",
        "significance": "Twin Capes is where the Rumbar Pirates made their fateful decision to leave Laboon behind and where Crocus began his 50-year role as the whale's caretaker."
      },
      {
        "episodeNumber": 379,
        "title": "Laboon Left at Twin Capes",
        "description": "The Rumbar Pirates leave Laboon at Twin Capes in Crocus's care, promising to return in 2-3 years. Laboon agrees to wait for them at the entrance to the Grand Line.",
        "timestamp": "19:00",
        "significance": "This location becomes Laboon's home for the next 50 years as he waits for the Rumbar Pirates' promised return."
      }
    ],
    "description": "Twin Capes is the location at the entrance of the Grand Line where Reverse Mountain's waters flow into the sea. It features a lighthouse where Crocus resides. Fifty years before the main story, it became Laboon's home when the Rumbar Pirates left him there with the promise to return.",
    "climate": "Temperate",
    "inhabitants": "Crocus (lighthouse keeper), Laboon (Island Whale)",
    "notableFeatures": [
      "Lighthouse maintained by Crocus",
      "Entrance point to the Grand Line from Reverse Mountain",
      "Laboon's waiting spot for 50 years"
    ]
  },
  {
    "id": "reverse-mountain",
    "name": {
      "english": "Reverse Mountain",
      "japanese": "リヴァース・マウンテン",
      "romanized": "Rivāsu Maunten"
    },
    "type": "LANDMARK",
    "debut": {
      "episode": 61,
      "chapter": 101
    },
    "episodeAppearances": [379],
    "keyEvents": [
      {
        "episodeNumber": 379,
        "title": "Laboon Follows Rumbar Pirates Over Reverse Mountain",
        "description": "Despite the Rumbar Pirates' attempt to leave Laboon behind, the determined baby whale follows them over Reverse Mountain into the Grand Line, demonstrating his unwavering loyalty.",
        "timestamp": "15:00",
        "significance": "Laboon's dangerous journey over Reverse Mountain shows the depth of his attachment to the Rumbar Pirates and forces them to make the difficult decision to officially leave him at Twin Capes."
      }
    ],
    "description": "Reverse Mountain is a mountain at one of the points where the four Blues meet and is one of the two known entrances to the Grand Line. Water from each of the Blues flows up the mountain and converges at the top before flowing down into the Grand Line.",
    "climate": "Varies with altitude",
    "inhabitants": "None",
    "notableFeatures": [
      "Water flows upward from all four Blues",
      "Dangerous passage requiring skill to navigate",
      "Gateway to the Grand Line"
    ]
  }
]
