[
  {
    "name": {
      "english": "Net-Net Fruit",
      "japanese": "アミアミの実",
      "romanized": "Ami Ami no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 427,
    "debutChapter": null,
    "description": "A Paramecia-type Devil Fruit that allows the user to produce nets from their body. The user can create sticky nets as a base ability, and can create specialized nets by ingesting materials, giving them properties of the consumed substance such as metal, fire, or boiling water.",
    "episodeAppearances": [427],
    "users": [
      {
        "characterId": "largo",
        "episodeStart": 427,
        "episodeEnd": "present",
        "circumstances": "Largo is already a user when first introduced in the Little East Blue arc"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Mucho Neto Net",
        "episodeRevealed": 427,
        "description": "Largo produces sticky web-like nets at an opponent. This is the most basic type of net that Largo can produce, and he does not need to consume anything to create it.",
        "severity": "MAJOR",
        "firstUseContext": "Largo uses this ability when demonstrating his Devil Fruit powers to Luffy and the Straw Hats."
      },
      {
        "abilityName": "Mucho Cho Shi Mo",
        "episodeRevealed": 427,
        "description": "Largo eats metal, then fires the metal from his hands in the form of a barbed wire net. This demonstrates the fruit's ability to create material-based nets.",
        "severity": "MAJOR",
        "firstUseContext": "Largo uses this technique to trap Luffy in a dangerous spiked net at the end of the episode."
      },
      {
        "abilityName": "Net Body Transformation",
        "episodeRevealed": 427,
        "description": "Largo can transform his body into a net to trap opponents.",
        "severity": "MAJOR",
        "firstUseContext": "Mentioned as one of Largo's capabilities with the Ami Ami no Mi."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 427,
        "severity": "MAJOR"
      }
    ],
    "strengths": [
      {
        "strength": "High capture rate - Largo claims 120% capture success",
        "episodeRevealed": 427,
        "description": "The versatility and binding power of the nets makes them extremely effective for capturing opponents.",
        "severity": "MAJOR"
      },
      {
        "strength": "Material absorption creates specialized nets",
        "episodeRevealed": 427,
        "description": "By consuming different materials, the user can create nets with various properties (metal, fire, water, etc.), making the ability highly versatile.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "COMMON",
    "powerTier": "MEDIUM",
    "notes": "This is an anime-only Devil Fruit created for the Little East Blue arc and does not appear in the manga or any canon One Piece material."
  }
]
