[
  {
    "name": {
      "english": "Paw-Paw Fruit",
      "japanese": "ニキュニキュの実",
      "romanized": "Nikyu Nikyu no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 151,
    "debutChapter": 233,
    "description": "Grants the user paw pads on their hands that can repel anything they touch, including physical objects, attacks, and even abstract concepts like pain and fatigue. The user becomes a Paw Human.",
    "episodeAppearances": [377],
    "users": [
      {
        "characterId": "kuma",
        "episodeStart": 151,
        "episodeEnd": "present",
        "circumstances": "Bartholomew Kuma consumed this fruit at an unknown time before becoming a Warlord of the Sea"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Pain and Damage Extraction",
        "episodeRevealed": 377,
        "description": "The user can extract all accumulated pain, damage, and fatigue from a person's body by repelling it out, creating a compressed bubble of concentrated suffering.",
        "severity": "CRITICAL",
        "firstUseContext": "Kuma uses this ability to extract all of Luffy's accumulated pain and damage from the Thriller Bark battles, creating a massive paw-shaped bubble of agony."
      },
      {
        "abilityName": "Pain Transfer",
        "episodeRevealed": 377,
        "description": "After extracting pain and damage into a bubble, the user can transfer it to another person who will experience all of that suffering at once.",
        "severity": "CRITICAL",
        "firstUseContext": "Kuma transfers Luffy's pain to Zoro, who voluntarily absorbs the massive bubble of concentrated agony to save his captain."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 151,
        "severity": "MAJOR"
      }
    ],
    "strengths": [
      {
        "strength": "Can repel abstract concepts like pain and fatigue, not just physical matter",
        "episodeRevealed": 377,
        "description": "The fruit's power extends beyond physical objects to intangible things like accumulated damage and suffering.",
        "severity": "CRITICAL"
      },
      {
        "strength": "Extracted pain can be weaponized or used to heal allies",
        "episodeRevealed": 377,
        "description": "By removing someone's pain and damage, Kuma can effectively heal them while potentially using that pain against enemies.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "RARE",
    "powerTier": "VERY_HIGH"
  }
]
