[
  {
    "name": {
      "english": "Paw-Paw Fruit",
      "japanese": "ニキュニキュの実",
      "romanized": "Nikyu Nikyu no Mi"
    },
    "type": "PARAMECIA",
    "episodeAppearances": [376],
    "keyMoments": [
      {
        "episodeNumber": 376,
        "eventId": "ep376-event-002",
        "momentType": "POWER_REVEAL",
        "title": "Full Devil Fruit Power Reveal",
        "description": "Bartholomew Kuma reveals that he has eaten the Nikyu Nikyu no Mi, explaining that it allows him to repel anything with the paw pads on his hands, including attacks, objects, and even air itself.",
        "significance": "First comprehensive reveal of the Nikyu Nikyu no Mi's mechanics and capabilities, establishing it as one of the most versatile Devil Fruits introduced up to this point in the series.",
        "timestamp": "05:30"
      },
      {
        "episodeNumber": 376,
        "eventId": "ep376-event-003",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "Puni Technique Demonstrated",
        "description": "The basic repelling ability of the Nikyu Nikyu no Mi is demonstrated as Kuma deflects all of Zoro's sword strikes and physical attacks.",
        "significance": "Shows the fundamental defensive application of the Devil Fruit's power.",
        "timestamp": "07:45"
      },
      {
        "episodeNumber": 376,
        "eventId": "ep376-event-006",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "Tsuppari Pad Ho Technique",
        "description": "Kuma uses Tsuppari Pad Ho, an offensive technique where he thrusts his paw pads forward rapidly to attack opponents.",
        "significance": "Demonstrates the offensive capabilities of the Nikyu Nikyu no Mi beyond just repelling attacks.",
        "timestamp": "14:25"
      },
      {
        "episodeNumber": 376,
        "eventId": "ep376-event-010",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "Ursus Shock - Ultimate Attack",
        "description": "Kuma demonstrates the devastating Ursus Shock technique by compressing massive amounts of air into a small paw-shaped bubble, then releasing it to create an explosion that destroys most of Thriller Bark.",
        "significance": "Reveals the true destructive potential of the Nikyu Nikyu no Mi and establishes it as capable of island-level devastation.",
        "timestamp": "20:50"
      }
    ],
    "currentUser": "bartholomew-kuma",
    "abilities": [
      {
        "abilityName": "Repelling",
        "episodeRevealed": 376,
        "description": "The core ability of the Nikyu Nikyu no Mi allows the user to repel anything that comes into contact with their paw pads, including physical objects, living beings, attacks, and even intangible things like air and pain."
      },
      {
        "abilityName": "Puni",
        "episodeRevealed": 376,
        "description": "Basic defensive technique where Kuma uses his paw pads to deflect incoming attacks and objects."
      },
      {
        "abilityName": "Tsuppari Pad Ho",
        "episodeRevealed": 376,
        "description": "Offensive technique where Kuma rapidly thrusts his paw pads forward to attack opponents with repelling force."
      },
      {
        "abilityName": "Ursus Shock",
        "episodeRevealed": 376,
        "description": "Ultimate attack where Kuma compresses a massive amount of air by repeatedly repelling it, creating a small dense bubble. When released, it explodes into a giant paw-shaped shockwave with enough power to devastate an entire island."
      },
      {
        "abilityName": "High-Speed Movement",
        "episodeRevealed": 376,
        "description": "By repelling air at high velocity and/or repelling himself, Kuma can move at extremely high speeds that appear almost like teleportation."
      }
    ],
    "reveals": [
      {
        "infoType": "ABILITY",
        "information": "Can repel anything including attacks, objects, air, and intangible concepts",
        "episodeRevealed": 376,
        "severity": "CRITICAL"
      },
      {
        "infoType": "USER",
        "information": "Current user is Bartholomew Kuma, one of the Seven Warlords of the Sea",
        "episodeRevealed": 376,
        "severity": "MAJOR"
      },
      {
        "infoType": "TECHNIQUE",
        "information": "Ursus Shock can cause island-level destruction",
        "episodeRevealed": 376,
        "severity": "CRITICAL"
      }
    ]
  }
]
