[
  {
    "theory": "The Marine photographer who failed to take Sanji's photo (leaving the lens cap on) was either incompetent or did it intentionally to protect Sanji's identity, possibly because Sanji helped someone in the Marine's past or family.",
    "author": "Various One Piece fans",
    "platform": "Reddit/Forums",
    "url": null,
    "publishDate": null,
    "spoilerWarning": "MINOR",
    "episodesSpanned": [151, 388],
    "evidenceForTheory": [
      "The lens cap being left on seems like an unusual mistake for a professional",
      "The sketch artist then had to draw Sanji from memory or description",
      "This 'mistake' actually protected Sanji's identity for a long time"
    ],
    "evidenceAgainstTheory": [
      "It's presented as a simple comedic mistake in the series",
      "Oda uses it purely as a gag that later creates the Duval situation",
      "No follow-up or reveal suggests it was intentional"
    ],
    "popularityMetrics": {
      "upvotes": null,
      "discussionThreads": null,
      "videoViews": null
    },
    "status": "DEBUNKED",
    "resolution": "Canon confirms it was simply an accidental mistake that became a running gag and plot point."
  },
  {
    "theory": "Duval's resemblance to Sanji's wanted poster is more than coincidence - there may be a distant family connection or genetic similarity between them, explaining the similar facial features.",
    "author": "One Piece theory communities",
    "platform": "Various forums",
    "url": null,
    "publishDate": "2009",
    "spoilerWarning": "MINOR",
    "episodesSpanned": [388, 389],
    "evidenceForTheory": [
      "The facial similarity is presented as being extremely close",
      "Both have distinctive spiral eyebrows (though in opposite directions)",
      "One Piece often reveals surprising character connections"
    ],
    "evidenceAgainstTheory": [
      "The resemblance is to a poorly-drawn sketch, not Sanji's actual face",
      "It's explicitly presented as comedic coincidence",
      "No canonical connection is ever suggested",
      "Duval's eyebrow spirals in the opposite direction from Sanji's"
    ],
    "popularityMetrics": {
      "upvotes": null,
      "discussionThreads": null,
      "videoViews": null
    },
    "status": "DEBUNKED",
    "resolution": "The series treats this as pure coincidence and comedy, not a meaningful connection."
  },
  {
    "theory": "The Duval arc is Oda's commentary on mistaken identity and wrongful persecution, serving as a metaphor for how wanted posters and criminal justice systems can harm innocent people.",
    "author": "One Piece analysis communities",
    "platform": "Blogs and analysis videos",
    "url": "https://birdsofherme.wordpress.com/2021/08/12/one-piece-how-oda-can-make-a-plot-point-out-of-anything-random-the-case-of-sanji/",
    "publishDate": "2021",
    "spoilerWarning": "MINOR",
    "episodesSpanned": [151, 388, 389],
    "evidenceForTheory": [
      "Duval genuinely suffers from mistaken identity",
      "Shows how bounty system can harm innocents",
      "One Piece often includes social commentary",
      "Duval's backstory emphasizes years of unjust persecution"
    ],
    "evidenceAgainstTheory": [
      "The arc is primarily comedic in tone",
      "If intended as serious commentary, the humor undercuts the message",
      "Other arcs handle social issues more directly"
    ],
    "popularityMetrics": {
      "upvotes": null,
      "discussionThreads": null,
      "videoViews": null
    },
    "status": "PLAUSIBLE",
    "resolution": "While primarily comedic, the arc does touch on themes of mistaken identity and unintended consequences that align with One Piece's broader themes."
  }
]
