[
  {
    "id": "theory-ep231-001",
    "title": "Franky Family Secretly Working for the World Government",
    "summary": "Early viewer speculation that the Franky Family might be connected to the Marines or CP9 due to their targeted theft of the Straw Hats' money.",
    "fullText": "When Episode 231 first aired, some viewers theorized that the Franky Family's theft of the Straw Hats' money might not be a random act of piracy, but rather a coordinated effort by the World Government or CP9 to weaken the crew before a larger attack. The timing of the theft, coinciding with the Straw Hats' meeting with Iceburg (who was secretly targeted by CP9), seemed too convenient to be coincidence. However, this theory was quickly disproven as the arc progressed, revealing that the Franky Family was indeed independent and the real conspiracy involved members of Galley-La Company.",
    "author": "neverwatchedonepiece (Tumblr)",
    "source": {
      "url": "https://www.tumblr.com/neverwatchedonepiece/118801534454/231-the-franky-family-and-iceburg",
      "title": "Episode 231 Review - Never Watched One Piece",
      "platform": "Tumblr",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2015-05-20",
    "episodeRange": [231, 235],
    "minEpisode": 231,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 235
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "DISPROVEN",
    "relatedCharacters": ["franky", "zambai", "iceburg"],
    "relatedLocations": ["water-7-streets"],
    "relatedEvents": ["ep231-event-006"],
    "tags": ["franky-family", "world-government", "cp9", "water-7", "disproven"]
  },
  {
    "id": "theory-ep231-002",
    "title": "Robin's Secret Meeting Foreshadows Her Betrayal",
    "summary": "The mysterious masked figure that Robin follows in Episode 231 sparked theories about Robin potentially betraying the crew or having secret connections.",
    "fullText": "When Sanji spotted Robin following a mysterious masked figure in Episode 231, many viewers immediately began theorizing about Robin's true intentions. Some believed she might be working with bounty hunters or the World Government, while others thought she was investigating a threat on her own. The fact that both Robin and the masked figure disappeared so quickly added to the mystery. This scene was one of the first hints at the larger conspiracy involving CP9 and Robin's eventual sacrifice to protect the Straw Hats, though viewers at the time couldn't have known the full extent of what was coming.",
    "author": "Early Water 7 Arc Viewers",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_231",
      "title": "Episode 231 - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2005-05-01",
    "episodeRange": [231, 239],
    "minEpisode": 231,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 239
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["robin", "sanji"],
    "relatedLocations": ["water-7-streets"],
    "relatedEvents": ["ep231-event-007"],
    "tags": ["robin", "cp9", "betrayal", "foreshadowing", "mystery"]
  },
  {
    "id": "theory-ep231-003",
    "title": "Kaku's Nose Design Hints at Usopp Connection",
    "summary": "Fans theorized that Kaku's distinctive square nose, so similar to Usopp's long nose, might indicate a deeper narrative connection between the two characters.",
    "fullText": "When Kaku was introduced in Episode 231 with his distinctive square nose, which the Straw Hats immediately compared to Usopp's long nose, some fans theorized this was more than just a visual gag. Some speculated that Kaku might be related to Usopp, perhaps a distant relative or someone from the same island. Others thought the similarity in their noses might symbolize a parallel between their roles as craftsmen (Usopp as the crew's sniper and inventor, Kaku as a shipwright). While no blood relation was ever established, the visual parallel did add an interesting dimension to their later confrontation during the Enies Lobby Arc, where they both demonstrated creativity and unconventional fighting styles.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Kaku",
      "title": "Kaku - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-11-18"
    },
    "postedDate": "2005-05-01",
    "episodeRange": [231, 300],
    "minEpisode": 231,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 231
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["kaku", "usopp"],
    "relatedLocations": [],
    "relatedEvents": ["ep231-event-003"],
    "tags": ["kaku", "usopp", "character-design", "symbolism"]
  }
]
