[
  {
    "name": {
      "english": "Great Buddha Slayer",
      "japanese": "大鉄斬り",
      "romanized": "Dai Tetsugiri"
    },
    "debutEpisode": 383,
    "debutChapter": null,
    "episodeAppearances": [383],
    "abilityType": "SWORDPLAY",
    "category": "THREE_SWORD_STYLE",
    "user": "zoro",
    "description": "Zoro leaps backward and performs four parallel vertical cuts below him using his Three Sword Style. The technique is powerful enough to slice through massive objects like giant cannons.",
    "requirements": "Three swords and proficiency in Three Sword Style",
    "strengths": "Capable of cutting through very large and durable objects like metal cannons. Effective for rescue operations where precision cutting is needed.",
    "weaknesses": null,
    "firstUse": {
      "episodeNumber": 383,
      "eventId": "ep383-event-008",
      "context": "Zoro used this technique to cut through Doran's giant cannon and free Sayo from her restraints.",
      "timestamp": "17:30",
      "outcome": "Successfully destroyed the cannon and rescued Sayo"
    },
    "variations": [],
    "relatedAbilities": [],
    "images": [],
    "trivia": [
      "This is an anime-only technique that does not appear in the manga.",
      "The name literally translates to 'Great Iron Cutter' but is called 'Great Buddha Slayer' in Funimation subs.",
      "This technique is different from the canonical 'Daibutsu Giri' (Great Buddha Cutter) that appears later in the series."
    ]
  },
  {
    "name": {
      "english": "Special Tobasco Star",
      "japanese": "スペシャルタバスコ星",
      "romanized": "Supesharu Tabasuko Sutā"
    },
    "debutEpisode": 383,
    "debutChapter": null,
    "episodeAppearances": [383],
    "abilityType": "WEAPON",
    "category": "SLINGSHOT",
    "user": "usopp",
    "description": "Usopp shoots a special star projectile filled with extremely hot tobasco sauce. When it hits the target's mouth, it heats up and causes intense burning pain, incapacitating the opponent.",
    "requirements": "Usopp's slingshot and specialized tobasco-filled ammunition",
    "strengths": "Effective for incapacitating opponents without causing serious injury. Can be used strategically in combination with other attacks.",
    "weaknesses": "Must hit the target's mouth to be effective",
    "firstUse": {
      "episodeNumber": 383,
      "eventId": "ep383-event-007",
      "context": "Usopp used this attack on Doran after Robin restrained him, shooting the star into his mouth to further incapacitate the villain.",
      "timestamp": "17:00",
      "outcome": "Successfully incapacitated Doran, allowing the rescue operation to proceed"
    },
    "variations": [],
    "relatedAbilities": ["tobasco-star"],
    "images": [],
    "trivia": [
      "This is one of Usopp's many creative ammunition types for his slingshot.",
      "The attack demonstrates Usopp's tactical thinking in non-lethal combat.",
      "Part of Usopp's arsenal of specialized stars with different effects."
    ]
  },
  {
    "name": {
      "english": "Six Flowers",
      "japanese": "六輪花",
      "romanized": "Seis Fleur"
    },
    "debutEpisode": null,
    "debutChapter": null,
    "episodeAppearances": [383],
    "abilityType": "DEVIL_FRUIT",
    "category": "HANA_HANA_NO_MI",
    "user": "robin",
    "description": "Robin uses her Hana Hana no Mi Devil Fruit powers to sprout six arms on a target or surface. She uses this to restrain opponents or manipulate objects.",
    "requirements": "Hana Hana no Mi Devil Fruit powers",
    "strengths": "Effective for restraining opponents from a distance. Can be used tactically without direct combat.",
    "weaknesses": "Standard Devil Fruit weaknesses (sea water, Seastone)",
    "firstUse": {
      "episodeNumber": 383,
      "eventId": "ep383-event-006",
      "context": "Robin used Seis Fleur to hold down Doran during the rescue operation, preventing him from interfering.",
      "timestamp": "16:45",
      "outcome": "Successfully restrained Doran, allowing the crew to proceed with the rescue"
    },
    "variations": [],
    "relatedAbilities": ["hana-hana-no-mi"],
    "images": [],
    "trivia": [
      "Seis Fleur is Spanish for 'Six Flowers,' following the naming pattern of Robin's techniques.",
      "This is one of Robin's basic Hana Hana no Mi techniques, sprouting a relatively small number of limbs.",
      "Robin often uses this technique for restraining rather than attacking."
    ]
  },
  {
    "name": {
      "english": "Gum-Gum Gigant Axe",
      "japanese": "ゴムゴムの巨人の斧",
      "romanized": "Gomu Gomu no Giganto Ono"
    },
    "debutEpisode": null,
    "debutChapter": null,
    "episodeAppearances": [383],
    "abilityType": "DEVIL_FRUIT",
    "category": "GEAR_THIRD",
    "user": "luffy",
    "description": "A Gear Third technique where Luffy inflates his leg to giant size by biting his thumb and blowing air into his bones, then brings it down on his target with devastating axe-like force. The enlarged limb delivers tremendous impact.",
    "requirements": "Gomu Gomu no Mi Devil Fruit powers and Gear Third mastery",
    "strengths": "Extremely powerful attack capable of destroying large structures and defeating strong opponents. The giant size provides massive destructive force.",
    "weaknesses": "After using Gear Third, Luffy experiences a shrinking side effect where he becomes small for a period of time. Requires air inflation which takes time.",
    "firstUse": {
      "episodeNumber": 383,
      "eventId": "ep383-event-009",
      "context": "Luffy used this attack to counter Doran's desperate cannon attack, destroying the cannon and splitting Spa Island in half.",
      "timestamp": "18:30",
      "outcome": "Defeated Doran and destroyed Spa Island, revealing the underwater volcano beneath"
    },
    "variations": [],
    "relatedAbilities": ["gomu-gomu-no-mi", "gear-third"],
    "images": [],
    "trivia": [
      "This is the Gear Third version of Luffy's regular Gomu Gomu no Ono (Gum-Gum Axe) technique.",
      "The attack was powerful enough to split an entire island-ship in two.",
      "This technique was first seen being used against Rob Lucci during the Enies Lobby arc."
    ]
  }
]
