[
  {
    "name": {
      "english": "Rainbow Gem",
      "japanese": "虹の宝石",
      "romanized": "Niji no Hōseki"
    },
    "debutEpisode": 382,
    "episodeAppearances": [383],
    "itemType": "TREASURE",
    "description": "A special gem created using a complex formula developed by Sayo and Lina's father. The gem requires volcanic steam from an X-shaped underwater volcano as the final ingredient, which creates a rainbow effect when combined with sunlight.",
    "appearance": "A beautiful gem that produces rainbow effects when exposed to light.",
    "history": "Created from research left behind by Sayo and Lina's father, who spent years developing the formula. He hid the research to protect his daughters from pursuers like Foxy and Doran who wanted the gem's secret.",
    "abilities": null,
    "currentOwner": null,
    "ownershipHistory": [
      {
        "characterId": "sayo-and-lina-father",
        "episodeStart": null,
        "episodeEnd": null,
        "description": "Original researcher who developed the formula"
      },
      {
        "characterId": "sayo",
        "episodeStart": 382,
        "episodeEnd": 383,
        "description": "Inherited the research and completed the gem"
      },
      {
        "characterId": "lina",
        "episodeStart": 382,
        "episodeEnd": 383,
        "description": "Helped complete the gem with Sayo"
      },
      {
        "characterId": "luffy",
        "episodeStart": 383,
        "episodeEnd": 383,
        "description": "Received the gem from Sayo and Lina but immediately lost it"
      }
    ],
    "significance": "Represents the father's legacy and love for his daughters. The quest to complete it drives the Spa Island arc's plot.",
    "keyEvents": [
      {
        "episodeNumber": 383,
        "eventId": "ep383-event-011",
        "title": "Discovery of Final Ingredient",
        "description": "The X-shaped underwater volcano is discovered, revealing that volcanic steam is the final ingredient needed for the rainbow gem.",
        "timestamp": "20:00"
      },
      {
        "episodeNumber": 383,
        "eventId": "ep383-event-012",
        "title": "Rainbow Effect Phenomenon",
        "description": "The volcanic steam creates a rainbow effect when combined with sunlight, revealing the secret of the gem's creation.",
        "timestamp": "20:45"
      },
      {
        "episodeNumber": 383,
        "eventId": "ep383-event-014",
        "title": "Rainbow Gem Completed",
        "description": "Sayo and Lina successfully complete the rainbow gem and send it to the Straw Hat Pirates.",
        "timestamp": "22:30"
      },
      {
        "episodeNumber": 383,
        "eventId": "ep383-event-015",
        "title": "Luffy Loses the Rainbow Gem",
        "description": "Luffy accidentally loses the completed rainbow gem on the Thousand Sunny.",
        "timestamp": "23:00"
      }
    ],
    "images": [],
    "trivia": [
      "The rainbow gem required volcanic steam from a specific X-shaped underwater volcano to be completed.",
      "Luffy lost the gem almost immediately after receiving it, providing a comedic end to the arc.",
      "The gem's creation process references manga-canon elements from Chapter 490 regarding circular rainbows."
    ]
  },
  {
    "name": {
      "english": "Father's Research Notebook",
      "japanese": "父の研究ノート",
      "romanized": "Chichi no Kenkyū Nōto"
    },
    "debutEpisode": 382,
    "episodeAppearances": [383],
    "itemType": "KNOWLEDGE",
    "description": "A notebook containing the research and formulas for creating the rainbow gem, developed by Sayo and Lina's father. The notebook contains complex formulas that only someone as intelligent as Sayo could understand.",
    "appearance": "A research notebook filled with scientific formulas and notes.",
    "history": "Created by Sayo and Lina's father during his research. He sent it to his daughters before leaving to protect them from pursuers who wanted to steal his research for profit.",
    "abilities": null,
    "currentOwner": "sayo",
    "ownershipHistory": [
      {
        "characterId": "sayo-and-lina-father",
        "episodeStart": null,
        "episodeEnd": null,
        "description": "Original creator and researcher"
      },
      {
        "characterId": "sayo",
        "episodeStart": 382,
        "episodeEnd": null,
        "description": "Received the notebook from her father and used it to complete the gem"
      },
      {
        "characterId": "lina",
        "episodeStart": 382,
        "episodeEnd": null,
        "description": "Co-custodian of the notebook with her sister"
      }
    ],
    "significance": "Contains the secret to creating the rainbow gem and represents the father's legacy. The notebook was the object of desire for both Doran and Foxy.",
    "keyEvents": [
      {
        "episodeNumber": 383,
        "eventId": "ep383-event-005",
        "title": "Doran Demands the Notebook",
        "description": "Doran threatens to execute Sayo unless Lina hands over the research notebook.",
        "timestamp": "15:30"
      }
    ],
    "images": [],
    "trivia": [
      "The notebook contained formulas so complex that only Sayo could understand them.",
      "Foxy and his crew had been pursuing the notebook's owner, forcing him to leave his daughters to protect them.",
      "The notebook ultimately led to the discovery of the X-shaped underwater volcano."
    ]
  }
]
