[
  {
    "id": "theory-ep375-001",
    "title": "Kuma's Revolutionary Army Connection Theory",
    "theoryText": "Before Kuma's backstory was revealed, fans theorized that Kuma was an undercover member of the Revolutionary Army who couldn't reveal his true allegiance to the Marines. This theory suggested that he was pretending to follow the World Government's orders while actually testing the Straw Hats to see if they were worthy allies, particularly because of Luffy being Dragon's son.",
    "author": "r/OnePiece community (collective theory)",
    "episodesSpanned": [375, 376, 377, 512],
    "minEpisode": 375,
    "status": "CONFIRMED",
    "confirmationEpisode": 1100,
    "spoilerStatus": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 1100,
      "spoilerDescription": "Theory was later confirmed by Kuma's backstory in the Egghead arc"
    },
    "popularity": "HIGH",
    "submittedDate": "2008-2009",
    "tags": ["kuma", "revolutionary-army", "thriller-bark", "dragon", "confirmed-theory"]
  },
  {
    "id": "theory-ep375-002",
    "title": "Zoro's Sacrifice as a Test of Loyalty",
    "theoryText": "Fans theorized that Kuma's offer to Zoro (to take Luffy's pain in exchange for sparing the crew) was a deliberate test to see if Dragon's son had truly worthy and loyal crewmates. The theory suggested that Kuma was evaluating whether Luffy deserved to be protected or helped, and Zoro's willingness to sacrifice himself proved the crew's loyalty and strength of bonds.",
    "author": "One Piece community discussion forums",
    "episodesSpanned": [375, 376, 377],
    "minEpisode": 375,
    "status": "HIGHLY_LIKELY",
    "spoilerStatus": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 1100,
      "spoilerDescription": "Later revelations about Kuma's character support this interpretation"
    },
    "popularity": "HIGH",
    "submittedDate": "2008-2009",
    "tags": ["kuma", "zoro", "sacrifice", "loyalty-test", "thriller-bark"]
  },
  {
    "id": "theory-ep375-003",
    "title": "Kuma's Admiration for Nika Theory",
    "theoryText": "This theory, developed after more information about Nika was revealed, suggests that Kuma recognized Luffy's resemblance to the legendary Nika (Joy Boy) and believed Luffy would be the one to save the world. Therefore, Kuma deliberately spared the Straw Hats despite his orders because he saw Luffy as the prophesied liberator. Fans pointed to Kuma's comment about Dragon raising 'a good son' as evidence he was evaluating Luffy's worthiness.",
    "author": "Various One Piece theory channels and forums",
    "episodesSpanned": [375, 376, 377, 1071, 1100],
    "minEpisode": 375,
    "status": "CONFIRMED",
    "confirmationEpisode": 1100,
    "spoilerStatus": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 1100,
      "spoilerDescription": "Contains major spoilers about Nika/Joy Boy, Gear 5, and Kuma's backstory from Egghead arc"
    },
    "popularity": "VERY_HIGH",
    "submittedDate": "2022-2024",
    "tags": ["kuma", "nika", "joy-boy", "prophecy", "gear-5", "ultra-spoilers"]
  },
  {
    "id": "theory-ep375-004",
    "title": "World Government Cover-Up Pattern Theory",
    "theoryText": "Fans noted that the World Government's order to eliminate all witnesses to Moria's defeat mirrors their previous actions after Crocodile's defeat at Alabasta. This led to theories about a pattern of the Government being willing to commit mass murder to maintain the appearance of Warlord strength and prevent public knowledge of their failures. The theory suggested this reveals systemic corruption and willingness to sacrifice innocents for propaganda purposes.",
    "author": "r/OnePiece analysis threads",
    "episodesSpanned": [151, 375, 376],
    "minEpisode": 151,
    "status": "CONFIRMED",
    "spoilerStatus": {
      "containsSpoilers": false,
      "maxEpisodeSpoiler": 376,
      "spoilerDescription": "Theory based on patterns observed up through Thriller Bark"
    },
    "popularity": "HIGH",
    "submittedDate": "2008-2009",
    "tags": ["world-government", "warlords", "corruption", "cover-up", "pattern"]
  },
  {
    "id": "theory-ep375-005",
    "title": "Luffy Will Never Know Theory",
    "theoryText": "A popular tragic theory among fans is that Luffy will never find out about Zoro's sacrifice at Thriller Bark, and the 'Nothing Happened' moment will remain a secret between Zoro, Sanji, and the audience. Fans debate whether it would be better for Luffy to know (showing the full extent of his crew's loyalty) or for it to remain unknown (preserving Zoro's selfless act as truly unconditional). Many believe that if Luffy did find out, he would be heartbroken that Zoro suffered so much for him.",
    "author": "One Piece fandom (widespread discussion)",
    "episodesSpanned": [375, 376, 377],
    "minEpisode": 375,
    "status": "UNRESOLVED",
    "spoilerStatus": {
      "containsSpoilers": false,
      "maxEpisodeSpoiler": 377,
      "spoilerDescription": "Speculation about future story developments"
    },
    "popularity": "VERY_HIGH",
    "submittedDate": "2008-present",
    "tags": ["zoro", "luffy", "nothing-happened", "sacrifice", "character-relationships"]
  }
]
