[
  {
    "id": "theory-ep635-001",
    "title": "CP0's Hidden Agenda in Dressrosa",
    "summary": "CP0's sudden appearance in Dressrosa suggests they have a hidden agenda beyond simple observation. They may be working with or against Doflamingo for the World Government's interests.",
    "fullText": "The debut of CP0 in Dressrosa raises questions about the World Government's true involvement in the island's affairs. Are they there to support Doflamingo as a Warlord, or are they monitoring him because they suspect his illegal operations? Some fans theorize that CP0's presence indicates the World Government knows about the weapon factories and human trafficking but is either complicit or planning to use this information for leverage. Others believe CP0 is investigating Doflamingo independently, potentially setting up a future conflict between the Warlord and the World Government.",
    "author": "Reddit Community",
    "source": {
      "url": "https://www.reddit.com/r/OnePiece/",
      "title": "r/OnePiece Community Discussions",
      "platform": "Reddit",
      "accessedAt": "2026-01-15"
    },
    "postedDate": "2014-03-05",
    "episodeRange": [635, 750],
    "minEpisode": 635,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 750
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["guernika", "joseph", "gismonda", "doflamingo"],
    "relatedLocations": ["dressrosa"],
    "relatedEvents": ["ep635-event-001"],
    "tags": ["cp0", "world-government", "doflamingo", "conspiracy"]
  },
  {
    "id": "theory-ep635-002",
    "title": "The Mysterious Intruder on the Thousand Sunny",
    "summary": "The strange noises heard on the Thousand Sunny suggest an intruder has boarded the ship. Theories range from a Dressrosa spy to a friendly stowaway.",
    "fullText": "When Nami, Chopper, Brook, and Momonosuke hear mysterious noises from inside the Thousand Sunny, fans immediately began speculating about the source. Popular theories included: (1) A Doflamingo spy has infiltrated the ship to gather intelligence or sabotage it, (2) One of the Tontatta dwarves has accidentally become trapped on the ship while stealing 'offerings,' (3) A character from a previous arc is hiding on the ship, or (4) It's related to the living ship elements of the Thousand Sunny that have been hinted at before. The mystery creates tension and suggests immediate danger for the crew members left to guard the ship.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_635",
      "title": "Episode 635 Discussion",
      "platform": "Fandom",
      "accessedAt": "2026-01-15"
    },
    "postedDate": "2014-03-02",
    "episodeRange": [635, 640],
    "minEpisode": 635,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 640
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["nami", "chopper", "brook", "momonosuke"],
    "relatedLocations": ["thousand-sunny"],
    "relatedEvents": ["ep635-event-009"],
    "tags": ["mystery", "thousand-sunny", "intruder", "foreshadowing"]
  },
  {
    "id": "theory-ep635-003",
    "title": "Bartolomeo's Secret Connection to Luffy",
    "summary": "Bartolomeo's dramatic entrance and mysterious abilities suggest he has a deeper connection to Luffy than initially apparent. Some fans theorize he's a secret admirer or former beneficiary of Luffy's actions.",
    "fullText": "When Bartolomeo enters the Corrida Colosseum, his reputation as 'the man people most want to disappear' seems at odds with his later friendly interactions. Fans theorized that Bartolomeo might have witnessed Luffy's actions at Marineford or another major event, inspiring him to become a pirate. His participation in the Mera Mera no Mi tournament could be motivated by a desire to help Luffy rather than claim the fruit for himself. The theory gained traction when fans noticed Bartolomeo's reluctance to harm certain competitors and his interest in Luffy's movements throughout the tournament. His barrier ability also suggests he could serve as a powerful protector for someone he admires.",
    "author": "Fan Theory Enthusiasts",
    "source": {
      "url": "https://www.reddit.com/r/OnePiece/",
      "title": "Bartolomeo Theory Discussion",
      "platform": "Reddit",
      "accessedAt": "2026-01-15"
    },
    "postedDate": "2014-03-03",
    "episodeRange": [635, 645],
    "minEpisode": 635,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 645
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["bartolomeo", "luffy"],
    "relatedLocations": ["corrida-colosseum"],
    "relatedEvents": ["ep635-event-003"],
    "tags": ["bartolomeo", "luffy-fan", "identity-theory"]
  },
  {
    "id": "theory-ep635-004",
    "title": "Bellamy's Redemption Arc and Future Alliance",
    "summary": "Bellamy's changed attitude toward Luffy suggests he's on a redemption arc that could lead to him becoming an ally or even joining the Straw Hat Grand Fleet.",
    "fullText": "The stark contrast between Bellamy's behavior in Jaya and his respectful greeting to Luffy in Dressrosa sparked theories about his character trajectory. Fans noted that Bellamy's increase in bounty from 55 million to 195 million berries indicates significant growth in strength and experience. His acknowledgment that Sky Island was real represents a fundamental shift in his worldview - he now believes in dreams rather than mocking them. Theories suggest Bellamy could become a valuable ally to Luffy, possibly even joining the Straw Hat Grand Fleet. Some fans predicted he would face a moral dilemma between his loyalty to Doflamingo (who gave him a second chance) and his growing respect for Luffy's ideals. This internal conflict could drive a major character moment where Bellamy must choose which path to follow.",
    "author": "Character Analysis Community",
    "source": {
      "url": "https://www.reddit.com/r/OnePiece/",
      "title": "Bellamy Character Development Discussion",
      "platform": "Reddit",
      "accessedAt": "2026-01-15"
    },
    "postedDate": "2014-03-04",
    "episodeRange": [635, 660],
    "minEpisode": 635,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 660
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["bellamy", "luffy", "doflamingo"],
    "relatedLocations": ["corrida-colosseum", "dressrosa"],
    "relatedEvents": ["ep635-event-002"],
    "tags": ["bellamy", "redemption", "character-development", "alliance"]
  },
  {
    "id": "theory-ep635-005",
    "title": "Green Bit's Connection to Ancient History",
    "summary": "The warnings about Green Bit and its mysterious dangers suggest it holds secrets related to the Void Century or ancient weapons.",
    "fullText": "When Law insists on using Green Bit as the exchange location despite warnings that no one returns from the iron bridge, fans theorized the island must hold special significance. The presence of dangerous fighting fish seems insufficient to prevent all returns, suggesting something more sinister guards the island. Popular theories include: (1) Green Bit contains ruins or poneglyphs from the Void Century that the World Government wants hidden, (2) The island is home to an ancient weapon or its blueprints, (3) A powerful guardian or creature protects ancient secrets on the island, (4) The Tontatta dwarves' kingdom beneath Green Bit connects to broader One Piece lore about ancient civilizations. Law's knowledge of the island and insistence on meeting there despite the dangers suggests he knows something others don't, possibly related to his research into the 'D' clan or the Will of D.",
    "author": "Lore Theorists",
    "source": {
      "url": "https://www.reddit.com/r/OnePiece/",
      "title": "Green Bit Mysteries",
      "platform": "Reddit",
      "accessedAt": "2026-01-15"
    },
    "postedDate": "2014-03-05",
    "episodeRange": [635, 700],
    "minEpisode": 635,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 700
    },
    "popularity": {
      "upvotes": 0,
      "comments": 0,
      "shares": 0
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["law", "robin"],
    "relatedLocations": ["green-bit", "dressrosa"],
    "relatedEvents": ["ep635-event-006"],
    "tags": ["green-bit", "ancient-history", "void-century", "mystery"]
  }
]
