[
  {
    "id": "theory-ep644-001",
    "title": "Hajrudin and Usopp's Elbaf Connection",
    "summary": "Fan theory that Hajrudin's introduction in Dressrosa is foreshadowing for the Elbaf arc where he will help Usopp achieve his dream of becoming a brave warrior of the sea.",
    "fullText": "Fans have theorized that Hajrudin's debut in Episode 644 and his subsequent joining of the Straw Hat Grand Fleet is major foreshadowing for the Elbaf arc. The theory notes that every 'good giant from Elbaf has had a relationship with Usopp above anyone else,' starting with Dorry and Brogy in Little Garden. Hajrudin being saved by Usopp (as God Usopp) during Dressrosa creates another connection. The theory suggests that in the Elbaf arc, Hajrudin will play a key role in helping Usopp fulfill his dream of becoming a brave warrior of the sea, potentially earning him recognition as the 'Sniper King' among the giants. Some fans speculate that Sniper Island, which Usopp mentioned during Enies Lobby, might actually exist in Elbaf.",
    "author": "Multiple Reddit and forum users",
    "source": {
      "url": "https://gamerant.com/one-piece-hajrudin-on-elbaf/",
      "title": "One Piece: Hajrudin's Role on Elbaf, Explained",
      "platform": "GameRant",
      "accessedAt": "2026-01-29"
    },
    "postedDate": "2024-01-15",
    "episodeRange": [644, 1100],
    "minEpisode": 644,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 1100
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["hajrudin", "usopp", "luffy"],
    "relatedLocations": ["elbaf", "corrida-colosseum"],
    "relatedEvents": ["ep644-event-006", "ep644-event-008"],
    "tags": ["elbaf", "foreshadowing", "usopp-dream", "giants", "grand-fleet"]
  },
  {
    "id": "theory-ep644-002",
    "title": "Giolla's Art Fruit Awakening Theory",
    "summary": "Speculation about whether Giolla's ability to transform the entire Thousand Sunny indicates an awakened devil fruit or just advanced mastery of the Ato Ato no Mi.",
    "fullText": "Some fans have debated whether Giolla's ability to transform an entire ship like the Thousand Sunny in Episode 644 represents a Devil Fruit awakening. Standard Paramecia awakenings allow users to affect their environment beyond their own body, which seems to match Giolla's large-scale transformations. However, other fans argue that her fruit's basic ability always included transforming objects and people she touches, so transforming a ship doesn't necessarily indicate awakening. The theory suggests that if her fruit were truly awakened, she might be able to transform entire areas without direct contact, or maintain transformations permanently even while unconscious. The fact that all transformations revert when she's knocked out in Episode 648 suggests she may not have awakened the fruit, but rather has just mastered its standard applications.",
    "author": "One Piece theory community",
    "source": {
      "url": "https://wiki.sportskeeda.com/one-piece/ato-ato-no-mi-in-one-piece",
      "title": "Ato Ato no Mi Devil Fruit in One Piece",
      "platform": "Sportskeeda",
      "accessedAt": "2026-01-29"
    },
    "postedDate": "2020-06-15",
    "episodeRange": [644, 648],
    "minEpisode": 644,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 648
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "UNCONFIRMED",
    "relatedCharacters": ["giolla"],
    "relatedLocations": ["thousand-sunny"],
    "relatedEvents": ["ep644-event-002", "ep644-event-003"],
    "tags": ["devil-fruit", "awakening", "paramecia", "ato-ato-no-mi"]
  },
  {
    "id": "theory-ep644-003",
    "title": "Luffy's Pattern of Befriending Future Allies",
    "summary": "Theory that Luffy befriending Ucy the bull in Episode 644 follows his established pattern of making connections that later prove important to the story.",
    "fullText": "Fans have observed that Episode 644 continues Luffy's pattern of instantly befriending creatures and characters who later become important allies. Just as Luffy befriended Laboon, the Going Merry, and various animals throughout the series, his immediate bond with Ucy the Fighting Bull demonstrates his unique charisma. The theory notes that Luffy's rage when Ucy is hurt mirrors similar moments like when the Going Merry was damaged or when his crew members are threatened. Some fans theorize that this pattern of forming emotional bonds with 'unconventional' allies (animals, ships, objects) represents a foreshadowing of Luffy's ability to unite all races and species, which will be important for his role as Pirate King. The theory suggests that Luffy's protective instinct toward Ucy, leading to his decisive defeat of Hajrudin, shows that his greatest strength comes not from raw power but from his emotional connections.",
    "author": "One Piece character analysis community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_644",
      "title": "Episode 644 - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2026-01-29"
    },
    "postedDate": "2019-08-20",
    "episodeRange": [1, 644],
    "minEpisode": 1,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 644
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "THEMATIC_ANALYSIS",
    "relatedCharacters": ["luffy", "ucy", "hajrudin"],
    "relatedLocations": ["corrida-colosseum"],
    "relatedEvents": ["ep644-event-005", "ep644-event-008"],
    "tags": ["luffy-character", "friendship", "pattern-analysis", "pirate-king"]
  },
  {
    "id": "theory-ep644-004",
    "title": "Bellamy's Redemption Arc Foreshadowing",
    "summary": "Theory that Bellamy receiving conflicted orders to kill Luffy in Episode 644 sets up his eventual redemption and break from Doflamingo.",
    "fullText": "When Bellamy receives Diamante's note ordering him to assassinate Luffy in Episode 644, fans theorized this would lead to Bellamy's redemption arc. The theory points out that Bellamy's visible conflict about the order - remembering how Luffy had cheered for him during his match - foreshadows his eventual inability to follow through. Fans predicted that Bellamy's respect for Luffy, earned during their encounter in Jaya and reinforced at the Colosseum, would prove stronger than his loyalty to Doflamingo. The theory suggests that this moment in Episode 644 is the turning point where Bellamy begins to see Doflamingo's true manipulative nature. Some fans went further to predict that Bellamy would ultimately help Luffy against Doflamingo, representing a complete reversal from their first encounter. This theory was later confirmed in Episodes 702-703 when Bellamy struggles with the order and ultimately cannot bring himself to seriously harm Luffy.",
    "author": "r/OnePiece community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Bellamy",
      "title": "Bellamy - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2026-01-29"
    },
    "postedDate": "2014-05-12",
    "episodeRange": [146, 703],
    "minEpisode": 146,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 703
    },
    "popularity": {
      "upvotes": null,
      "comments": null,
      "shares": null
    },
    "status": "CONFIRMED",
    "relatedCharacters": ["bellamy", "luffy", "doflamingo", "diamante"],
    "relatedLocations": ["corrida-colosseum"],
    "relatedEvents": ["ep644-event-011"],
    "tags": ["redemption", "bellamy", "doflamingo", "character-development"]
  }
]
