[
  {
    "theoryTitle": "Shiryu Will Join the Blackbeard Pirates",
    "theoryText": "Based on the conversation between Blackbeard and Shiryu on Level 1, many fans theorized that Shiryu would betray Impel Down and join Blackbeard's crew. The mutual respect shown between these two ruthless characters, combined with Shiryu's history of excessive violence and imprisonment, suggested he would see Blackbeard as an opportunity for freedom and power rather than an enemy to fight.",
    "author": "One Piece Fan Community",
    "sourceUrl": "https://tvtropes.org/pmwiki/pmwiki.php/WMG/OnePieceConfirmed",
    "platform": "Various forums and discussion boards",
    "publishDate": "2010-04-04",
    "episodesReferenced": [445, 447, 448],
    "status": "CONFIRMED",
    "confirmationEpisode": 447,
    "spoilerLevel": "MAJOR",
    "popularity": "HIGH",
    "evidencePoints": [
      "Shiryu was released from prison for his excessive violence, showing he doesn't align with Impel Down's values",
      "The conversation between Blackbeard and Shiryu was friendly rather than hostile",
      "Shiryu showed interest in Blackbeard's purpose rather than immediately trying to stop him",
      "Blackbeard's ability to recruit powerful allies was already established with his existing crew"
    ],
    "tags": ["Shiryu", "Blackbeard Pirates", "Impel Down", "recruitment", "betrayal", "confirmed theory"]
  },
  {
    "theoryTitle": "Magellan's Decision to Release Shiryu Will Backfire",
    "theoryText": "Fans theorized that Magellan's decision to release the dangerous and unpredictable Shiryu from his cell to help stop the prison riot would ultimately backfire, as Shiryu's loyalty to Impel Down was questionable at best. Many predicted that Shiryu would either refuse to help, cause more chaos, or even betray the prison entirely by joining one of the invading forces.",
    "author": "One Piece Fan Community",
    "sourceUrl": "https://onepiece.fandom.com/wiki/Impel_Down_Arc",
    "platform": "Fan discussions and forums",
    "publishDate": "2010-04-04",
    "episodesReferenced": [444, 445, 447],
    "status": "CONFIRMED",
    "confirmationEpisode": 447,
    "spoilerLevel": "MAJOR",
    "popularity": "MEDIUM",
    "evidencePoints": [
      "Shiryu was imprisoned for excessive violence against prisoners, showing his disregard for rules",
      "Releasing a dangerous criminal to fight other criminals is inherently risky",
      "Shiryu's character design and demeanor suggested he was untrustworthy",
      "The narrative setup of Shiryu meeting Blackbeard immediately after being released suggested a connection"
    ],
    "tags": ["Magellan", "Shiryu", "Impel Down", "betrayal", "consequences", "confirmed theory"]
  },
  {
    "theoryTitle": "The Blackbeard-Shiryu Alliance Will Have World-Changing Consequences",
    "theoryText": "Fans theorized that if Shiryu joined Blackbeard, it would have massive implications for the balance of power in the One Piece world. Combining Blackbeard's Devil Fruit powers and ambition with Shiryu's swordsmanship and knowledge of Impel Down could lead to the recruitment of Level 6 prisoners and the formation of an incredibly dangerous pirate crew that would challenge the existing power structure.",
    "author": "One Piece Fan Community",
    "sourceUrl": "https://onepiece.fandom.com/wiki/Shiryu",
    "platform": "Online forums and wikis",
    "publishDate": "2010-04-04",
    "episodesReferenced": [445, 447, 448, 449],
    "status": "CONFIRMED",
    "confirmationEpisode": 449,
    "spoilerLevel": "CRITICAL",
    "popularity": "HIGH",
    "evidencePoints": [
      "Shiryu's intimate knowledge of Impel Down's layout and prisoners would be valuable to Blackbeard",
      "The timing of Blackbeard's arrival suggested he had a specific goal in the prison",
      "Level 6 prisoners are some of the most dangerous criminals in the world",
      "Blackbeard's pattern of recruiting powerful individuals for his crew was already established"
    ],
    "tags": ["Blackbeard", "Shiryu", "Level 6", "world balance", "power structure", "confirmed theory"]
  },
  {
    "theoryTitle": "Shiryu Will Become Blackbeard's Second-in-Command",
    "theoryText": "Given Shiryu's strength as the former Head Jailer (stated to be equal to Warden Magellan) and his eventual joining of the Blackbeard Pirates, fans theorized that Shiryu would become Blackbeard's right-hand man or second-in-command, similar to Zoro's role in the Straw Hat Pirates or Rayleigh's role with Roger.",
    "author": "One Piece Fan Community",
    "sourceUrl": "https://wiki.sportskeeda.com/one-piece/shiryu-in-one-piece",
    "platform": "Fan discussion forums",
    "publishDate": "2010-04-05",
    "episodesReferenced": [445],
    "status": "PARTIALLY_CONFIRMED",
    "confirmationEpisode": null,
    "spoilerLevel": "MAJOR",
    "popularity": "MEDIUM",
    "evidencePoints": [
      "Shiryu was stated to be equal in strength to Magellan, making him extremely powerful",
      "His swordsmanship would complement Blackbeard's Devil Fruit powers",
      "The parallel structure of rival crews in One Piece often features strong right-hand men",
      "Shiryu's serious demeanor contrasts with some of Blackbeard's more eccentric crew members"
    ],
    "tags": ["Shiryu", "Blackbeard Pirates", "crew structure", "power level", "speculation"]
  }
]
