[
  {
    "name": {
      "english": "Amazon Lily",
      "japanese": "アマゾン・リリー",
      "romanized": "Amazon Rirī"
    },
    "debutEpisode": 408,
    "debutChapter": 514,
    "episodeAppearances": [409],
    "locationType": "ISLAND",
    "region": "Calm Belt",
    "description": "An island empire in the Calm Belt populated entirely by the all-female Kuja tribe. Men are strictly forbidden from setting foot on the island. The island features a large mountain in its center with a village nestled in the valley below. It is naturally protected by Sea Kings in the Calm Belt.",
    "keyEvents": [
      {
        "episodeNumber": 409,
        "eventId": "ep409-event-001",
        "title": "Luffy Awakens in Prison",
        "description": "Luffy regains consciousness in a prison cell on Amazon Lily, marking his first conscious moments on the forbidden island.",
        "significance": "Establishes the conflict of a man being on an island where men are forbidden."
      },
      {
        "episodeNumber": 409,
        "eventId": "ep409-event-004",
        "title": "Luffy's Escape and Chase",
        "description": "Luffy escapes from prison by punching through the roof, causing chaos as he runs through the island pursued by Kuja warriors.",
        "significance": "The chase showcases the island's geography and the determination of its warriors to protect their customs."
      },
      {
        "episodeNumber": 409,
        "eventId": "ep409-event-006",
        "title": "Vivre Card Retrieved",
        "description": "Marguerite returns Luffy's Vivre Card to him somewhere on the island, providing him with the tool he needs to eventually reunite with his crew.",
        "significance": "Critical moment that enables future plot progression."
      }
    ],
    "residents": ["marguerite", "sweet-pea", "aphelandra", "kikyo"],
    "ruler": "Boa Hancock",
    "firstMentioned": 408,
    "status": "ACTIVE",
    "culturalSignificance": "Amazon Lily represents a unique all-female society in the One Piece world, ruled by the strongest warrior who becomes empress. The Kuja tribe believes that strength equals beauty and are known as formidable warriors who use Haki-imbued weapons.",
    "geography": "Located in the Calm Belt adjacent to Paradise. Features a large central mountain with a village in the valley below. Naturally protected by Sea Kings.",
    "controlledBy": "Kuja Tribe",
    "images": []
  }
]
