[
  {
    "name": {
      "english": "Hyōkaido",
      "japanese": "氷懐道",
      "romanized": "Hyōkaido"
    },
    "locationType": "REGION",
    "debutEpisode": 327,
    "debutChapter": null,
    "episodeAppearances": [331],
    "description": "A frigid region in Paradise characterized by icebergs and glaciers that formed over hundreds of years. The territory is controlled by the Accino Family who use it as their base of operations.",
    "geography": "Ice-covered waterways with moving icebergs pushed by Domo Penguins beneath the surface. The unpredictable iceberg movements create navigational hazards that trap vessels.",
    "climate": "Extremely cold with constant ice and snow. Contains Lovely Land, an anomalous tropical region maintained by Don Accino's heat powers.",
    "inhabitants": ["Accino Family", "Domo Penguins"],
    "keyEvents": [
      {
        "episodeNumber": 331,
        "eventId": "ep331-event-001",
        "title": "Salchow and Arbell Chase Usopp and Sanji",
        "description": "The ice-skating couple pursues the Straw Hats across the frozen terrain.",
        "significance": "Demonstrates how the Accino Family uses the icy environment to their advantage."
      },
      {
        "episodeNumber": 331,
        "eventId": "ep331-event-006",
        "title": "Twins Separate Luffy From His Crew",
        "description": "Campacino and Brindo use their magnetic powers to force Luffy onto the surrounding ice.",
        "significance": "Shows the tactical use of the frozen landscape in combat."
      }
    ],
    "culturalSignificance": "Territory of the bounty-hunting Accino Family who use it to trap and capture pirates.",
    "status": "ACTIVE"
  },
  {
    "name": {
      "english": "Lovely Land",
      "japanese": "ラブリーランド",
      "romanized": "Raburī Rando"
    },
    "locationType": "FORTRESS",
    "debutEpisode": 330,
    "debutChapter": null,
    "episodeAppearances": [331],
    "description": "A golden castle with Art Nouveau-inspired architecture that serves as the Accino Family's headquarters. Despite being located in frozen Hyōkaido, it maintains a tropical jungle environment due to Don Accino's Atsu Atsu no Mi powers.",
    "geography": "Golden castle structure with ornate decorative elements. Contains glacial caverns used for imprisoning captives and Don Accino's intensely heated chamber.",
    "climate": "Tropical and warm despite the surrounding frozen region, artificially maintained by Don Accino's heat-based Devil Fruit abilities.",
    "inhabitants": ["Don Accino", "Accino Family"],
    "keyEvents": [
      {
        "episodeNumber": 331,
        "eventId": "ep331-event-008",
        "title": "Zoro Enters Don Accino's Chamber",
        "description": "Zoro encounters Don Accino in an intensely hot chamber within Lovely Land.",
        "significance": "First major confrontation setting between a Straw Hat and the arc's primary antagonist."
      },
      {
        "episodeNumber": 331,
        "eventId": "ep331-event-009",
        "title": "Straw Hat Jolly Roger Presented to Don Accino",
        "description": "The stolen flag is delivered to Don Accino's chamber while Zoro is present.",
        "significance": "Reveals the central conflict of the arc within the villain's stronghold."
      }
    ],
    "culturalSignificance": "Houses Don Accino's collection of stolen pirate flags, representing his dominance over defeated crews.",
    "status": "ACTIVE"
  },
  {
    "name": {
      "english": "Phoenix Pirates' Ship",
      "japanese": "フェニックス海賊団の船",
      "romanized": "Fenikkusu Kaizokudan no Fune"
    },
    "locationType": "SHIP",
    "debutEpisode": 326,
    "debutChapter": null,
    "episodeAppearances": [331],
    "description": "The ship of the Phoenix Pirates, featuring a red phoenix figurehead. The vessel's sail and Jolly Roger were stolen by the Accino Family.",
    "geography": "Pirate ship trapped in the icy waters of Hyōkaido.",
    "climate": "Exposed to the freezing conditions of Hyōkaido.",
    "inhabitants": ["Phoenix Pirates"],
    "keyEvents": [
      {
        "episodeNumber": 331,
        "eventId": "ep331-event-003",
        "title": "Campacino Arrives to Rescue Brindo",
        "description": "Campacino arrives via magnetic ice platform to rescue his captured brother.",
        "significance": "Introduction of Campacino's magnetic abilities and the twins' bond."
      },
      {
        "episodeNumber": 331,
        "eventId": "ep331-event-004",
        "title": "Twins' Magnetic Combination Play Revealed",
        "description": "The magnetic twins demonstrate their unique brotherly powers on the ship.",
        "significance": "First display of the non-Devil Fruit magnetic abilities."
      },
      {
        "episodeNumber": 331,
        "eventId": "ep331-event-007",
        "title": "Puzzle Offers Himself as Ransom",
        "description": "Captain Puzzle offers to surrender himself for his crew's freedom.",
        "significance": "Demonstrates Puzzle's character development and protective nature."
      }
    ],
    "culturalSignificance": "Represents the Phoenix Pirates' journey and their reformation from traditional piracy.",
    "status": "ACTIVE"
  }
]
