[
  {
    "theoryTitle": "Revolutionary Army's Secret Impel Down Plan",
    "theoryText": "There is a theory that the Revolutionary Army had a much larger plan for Impel Down than simply hiding Ivankov there. The theory suggests that Ivankov and Inazuma stayed in Impel Down intentionally to free prisoners and build an army in secret. The World Government believed they had died, while in reality they were creating Level 5.5 (Newkama Land) and recruiting escaped prisoners. This army could have been used to start a massive riot and free all prisoners, severely weakening the World Government.",
    "author": "One Piece Community",
    "source": {
      "url": "https://www.opfanpage.com/the-ultimate-plan-of-monkey-d-dragon-the-secret-mission-of-bon-kurei/",
      "platform": "OPFanpage",
      "publishDate": null
    },
    "relatedEpisodes": [437, 438, 439, 440],
    "relatedCharacters": ["emporio-ivankov", "inazuma", "monkey-d-dragon", "bentham"],
    "relatedLocations": ["impel-down-level-5", "newkama-land"],
    "spoilerStatus": "Contains arc spoilers",
    "containsFutureSpoilers": true,
    "popularityMetrics": {
      "upvotes": null,
      "views": null,
      "discussionCount": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "notes": "The existence of Level 5.5 and Ivankov's intentional presence there is confirmed, though the full extent of the Revolutionary Army's plan remains speculative."
  },
  {
    "theoryTitle": "Morley Created Level 5.5, Not Ivankov",
    "theoryText": "While many fans initially believed Ivankov created Level 5.5 (Newkama Land), it was later revealed that Morley of the Revolutionary Army actually created the physical space over 100 years ago using his Otsu Otsu Fruit tunneling powers. Morley, now 160 years old, was an extremely evil pirate who was captured and used his Devil Fruit to dig out the hidden level between Level 5 and Level 6. Ivankov later found this space and turned it into Newkama Land, though Ivankov still doesn't know Morley created it.",
    "author": "Eiichiro Oda (Canon Reveal)",
    "source": {
      "url": "https://www.opfanpage.com/how-impel-down-level-5-5-newkama-land-was-made-2/",
      "platform": "OPFanpage",
      "publishDate": null
    },
    "relatedEpisodes": [437, 438],
    "relatedCharacters": ["emporio-ivankov", "morley"],
    "relatedLocations": ["impel-down-level-5", "newkama-land"],
    "spoilerStatus": "Contains future arc spoilers",
    "containsFutureSpoilers": true,
    "popularityMetrics": {
      "upvotes": null,
      "views": null,
      "discussionCount": null
    },
    "status": "CONFIRMED",
    "notes": "This was confirmed by Oda in later chapters of the manga, revealing Morley's role in creating the physical space that became Newkama Land."
  },
  {
    "theoryTitle": "Luffy's Unconscious Conqueror's Haki Foreshadows Advanced Control",
    "theoryText": "Luffy's ability to use Conqueror's Haki while unconscious and dying in Level 5 is theorized to be significant foreshadowing for his future mastery of the ability. The fact that his will to protect Bon Clay was so strong it manifested even when he was at death's door suggests that Conqueror's Haki is tied directly to one's willpower and determination, not conscious control. This episode demonstrates that Luffy's Haki responds to his emotions and protective instincts, which later becomes crucial when he learns to coat his attacks with Conqueror's Haki.",
    "author": "One Piece Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Haki/Supreme_King_Haki",
      "platform": "One Piece Wiki",
      "publishDate": null
    },
    "relatedEpisodes": [437, 413, 479, 570],
    "relatedCharacters": ["luffy"],
    "relatedLocations": ["impel-down-level-5"],
    "spoilerStatus": "Contains future spoilers",
    "containsFutureSpoilers": true,
    "popularityMetrics": {
      "upvotes": null,
      "views": null,
      "discussionCount": null
    },
    "status": "PARTIALLY_CONFIRMED",
    "notes": "The connection between emotions and Conqueror's Haki has been confirmed in later arcs. Luffy's ability to use it unconsciously was an early hint at the nature of this power."
  },
  {
    "theoryTitle": "The 'Demoning Away' Phenomenon",
    "theoryText": "Guards in Impel Down mention prisoners mysteriously 'demoning away' - disappearing without a trace. This is actually prisoners being rescued and taken to Level 5.5 (Newkama Land) by Ivankov and their followers. The theory suggests that Ivankov has been selectively rescuing prisoners who align with the Revolutionary Army's ideals or who could be rehabilitated, building a secret army right under the World Government's nose.",
    "author": "One Piece Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_437",
      "platform": "One Piece Wiki",
      "publishDate": null
    },
    "relatedEpisodes": [437, 438],
    "relatedCharacters": ["emporio-ivankov", "bentham"],
    "relatedLocations": ["impel-down", "newkama-land"],
    "spoilerStatus": "Episode specific, confirmed in next episode",
    "containsFutureSpoilers": false,
    "popularityMetrics": {
      "upvotes": null,
      "views": null,
      "discussionCount": null
    },
    "status": "CONFIRMED",
    "notes": "This theory is confirmed in Episode 438 when the true nature of Level 5.5 and the 'demoning away' phenomenon is revealed."
  }
]
