[
  {
    "id": "theory-ep462-001",
    "title": "Mihawk's True Intention: Testing His Own Strength",
    "summary": "When Mihawk stated he wanted to measure 'the distance' between himself and Whitebeard, he wasn't just testing Whitebeard's strength, but also trying to understand his own position in the world's power hierarchy after losing his only real rival (Shanks) 12 years ago.",
    "fullText": "Mihawk's isolation and absolute power make him almost clueless about his own strength, as he lacks any real rival. He lost his only real rival (Shanks) 12 years ago when Shanks lost his arm. The World's Strongest Swordsman, alone in his power, was testing to see where he stood next to the World's Strongest Man - above, below, or equal. Mihawk typically doesn't heed the World Government's call, but Marineford was the exception as it was the only permissible arena for Mihawk to fight any true elite. The phrase 'distance' is interpreted both literally (Whitebeard is standing right in front of them) and figuratively (is Whitebeard far, far away in terms of power - is he unreachable?).",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://www.opfanpage.com/the-distance-between-mihawk-and-edward-whitebeard/",
      "title": "The Distance between Mihawk and Whitebeard",
      "platform": "OP Fan Page",
      "accessedAt": "2025-12-13"
    },
    "postedDate": "",
    "episodeRange": [462, 463],
    "minEpisode": 462,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 463
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": ["mihawk", "whitebeard", "shanks"],
    "relatedLocations": ["marineford"],
    "relatedEvents": ["ep462-event-012", "ep462-event-013"],
    "tags": ["mihawk", "power-scaling", "character-motivation", "whitebeard"]
  },
  {
    "id": "theory-ep462-002",
    "title": "The Gura Gura no Mi's True World-Ending Potential",
    "summary": "The Gura Gura no Mi is stated to have the power to destroy the world, and the specific kanji used is identical to that used for Ancient Weapons, suggesting Whitebeard could literally end the world if he chose to unleash the fruit's full potential.",
    "fullText": "Fleet Admiral Sengoku proclaimed that Whitebeard held the power to destroy the world through the Gura Gura no Mi. The particular kanji used for the fruit's 'Power to Destroy the World' is the exact same as the kanji used for Ancient Weapons like Pluton, Poseidon, and Uranus, suggesting the threat is meant to be taken seriously on a similar level. People from the North Blue discussed the possibility of the world not remaining intact at the war's conclusion, suggesting that Whitebeard's powers could extend devastating effects to regions as distant as the North Blue. The theory suggests that if Whitebeard had no restraint and fully utilized the fruit's earthquake and tsunami generation abilities, he could trigger catastrophic natural disasters across the entire planet.",
    "author": "One Piece Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Gura_Gura_no_Mi",
      "title": "Gura Gura no Mi - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-13"
    },
    "postedDate": "",
    "episodeRange": [462, 485],
    "minEpisode": 462,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 485
    },
    "popularity": {},
    "status": "PARTIALLY_CONFIRMED",
    "relatedCharacters": ["whitebeard", "sengoku"],
    "relatedLocations": ["marineford"],
    "relatedEvents": ["ep462-event-001", "ep462-event-002"],
    "tags": ["devil-fruit", "gura-gura-no-mi", "world-destruction", "ancient-weapons", "power-scaling"]
  },
  {
    "id": "theory-ep462-003",
    "title": "Aokiji's Ice Age: Tactical Blunder or Strategic Brilliance?",
    "summary": "Fan debates question whether Aokiji freezing the bay was a strategic mistake that allowed pirates to charge directly at Marineford, or a calculated move to trap pirate ships and control the battlefield.",
    "fullText": "When Aokiji used Ice Age to freeze Whitebeard's tsunamis and the entire bay, it created a dual-edged tactical situation. On one hand, the frozen ocean trapped all pirate ships, preventing naval maneuvers and escape routes. On the other hand, it provided a solid foothold for pirates to charge directly at Marineford instead of having to approach by ship. Some fans theorize this was actually part of a larger Marine strategy: by creating a frozen battlefield, the Marines could better predict pirate movement patterns and force direct confrontation rather than naval warfare where Whitebeard's crew might have advantages. Others argue it was a tactical blunder born from necessity - Aokiji had to stop the tsunamis immediately and the freezing was a side effect. The fact that Aokiji later froze the sea again after Whitebeard's death specifically to prevent pirate escape suggests the Marines found the frozen terrain advantageous.",
    "author": "One Piece Fan Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_462",
      "title": "Episode 462 - One Piece Wiki",
      "platform": "Fandom",
      "accessedAt": "2025-12-13"
    },
    "postedDate": "",
    "episodeRange": [462, 485],
    "minEpisode": 462,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 485
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": ["aokiji", "whitebeard"],
    "relatedLocations": ["marineford"],
    "relatedEvents": ["ep462-event-003", "ep462-event-005"],
    "tags": ["strategy", "tactics", "ice-age", "marineford-war", "aokiji"]
  }
]
