[
  {
    "name": {
      "english": "Flower-Flower Fruit",
      "japanese": "ハナハナの実",
      "romanized": "Hana Hana no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 67,
    "debutChapter": 114,
    "episodeAppearances": [301],
    "currentUser": "robin",
    "previousUsers": [],
    "description": "A Paramecia-type Devil Fruit that allows the user to sprout duplicates of their body parts on any surface within range. The user can create limbs, eyes, ears, or even entire body duplicates for various purposes including combat, reconnaissance, and restraining enemies.",
    "abilities": [
      {
        "abilityName": "Seis Fleur: Slap",
        "episodeFirstUsed": 301,
        "description": "The user sprouts six arms (seis fleur means 'six flowers' in Spanish/French) that rapidly slap an opponent before delivering a powerful strike. This technique was first used by Robin to attack Spandam after being freed from her Seastone handcuffs.",
        "limitations": "Requires the user to not be restrained by Seastone, which nullifies Devil Fruit powers."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Seastone",
        "description": "Like all Devil Fruit users, the Hana Hana no Mi's powers are completely nullified when the user is in contact with Seastone. This was demonstrated when Robin was powerless while wearing Seastone handcuffs.",
        "episodeRevealed": 301
      }
    ],
    "userHistory": [
      {
        "userId": "robin",
        "episodeConsumed": null,
        "episodeLost": null,
        "keyMoments": [
          {
            "episodeNumber": 301,
            "momentType": "TECHNIQUE_DEBUT",
            "title": "Seis Fleur: Slap Debut",
            "description": "After being freed from Seastone handcuffs, Robin uses a new technique to attack Spandam, sprouting six arms to rapidly slap and strike him.",
            "timestamp": "18:45"
          }
        ]
      }
    ],
    "awakening": {
      "isAwakened": false,
      "episodeAwakened": null,
      "awakenedAbilities": []
    },
    "trivia": [
      {
        "fact": "Episode 301 showcases one of the rare moments where Robin uses her Devil Fruit powers in an aggressive, angry manner rather than just defensively or tactically.",
        "sources": []
      }
    ]
  }
]
