[
  {
    "id": "theory-ep647-001",
    "title": "Thunder Soldier is Actually Kyros the Legendary Gladiator",
    "summary": "Before the reveal, fans theorized that the Thunder Soldier was actually Kyros, the legendary undefeated gladiator from the Corrida Colosseum who vanished 20 years ago. The theory suggested he was turned into a toy by Sugar, which erased everyone's memories of him.",
    "fullText": "Fans speculated that Kyros, a legendary gladiator who fought at the Corrida Colosseum 20 years ago, had been turned into a toy called the Thunder Soldier of Rage. The key evidence was that no one in Dressrosa knew if Kyros actually existed despite his legendary status, suggesting everyone had forgotten him - which would only happen if he was turned into a toy. The Thunder Soldier's missing leg was also theorized to match Kyros losing his leg as a human. Since Kyros was an undefeated gladiator who vanished without explanation, and the Thunder Soldier showed exceptional combat skills and knowledge of Dressrosa's history, fans connected the dots before the official reveal.",
    "author": "One Piece Wiki Community",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/User_blog:Yountoryuu/Speculation:_Thunder_Soldier_of_Rage_=_Kyros",
      "title": "Speculation: Thunder Soldier of Rage = Kyros",
      "platform": "One Piece Wiki",
      "accessedAt": "2026-01-29"
    },
    "postedDate": "2013-09-15",
    "episodeRange": [629, 676],
    "minEpisode": 629,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 676
    },
    "popularity": {},
    "status": "CONFIRMED",
    "relatedCharacters": ["thunder-soldier", "kyros", "rebecca", "sugar"],
    "relatedLocations": ["dressrosa", "corrida-colosseum"],
    "relatedEvents": ["ep647-event-006", "ep647-event-005"],
    "tags": ["thunder-soldier", "kyros", "toys", "dressrosa", "identity-theory"]
  },
  {
    "id": "theory-ep647-002",
    "title": "The Hobi Hobi no Mi's Hobby-Based Transformation Theory",
    "summary": "A theory suggesting that when someone eats the Hobi Hobi no Mi, they can turn people into toys based on the user's personal hobby or favorite type of toy.",
    "fullText": "One fan theory suggests that the Hobi Hobi no Mi's transformation abilities are influenced by the user's personal hobbies or favorite toys. The theory notes that Sugar's age never changed when she ate the fruit, and speculates that she was very young when she consumed it and liked toys very much, which is why she specifically transforms people into toys rather than other objects. This theory attempts to explain why the fruit creates 'toys' specifically and not other forms of transformation, tying it to the 'Hobby-Hobby' name of the fruit.",
    "author": "One Piece Wiki Forum User",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Hobi_Hobi_no_Mi",
      "title": "Hobi Hobi no Mi - One Piece Wiki",
      "platform": "One Piece Wiki",
      "accessedAt": "2026-01-29"
    },
    "postedDate": "2014-08-20",
    "episodeRange": [647, 700],
    "minEpisode": 647,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 700
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": ["sugar"],
    "relatedLocations": ["dressrosa"],
    "relatedEvents": ["ep647-event-006"],
    "tags": ["devil-fruit", "hobi-hobi-no-mi", "sugar", "transformation"]
  },
  {
    "id": "theory-ep647-003",
    "title": "Haki Users Can Resist the Hobi Hobi no Mi",
    "summary": "A debated theory about whether powerful Haki users could resist Sugar's transformation ability, given the overpowered nature of the Hobi Hobi no Mi.",
    "fullText": "Given the extremely powerful and seemingly unbalanced nature of the Hobi Hobi no Mi, fans have debated whether strong Haki users could resist its transformation effects. The theory arose from discussions about the fruit being 'broken' or overpowered compared to other Devil Fruits in the series. Some fans argue that Haki should provide resistance to Devil Fruit abilities, while others counter that the manga/anime has not shown any evidence of Haki blocking the Hobi Hobi no Mi's effects. The debate intensified after the revelation in Episode 647 that anyone touched by Sugar, regardless of their power level, becomes a toy and is forgotten.",
    "author": "ResetEra Community",
    "source": {
      "url": "https://www.resetera.com/threads/sugars-devil-fruit-ability-probably-is-the-most-strongest-dangerous-in-one-piece-so-far.175946/",
      "title": "Sugar's Devil Fruit Ability, Probably is The most strongest/dangerous in One Piece So Far",
      "platform": "ResetEra",
      "accessedAt": "2026-01-29"
    },
    "postedDate": "2014-07-10",
    "episodeRange": [647, 750],
    "minEpisode": 647,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": 750
    },
    "popularity": {},
    "status": "DEBUNKED",
    "relatedCharacters": ["sugar"],
    "relatedLocations": ["dressrosa"],
    "relatedEvents": ["ep647-event-006"],
    "tags": ["haki", "devil-fruit", "hobi-hobi-no-mi", "power-scaling"]
  }
]
