[
  {
    "name": {
      "english": "Barrier-Barrier Fruit",
      "japanese": "バリバリの実",
      "romanized": "Bari Bari no Mi"
    },
    "type": "Paramecia",
    "debutEpisode": 637,
    "currentUser": "bartolomeo",
    "episodeAppearances": [637],
    "abilities": [
      {
        "abilityName": "Barrier",
        "description": "The user can create invisible, nearly indestructible barriers by crossing their fingers. These barriers can block and reflect attacks back at opponents.",
        "episodeFirstUsed": 637,
        "visualDescription": "An invisible wall that appears when Bartolomeo crosses his fingers, capable of stopping and reflecting powerful attacks."
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 637,
        "eventId": "ep637-event-006",
        "momentType": "POWER_REVEAL",
        "title": "Bari Bari no Mi Powers Revealed",
        "description": "Bartolomeo reveals his Devil Fruit ability for the first time in combat, creating a barrier that completely nullifies Hack's Fish-Man Karate attack and breaks his arm from the rebound force.",
        "significance": "First major demonstration of the Bari Bari no Mi's defensive capabilities, establishing it as one of the most powerful defensive Devil Fruits in the series. The barrier is shown to be nearly unbreakable and can reflect attack force back at attackers.",
        "timestamp": "16:20"
      }
    ],
    "reveals": [
      {
        "infoType": "ABILITY",
        "information": "The barrier can withstand and reflect Fish-Man Karate attacks, which are powerful enough to shatter 400 tiles",
        "episodeRevealed": 637,
        "severity": "CRITICAL"
      },
      {
        "infoType": "ABILITY",
        "information": "Attacking the barrier causes the force to rebound onto the attacker, potentially injuring them",
        "episodeRevealed": 637,
        "severity": "MAJOR"
      }
    ]
  },
  {
    "name": {
      "english": "Spring-Spring Fruit",
      "japanese": "バネバネの実",
      "romanized": "Bane Bane no Mi"
    },
    "type": "Paramecia",
    "debutEpisode": 146,
    "currentUser": "bellamy",
    "episodeAppearances": [637],
    "abilities": [
      {
        "abilityName": "Spring Hopper",
        "description": "The user can transform their body parts into springs, allowing for bouncing attacks and enhanced mobility.",
        "episodeFirstUsed": 146,
        "visualDescription": "Bellamy's legs become springs, allowing him to bounce around and build momentum for devastating attacks."
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 637,
        "eventId": "ep637-event-005",
        "momentType": "BATTLE_END",
        "title": "Bellamy's Brutal Spring-Powered Attack",
        "description": "Bellamy uses his Spring-Spring powers to flip over Abdullah and Jeet's heads while holding their jaws, twisting and snapping their backs in a brutal display of his Devil Fruit's offensive capabilities.",
        "significance": "Demonstrates an evolved and more ruthless application of Bellamy's Devil Fruit powers, showing how he's adapted his fighting style for the brutal New World combat.",
        "timestamp": "13:45"
      }
    ],
    "reveals": [
      {
        "infoType": "ABILITY",
        "information": "Bellamy can use his spring powers for brutal close-combat techniques, not just bouncing attacks",
        "episodeRevealed": 637,
        "severity": "MAJOR"
      }
    ]
  }
]
