[
  {
    "name": {
      "english": "Alubarna Palace",
      "japanese": "アルバーナ宮殿",
      "romanized": "Arubāna Kyūden"
    },
    "type": "Building",
    "episodeAppearances": [118],
    "keyEvents": [
      {
        "episodeNumber": 118,
        "eventId": "ep118-event-001",
        "eventType": "WORLD_LORE",
        "title": "Pluton Revelation",
        "description": "Crocodile reveals the existence of Pluton to King Cobra and Vivi at the palace.",
        "significance": "The palace becomes the site of a major world-building revelation about the Ancient Weapons.",
        "timestamp": "03:15"
      },
      {
        "episodeNumber": 118,
        "eventId": "ep118-event-014",
        "eventType": "WORLD_LORE",
        "title": "Journey to the Poneglyph",
        "description": "Crocodile forces Cobra to lead him from the palace to the location of the Poneglyph.",
        "significance": "The palace serves as the starting point for finding the Poneglyph containing information about Pluton.",
        "timestamp": "24:15"
      }
    ],
    "description": "The royal palace of Alubarna, the capital city of Arabasta. It serves as the residence of the Nefertari royal family and contains secret passages leading to ancient historical artifacts."
  },
  {
    "name": {
      "english": "Alubarna Palace Square",
      "japanese": "アルバーナ宮殿広場",
      "romanized": "Arubāna Kyūden Hiroba"
    },
    "type": "Location",
    "episodeAppearances": [118],
    "keyEvents": [
      {
        "episodeNumber": 118,
        "eventId": "ep118-event-002",
        "eventType": "MAJOR_DECISION",
        "title": "Bomb Plot Revealed",
        "description": "Crocodile reveals that he has planted a massive bomb in Palace Square set to detonate at 4:30 PM, threatening to kill both the rebel army and royal guard.",
        "significance": "The square becomes ground zero for Crocodile's contingency plan to ensure Arabasta's destruction.",
        "timestamp": "05:30"
      }
    ],
    "description": "The large public square in front of Alubarna Palace where the rebel army and royal guard are set to clash. Crocodile has planted a massive bomb here as part of his plan to destroy Arabasta."
  },
  {
    "name": {
      "english": "Alubarna",
      "japanese": "アルバーナ",
      "romanized": "Arubāna"
    },
    "type": "City",
    "episodeAppearances": [118],
    "keyEvents": [
      {
        "episodeNumber": 118,
        "eventId": "ep118-event-010",
        "eventType": "BATTLE_END",
        "title": "Nami vs Miss Doublefinger Conclusion",
        "description": "Nami defeats Miss Doublefinger in the streets of Alubarna using her Tornado Tempo attack.",
        "significance": "The city serves as the battleground for the Straw Hats' fights against Baroque Works agents.",
        "timestamp": "20:30"
      },
      {
        "episodeNumber": 118,
        "eventId": "ep118-event-011",
        "eventType": "BATTLE_START",
        "title": "Zoro vs Mr. 1 Begins",
        "description": "Zoro encounters and begins his battle with Mr. 1 in the streets of Alubarna.",
        "significance": "The capital city becomes the site of multiple simultaneous battles as the arc reaches its climax.",
        "timestamp": "21:45"
      }
    ],
    "description": "The capital city of Arabasta and the center of the conflict between the rebel army and the royal guard. The Straw Hat Pirates battle Baroque Works agents throughout the city to stop Crocodile's plot."
  }
]
