[
  {
    "id": "theory-001",
    "title": "Why Did Mihawk Really Follow Krieg? The Compromising Position Theory",
    "theory": "While Mihawk claims he followed Krieg's fleet all the way from the Grand Line to East Blue simply to 'kill time,' many fans find this explanation unconvincing. One popular theory, discussed on the One Piece Wiki forums and referenced by YouTubers, suggests that Don Krieg or his crew must have disturbed Mihawk in a much more significant way - possibly witnessing him in a vulnerable or embarrassing moment. The theory humorously speculates scenarios like Krieg's pirates accidentally seeing Mihawk urinating in the ocean or interrupting him during a private moment. This would explain why the world's greatest swordsman would pursue a weak East Blue fleet across vast distances - to protect his fearsome reputation. As Zeff speculates in the episode, they might have disturbed his nap, but it must have been something more hateful for him to be so persistently angry.",
    "author": "Various fans on One Piece Wiki Forum and YouTube",
    "source": {
      "url": "https://onepiece.fandom.com/f/p/4400000000003393695",
      "title": "True reason why Mihawk attacked Don Krieg",
      "platform": "One Piece Wiki Forum",
      "publishDate": "Unknown",
      "accessedAt": "2025-11-18"
    },
    "episodeRange": [23, 24],
    "spoilerLevel": "MINOR",
    "status": "UNRESOLVED",
    "popularity": "MODERATE",
    "tags": ["mihawk", "krieg", "motivation", "humor"],
    "relatedCharacters": ["mihawk", "don-krieg"],
    "relatedEvents": ["ep023-event-002", "ep023-event-007", "ep023-event-010"],
    "communityReception": "Most fans agree the official 'killing time' explanation seems underwhelming for such extreme behavior, leading to various creative theories about what really happened."
  },
  {
    "id": "theory-002",
    "title": "Mihawk Was Seeking a Worthy Challenge",
    "theory": "An alternative theory suggests that Mihawk, despite knowing Krieg was far below his power level, chased him looking for a challenge and a way to relieve his boredom. As the world's greatest swordsman with no equals, Mihawk experiences chronic boredom and follows any potential source of entertainment. Krieg's massive fleet of 50 ships might have initially seemed like it could provide some amusement, but after easily destroying it, Mihawk continued the pursuit hoping Krieg would lead him to something more interesting - which he did, as it led him to Zoro, who would provide the first genuinely respectful challenge Mihawk had encountered in a long time.",
    "author": "One Piece fan community",
    "source": {
      "url": "https://www.quora.com/Why-did-Mihawk-destroy-Don-Kriegs-fleet",
      "title": "Why did Mihawk destroy Don Krieg's fleet?",
      "platform": "Quora",
      "publishDate": "Unknown",
      "accessedAt": "2025-11-18"
    },
    "episodeRange": [23, 24],
    "spoilerLevel": "MINOR",
    "status": "PARTIALLY_CONFIRMED",
    "popularity": "MODERATE",
    "tags": ["mihawk", "zoro", "challenge", "boredom"],
    "relatedCharacters": ["mihawk", "zoro", "don-krieg"],
    "relatedEvents": ["ep023-event-007", "ep023-event-008"],
    "communityReception": "This theory gains some support from Mihawk's later interactions with Zoro, where he shows respect for warriors who challenge themselves beyond their limits."
  },
  {
    "id": "theory-003",
    "title": "Zeff's Nap Disturbance Theory",
    "theory": "Zeff speculates in the episode that Krieg and his fleet might have simply disturbed Mihawk's nap while sailing through the Grand Line. For someone of Mihawk's stature and personality - calm, composed, and preferring solitude - having a loud, boisterous fleet of 5,000 pirates interrupt his rest could be sufficient provocation. This theory is supported by Mihawk's character throughout the series: he lives alone on a remote island, travels alone on his coffin boat, and generally seeks peace and quiet. The theory suggests that Mihawk's seemingly casual 'killing time' explanation is actually a euphemism for 'teaching them a lesson for disturbing me,' which would be consistent with his character - devastating in action but understated in explanation.",
    "author": "Zeff (in-universe speculation), supported by fan analysis",
    "source": {
      "url": "https://onepiece.fandom.com/wiki/Episode_23",
      "title": "Episode 23 - One Piece Wiki",
      "platform": "Fandom",
      "publishDate": "Unknown",
      "accessedAt": "2025-11-18"
    },
    "episodeRange": [23],
    "spoilerLevel": "MINOR",
    "status": "CANON_SPECULATION",
    "popularity": "HIGH",
    "tags": ["mihawk", "personality", "motivation"],
    "relatedCharacters": ["mihawk", "don-krieg", "zeff"],
    "relatedEvents": ["ep023-event-010"],
    "communityReception": "Widely accepted as a plausible explanation given Mihawk's established personality traits and preference for solitude. Zeff's wisdom and experience lend credibility to this theory."
  }
]
