[
  {
    "name": {
      "english": "Mark-Mark Fruit",
      "japanese": "マトマトの実",
      "romanized": "Mato Mato no Mi"
    },
    "type": "Paramecia",
    "debutEpisode": 529,
    "debutChapter": 610,
    "episodeAppearances": [534],
    "currentUser": "vander-decken-ix",
    "previousUsers": [],
    "userHistory": [
      {
        "userId": "vander-decken-ix",
        "episodeConsumed": null,
        "episodeLost": null,
        "howObtained": "UNKNOWN",
        "howLost": null
      }
    ],
    "abilities": [
      {
        "abilityName": "Target Marking",
        "episodeFirstShown": 534,
        "description": "The user can mark a target by touching them with their bare hand. Any projectile thrown by that same hand will lock onto and chase the marked target until it hits them or is stopped by an obstacle.",
        "limitations": [
          "The user can only mark as many targets as they have hands (two for Vander Decken IX)",
          "The user must touch the target with their bare hand to mark them",
          "The projectile must be thrown by the same hand that marked the target",
          "The mark appears to be permanent until the user marks a new target with that hand"
        ]
      },
      {
        "abilityName": "Relentless Pursuit",
        "episodeFirstShown": 534,
        "description": "Projectiles thrown at marked targets will pursue them relentlessly through water and air, changing direction to follow the target's movements.",
        "limitations": [
          "Projectiles can be stopped by obstacles in their path",
          "The projectile doesn't have to be a weapon - it can be any object including living beings"
        ]
      }
    ],
    "keyMoments": [
      {
        "episodeNumber": 534,
        "eventId": "ep534-event-005",
        "title": "Combat Demonstration on Hachi",
        "description": "Vander Decken IX demonstrates the full power of the Mato Mato no Mi by marking Hachi and attacking him with a knife followed by a barrage of arrows that relentlessly pursue him.",
        "significance": "First clear demonstration of the fruit's combat effectiveness and how the targeting mechanism works in battle."
      }
    ],
    "awakening": {
      "isAwakened": false,
      "awakeningEpisode": null,
      "awakeningAbilities": []
    },
    "weaknesses": [
      "Standard Devil Fruit weakness to seawater and Sea-Prism Stone",
      "Projectiles can be blocked by obstacles or other people",
      "Limited to two simultaneous targets (for users with two hands)",
      "Requires direct hand-to-skin contact to mark targets"
    ],
    "reveals": [
      {
        "infoType": "ABILITY_DEMONSTRATION",
        "information": "The Mato Mato no Mi allows the user to mark targets and have projectiles pursue them relentlessly",
        "episodeRevealed": 534,
        "severity": "MAJOR"
      },
      {
        "infoType": "COMBAT_APPLICATION",
        "information": "The fruit can be used to attack fleeing targets with unavoidable projectiles",
        "episodeRevealed": 534,
        "severity": "MAJOR"
      }
    ]
  }
]
