[
  {
    "name": {
      "english": "Op-Op Fruit",
      "japanese": "オペオペの実",
      "romanized": "Ope Ope no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 398,
    "debutChapter": 504,
    "description": "Grants the user the ability to create a spherical 'ROOM' space where they can manipulate anything within it, including performing miraculous surgical operations. Known as the 'Ultimate Devil Fruit' with the potential to grant eternal life through the Perennial Youth Operation.",
    "episodeAppearances": [622],
    "users": [
      {
        "characterId": "trafalgar-law",
        "episodeStart": 398,
        "episodeEnd": "present",
        "circumstances": "Law ate the fruit as a child"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Medical Surgery - Mass Drug Extraction",
        "episodeRevealed": 622,
        "description": "Law uses his Ope Ope no Mi powers to surgically remove all NHC10 drugs and harmful chemicals from the bodies of multiple children simultaneously, demonstrating the fruit's advanced medical applications.",
        "severity": "MAJOR",
        "firstUseContext": "Law cures all of Caesar's experimental subjects by extracting the addictive drugs from their systems, showcasing his medical expertise combined with his Devil Fruit abilities."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 398,
        "severity": "MAJOR"
      },
      {
        "weakness": "Requires extensive medical knowledge to use effectively for healing",
        "episodeRevealed": 622,
        "severity": "MINOR"
      }
    ],
    "strengths": [
      {
        "strength": "Can cure any illness or remove harmful substances from bodies",
        "episodeRevealed": 622,
        "description": "Demonstrated by successfully curing all the children of their drug addiction and chemical contamination.",
        "severity": "MAJOR"
      },
      {
        "strength": "Precise surgical manipulation without traditional medical tools",
        "episodeRevealed": 622,
        "description": "Law can perform complex medical procedures by manipulating objects and matter within his ROOM.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "EXTREMELY_RARE",
    "powerTier": "VERY_HIGH"
  }
]
