[
  {
    "theoryTitle": "Thriller Bark is the Remnants of God Valley",
    "theoryText": "A Japanese One Piece fan (@manganouA on X) theorized that Thriller Bark may actually be the remnants of God Valley. The theory points out that some of Moria's General Zombies strongly resemble members of the Rocks Pirates, and both Thriller Bark and God Valley suspiciously originate from the West Blue. The theory suggests that God Valley was reduced to an uninhabitable warzone during the incident, and Moria later transformed it into his moving ship, which would explain how the island's existence was lost to history.",
    "author": "@manganouA",
    "platform": "X (Twitter)",
    "sourceUrl": "https://comicbook.com/anime/news/one-piece-god-valley-thriller-bark-theory/",
    "datePosted": "2024",
    "episodesSpanned": [337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381],
    "spoilerStatus": true,
    "spoilerEpisodes": [1096, 1097, 1098, 1099, 1100],
    "popularityMetrics": {
      "upvotes": null,
      "views": null,
      "shares": null
    },
    "credibilityRating": "SPECULATIVE",
    "evidenceProvided": [
      "Both Thriller Bark and God Valley originate from the West Blue",
      "Some of Moria's General Zombies resemble Rocks Pirates members",
      "God Valley disappeared from history after the incident",
      "Thriller Bark's massive size and mysterious origins"
    ],
    "communityReception": "MIXED",
    "canonStatus": "UNCONFIRMED"
  },
  {
    "theoryTitle": "Moria's Trauma and Connection to Rocks Pirates",
    "theoryText": "This theory suggests that Gecko Moria's obsession with creating a powerful zombie army stems from his devastating loss against Kaido, a former Rocks Pirate. The theory posits that Moria needed all those zombie warriors to make up for the loss of his beloved original crew, and creating this zombie army was a symbolic way for him to get back at the broader concept of the Rocks Pirates. Episode 371 demonstrates this through his use of Shadow Revolution and other advanced techniques, showing how far he's willing to go to create the ultimate fighting force.",
    "author": "CBR Analysis",
    "platform": "CBR",
    "sourceUrl": "https://www.cbr.com/one-piece-rocks-d-xebec-flashback-gecko-moria-thriller-bark-reframe/",
    "datePosted": "2024",
    "episodesSpanned": [343, 344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381],
    "spoilerStatus": true,
    "spoilerEpisodes": [483, 484],
    "popularityMetrics": {
      "upvotes": null,
      "views": null,
      "shares": null
    },
    "credibilityRating": "HIGHLY_PLAUSIBLE",
    "evidenceProvided": [
      "Moria lost his entire crew to Kaido in the New World",
      "Kaido was a member of the Rocks Pirates",
      "Moria's obsession with creating powerful zombies instead of recruiting living crew members",
      "His strategic use of Shadow Revolution to maximize zombie effectiveness"
    ],
    "communityReception": "POSITIVE",
    "canonStatus": "PARTIALLY_CONFIRMED"
  },
  {
    "theoryTitle": "Shadow Revolution's Full Potential Untapped",
    "theoryText": "Fans theorize that the Shadow Revolution technique revealed in Episode 371 represents only a fraction of what Moria could accomplish with his Kage Kage no Mi powers. The theory suggests that if Moria had properly trained and developed his abilities instead of relying on zombies to fight for him, he could have been one of the most powerful Devil Fruit users in the series. By manipulating shadows to force bodies into any shape, he could theoretically grant any physical property to any zombie - not just Luffy's stretching, but potentially flight, intangibility, or other physics-defying abilities. The theory posits that Moria's laziness and over-reliance on others fighting for him prevented him from achieving Awakening or discovering even more powerful applications of shadow manipulation.",
    "author": "One Piece Community",
    "platform": "Various Forums",
    "sourceUrl": "https://onepiece.fandom.com/wiki/Kage_Kage_no_Mi",
    "datePosted": "2008-2024",
    "episodesSpanned": [371, 372, 373, 374, 375, 376, 377, 378, 379, 380],
    "spoilerStatus": false,
    "spoilerEpisodes": [],
    "popularityMetrics": {
      "upvotes": null,
      "views": null,
      "shares": null
    },
    "credibilityRating": "PLAUSIBLE",
    "evidenceProvided": [
      "Shadow Revolution shows extreme versatility in body manipulation",
      "Moria relies entirely on zombies to fight instead of fighting himself",
      "Other Devil Fruit users who train achieve Awakening",
      "Moria was once strong enough to fight Kaido, suggesting untapped potential"
    ],
    "communityReception": "POSITIVE",
    "canonStatus": "UNCONFIRMED"
  },
  {
    "theoryTitle": "Why Didn't They Just Use Salt on Oars?",
    "theoryText": "A frequently discussed question in the community: why didn't the Straw Hats simply put salt in Oars' mouth to purify him like they did with other zombies? Episode 371 shows them discovering his frostbite weakness and attempting targeted attacks, but never trying the salt method that worked on smaller zombies. The most accepted explanation is that as an Ancient Giant Zombie, Oars would require a massive amount of salt to purify - far more than the crew had available during active combat. Additionally, getting close enough to Oars' mouth to deliver the salt while he was actively fighting and using Gomu Gomu no Gatling attacks would be nearly impossible. The theory suggests the crew made the tactical decision to target his weak points instead because it was more feasible given their resources and the combat situation.",
    "author": "Quora Community",
    "platform": "Quora",
    "sourceUrl": "https://www.quora.com/Why-in-One-Piece-Thriller-Bark-Arc-didn-t-they-just-put-salt-in-Oars-mouth-They-had-so-many-possibilities-but-they-decided-to-fight-with-that-monster",
    "datePosted": "2020",
    "episodesSpanned": [362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374],
    "spoilerStatus": false,
    "spoilerEpisodes": [],
    "popularityMetrics": {
      "upvotes": null,
      "views": null,
      "shares": null
    },
    "credibilityRating": "HIGHLY_PLAUSIBLE",
    "evidenceProvided": [
      "Oars is an Ancient Giant requiring proportionally more salt",
      "Active combat made approaching his mouth extremely dangerous",
      "The crew's salt supply was limited",
      "Chopper's discovery of the frostbite weakness provided an alternative strategy"
    ],
    "communityReception": "POSITIVE",
    "canonStatus": "LOGICAL_INFERENCE"
  }
]
