[
  {
    "name": {
      "english": "Wax-Wax Fruit",
      "japanese": "ドルドルの実",
      "romanized": "Doru Doru no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 70,
    "debutChapter": 117,
    "description": "Allows the user to create and manipulate large quantities of candle wax from their body. The wax can be molded into various shapes and becomes as hard as steel when solidified, but melts when exposed to fire or intense heat.",
    "episodeAppearances": [74],
    "users": [
      {
        "characterId": "mr-3",
        "episodeStart": 70,
        "episodeEnd": "present",
        "circumstances": "Already possessed by Mr. 3 when first introduced"
      }
    ],
    "abilityReveals": [
      {
        "abilityName": "Tokudai Candle Service Set",
        "episodeRevealed": 74,
        "description": "Creates a massive cake-shaped wax structure with rotating platform and burning candles that spray wax vapor over victims, slowly turning them into living wax statues.",
        "severity": "MAJOR",
        "firstUseContext": "Mr. 3 uses this elaborate torture device to trap Zoro, Nami, Vivi, and Brogy, intending to turn them into wax statues as morbid works of art."
      },
      {
        "abilityName": "Candle Lock",
        "episodeRevealed": 74,
        "description": "Creates large candle-shaped wax restraints to immobilize opponents. The hardened wax is strong enough to completely restrain even giants.",
        "severity": "MAJOR",
        "firstUseContext": "Mr. 3 uses massive wax shackles to completely immobilize Brogy, preventing the giant warrior from breaking free despite his enormous strength."
      },
      {
        "abilityName": "Doru Doru Arts: Tejo",
        "episodeRevealed": 74,
        "description": "An anime-exclusive wax technique used as part of Mr. 3's torture setup.",
        "severity": "MINOR",
        "firstUseContext": "Mr. 3 uses this technique while preparing his Tokudai Candle Service Set."
      }
    ],
    "weaknesses": [
      {
        "weakness": "Wax melts when exposed to fire or intense heat",
        "episodeRevealed": 70,
        "severity": "MAJOR"
      },
      {
        "weakness": "Standard Devil Fruit weakness - inability to swim",
        "episodeRevealed": 70,
        "severity": "MAJOR"
      }
    ],
    "strengths": [
      {
        "strength": "Hardened wax is as strong as steel",
        "episodeRevealed": 74,
        "description": "The solidified wax can restrain even giants and withstand most blunt attacks.",
        "severity": "MAJOR"
      },
      {
        "strength": "Highly versatile for creating structures and restraints",
        "episodeRevealed": 74,
        "description": "The user can create elaborate structures like the Tokudai Candle Service Set, showing great creative potential.",
        "severity": "MAJOR"
      }
    ],
    "awakening": null,
    "rarity": "COMMON",
    "powerTier": "MEDIUM"
  }
]
