[
  {
    "id": "theory-ep074-001",
    "title": "Zoro's Ankle Scars as Foreshadowing of Ultimate Sacrifice",
    "summary": "The scene where Zoro attempts to cut off his legs is theorized to foreshadow his eventual willingness to sacrifice his life for his crew and Luffy's dream, with some fans believing he will die by the series' end.",
    "fullText": "Fans have theorized that Zoro's extreme willingness to cut off his own legs in Episode 74 rather than die helplessly is not just a character moment, but foreshadowing of his ultimate fate. The scene demonstrates that Zoro values being able to fight and protect his crew above all else, even his own body and life. Some theorists, like Reddit user MadCatMed, believe this is one of many moments showing Zoro's eventual sacrifice for Luffy's dream of becoming Pirate King. The ankle scars that remain from this near-mutilation serve as a permanent reminder of this dedication.",
    "author": "Various Reddit users including MadCatMed",
    "source": {
      "url": "https://gamerant.com/one-piece-zoro-dies-theory-explained/",
      "title": "One Piece: Zoro Dies Theory, Explained",
      "platform": "GameRant",
      "accessedAt": "2025-11-18"
    },
    "postedDate": null,
    "episodeRange": [74, null],
    "minEpisode": 74,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": true,
      "maxEpisodeSpoiler": null
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": ["zoro", "luffy"],
    "relatedLocations": ["little-garden"],
    "relatedEvents": ["ep074-event-005"],
    "tags": ["zoro", "sacrifice", "foreshadowing", "character-death-theory"]
  },
  {
    "id": "theory-ep074-002",
    "title": "Mr. 3's Artistic Vision Reflects Baroque Works' Philosophy",
    "summary": "Mr. 3's desire to turn victims into wax statues as 'art' symbolizes Baroque Works' broader philosophy of controlling and preserving the status quo in Alabasta.",
    "fullText": "Some fans have theorized that Mr. 3's twisted artistic vision of creating living wax statues is a microcosm of Baroque Works' larger plan for Alabasta. Just as Mr. 3 wants to freeze his victims in wax, preserving their fear forever as static art, Crocodile and Baroque Works seek to freeze Alabasta in a state of controlled chaos, turning a living kingdom into a static puppet state. The wax represents stagnation and death masquerading as preservation, similar to how Baroque Works' revolution would replace genuine freedom with controlled tyranny.",
    "author": "Unknown fan theorist",
    "source": {
      "url": "https://tvtropes.org/pmwiki/pmwiki.php/Recap/OnePieceLittleGardenArc",
      "title": "One Piece – Little Garden Arc Recap - TV Tropes",
      "platform": "TV Tropes",
      "accessedAt": "2025-11-18"
    },
    "postedDate": null,
    "episodeRange": [70, 130],
    "minEpisode": 70,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": true,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 130
    },
    "popularity": {},
    "status": "UNCONFIRMED",
    "relatedCharacters": ["mr-3", "crocodile"],
    "relatedLocations": ["little-garden", "alabasta"],
    "relatedEvents": ["ep074-event-001"],
    "tags": ["baroque-works", "symbolism", "thematic-analysis"]
  },
  {
    "id": "theory-ep074-003",
    "title": "Oda's Inconsistency with Zoro's Ankle Scars",
    "summary": "Fans have noted that Oda often forgets to draw Zoro's ankle scars from the Little Garden incident, leading to discussions about whether this is intentional or an oversight.",
    "fullText": "One Piece fans have observed that while Zoro should have permanent ankle scars from attempting to cut off his legs in the Little Garden arc, Oda frequently forgets to draw them in later episodes and chapters. This has led to fan discussions about whether this is simply an artistic oversight (similar to other documented cases where Oda forgets details) or whether it has narrative significance. Some fans theorize that Zoro's accelerated healing or willpower somehow allowed the scars to fade, while others believe it's just one of many details Oda doesn't consistently track across 1000+ episodes.",
    "author": "CBR and various One Piece Wiki contributors",
    "source": {
      "url": "https://www.cbr.com/one-piece-things-oda-forgot-drive-fans-crazy/",
      "title": "One Piece: 10 Things Oda Forgot That Drive Fans Crazy",
      "platform": "CBR",
      "accessedAt": "2025-11-18"
    },
    "postedDate": null,
    "episodeRange": [74, null],
    "minEpisode": 74,
    "spoilerStatus": {
      "containsAnimeOnlySpoilers": false,
      "containsMangaSpoilers": false,
      "maxEpisodeSpoiler": 74
    },
    "popularity": {},
    "status": "CONFIRMED_INCONSISTENCY",
    "relatedCharacters": ["zoro"],
    "relatedLocations": [],
    "relatedEvents": ["ep074-event-005"],
    "tags": ["animation-inconsistency", "character-design", "oda", "continuity"]
  }
]
