[
  {
    "name": {
      "english": "Scrap Island",
      "japanese": "スクラップ島",
      "romanized": "Sukurappu-jima"
    },
    "debutEpisode": 234,
    "debutChapter": 331,
    "episodeAppearances": [236],
    "locationType": "ISLAND",
    "parentLocation": "Water 7",
    "keyMoments": [
      {
        "episodeNumber": 236,
        "eventId": "ep236-event-002",
        "title": "Site of the Luffy vs. Usopp Duel",
        "description": "Scrap Island serves as the battleground for the fateful duel between Luffy and Usopp over the ownership of the Going Merry.",
        "significance": "Becomes the location of one of the most emotionally significant events in One Piece history.",
        "timestamp": "05:15"
      }
    ],
    "description": "An island within Water 7 filled with discarded ship parts and scrap materials. It becomes the agreed-upon location for Luffy and Usopp's duel."
  },
  {
    "name": {
      "english": "Going Merry",
      "japanese": "ゴーイング・メリー号",
      "romanized": "Gōingu Merī-gō"
    },
    "debutEpisode": 17,
    "debutChapter": 41,
    "episodeAppearances": [236],
    "locationType": "SHIP",
    "keyMoments": [
      {
        "episodeNumber": 236,
        "eventId": "ep236-event-012",
        "title": "Awarded to Usopp After the Duel",
        "description": "After defeating Usopp, Luffy tells him he can keep the Going Merry as they will get a new ship.",
        "significance": "The ship that brought the crew together becomes a symbol of their separation.",
        "timestamp": "20:15"
      },
      {
        "episodeNumber": 236,
        "eventId": "ep236-event-015",
        "title": "The Crew's Final Departure from the Going Merry",
        "description": "The Straw Hat Pirates gather their belongings and leave the Going Merry forever, with most of the crew crying.",
        "significance": "Marks the emotional end of the crew's time with their first beloved ship.",
        "timestamp": "22:00"
      },
      {
        "episodeNumber": 236,
        "eventId": "ep236-event-017",
        "title": "The Going Merry Appears to Cry",
        "description": "Water runs down the Going Merry's hull, giving the impression that the ship itself is crying at being abandoned.",
        "significance": "Foreshadows the revelation of the ship's klabautermann (ship spirit).",
        "timestamp": "23:30"
      }
    ],
    "description": "The Straw Hat Pirates' first ship, a caravel gifted to them by Kaya. After being deemed beyond repair, it becomes the subject of the conflict between Luffy and Usopp."
  }
]
