[
  {
    "abilityName": "Brochette",
    "abilityType": "MARTIAL_ARTS",
    "category": "BLACK_LEG_STYLE",
    "debutEpisode": 253,
    "debutChapter": 362,
    "user": "sanji",
    "description": "Sanji jumps over his opponent and drops downward while spinning like a drill, striking with his extended leg aimed directly at the target. The spinning motion and downward force creates devastating impact.",
    "episodeAppearances": [253],
    "keyMoments": [
      {
        "episodeNumber": 253,
        "eventId": "ep253-event-009",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "Sanji Defeats Jerry with Brochette",
        "description": "Sanji uses Brochette for the first time, effortlessly defeating CP6 agent Jerry in a single strike.",
        "significance": "Demonstrates the technique's power and Sanji's combat superiority over government agents.",
        "timestamp": "18:45",
        "opponent": "jerry",
        "outcome": "Victory"
      }
    ],
    "namingOrigin": "French for 'skewer,' fitting Sanji's cooking-themed attack naming convention",
    "relatedAbilities": ["collier-shoot", "anti-manner-kick-course", "flambage-shot"],
    "powerLevel": "INTERMEDIATE",
    "visualDescription": "Sanji performs an aerial spinning motion resembling a drill or skewer, with his leg extended to maximize impact upon landing on the opponent.",
    "soundEffect": "Whoosh and impact sound",
    "weaknesses": "Requires aerial positioning and space to execute properly",
    "trivia": "The technique's name and motion parallel the cooking action of skewering meat on a brochette."
  },
  {
    "abilityName": "Jerry Aurora Flicker Jab",
    "abilityType": "MARTIAL_ARTS",
    "category": "BOXING",
    "debutEpisode": 253,
    "debutChapter": 362,
    "user": "jerry",
    "description": "Rapid-fire boxing punches delivered at extreme speed, creating the visual illusion that Jerry has multiple arms attacking simultaneously. The technique is named after the aurora borealis phenomenon, suggesting the multi-armed visual effect.",
    "episodeAppearances": [253],
    "keyMoments": [
      {
        "episodeNumber": 253,
        "eventId": "ep253-event-008",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "Jerry Unleashes Aurora Flicker Jab Against Sanji",
        "description": "Jerry demonstrates his signature rapid-punch technique against Sanji, though it proves ineffective against the Straw Hat cook.",
        "significance": "Shows Jerry's fighting capabilities and boxing expertise, drawing parallels to Luffy's Gomu Gomu no Gatling.",
        "timestamp": "17:10",
        "opponent": "sanji",
        "outcome": "Ineffective"
      }
    ],
    "namingOrigin": "Named after the aurora (northern lights) due to the multiple-armed visual effect, combined with 'flicker jab,' a boxing term for rapid straight punches",
    "relatedAbilities": ["gomu-gomu-no-gatling"],
    "powerLevel": "INTERMEDIATE",
    "visualDescription": "Extremely rapid straight punches that create afterimages, making it appear as though Jerry has numerous arms all punching simultaneously.",
    "soundEffect": "Multiple rapid impact sounds",
    "weaknesses": "Ineffective against opponents with superior speed or defensive capabilities",
    "trivia": "The technique's visual similarity to Luffy's Gatling Gun was intentional, showcasing how different fighting styles can produce similar attack patterns."
  },
  {
    "abilityName": "Yoga One Two",
    "abilityType": "MARTIAL_ARTS",
    "category": "BOXING_YOGA_HYBRID",
    "debutEpisode": 253,
    "debutChapter": 362,
    "user": "jerry",
    "description": "Boxing combination punches (one-two combo) delivered while Jerry is in a compressed yoga position with his legs positioned behind his head. This unique adaptation allows him to fight effectively in confined spaces despite his extreme height.",
    "episodeAppearances": [253],
    "keyMoments": [
      {
        "episodeNumber": 253,
        "eventId": "ep253-event-007",
        "momentType": "TECHNIQUE_DEBUT",
        "title": "Jerry Demonstrates Yoga Fighting Adaptation",
        "description": "Jerry reveals his yoga-based fighting stance, showcasing his ability to compress his 22-foot-tall frame for combat in the confined train car.",
        "significance": "Demonstrates creative combat adaptation and Jerry's training for various scenarios.",
        "timestamp": "16:00",
        "opponent": "sanji",
        "outcome": "Ineffective"
      }
    ],
    "namingOrigin": "Combines 'Yoga' (the flexibility practice) with 'One Two' (a basic boxing combination)",
    "relatedAbilities": ["screw-drop-kick"],
    "powerLevel": "BASIC",
    "visualDescription": "Jerry contorts his extremely tall body using yoga positioning, placing his legs behind his head while throwing traditional boxing punches.",
    "soundEffect": "Standard punch impact sounds",
    "weaknesses": "Compromised mobility and balance while in yoga position",
    "trivia": "Jerry's yoga training was specifically for fighting in confined spaces, showing the specialized preparation of World Government agents."
  },
  {
    "abilityName": "Screw Drop Kick",
    "abilityType": "MARTIAL_ARTS",
    "category": "KICKING_TECHNIQUE",
    "debutEpisode": 253,
    "debutChapter": 362,
    "user": "jerry",
    "description": "A spinning kick attack where Jerry rotates his body like a screw while delivering a drop kick to his opponent.",
    "episodeAppearances": [253],
    "keyMoments": [],
    "namingOrigin": "Named for the screwing/spinning motion combined with a drop kick",
    "relatedAbilities": ["yoga-one-two"],
    "powerLevel": "BASIC",
    "visualDescription": "A rotating aerial kick attack with spinning momentum.",
    "soundEffect": "Whoosh and impact",
    "weaknesses": "Unknown - technique mentioned but not shown in detail during the episode",
    "trivia": "This technique was mentioned as part of Jerry's repertoire but not prominently featured in his brief battle with Sanji."
  }
]
