[
  {
    "id": "alubarna-clock-tower",
    "names": {
      "english": "Alubarna Clock Tower",
      "japanese": "アルバーナの時計塔",
      "romanized": "Arubāna no Tokeitō",
      "aliases": ["The Clock Tower"]
    },
    "type": "BUILDING",
    "debut": {
      "episode": 125,
      "chapter": 207
    },
    "episodeAppearances": [125],
    "parentLocation": "alubarna",
    "keyEvents": [
      {
        "episodeNumber": 125,
        "timestamp": "04:30",
        "description": "Vivi discovers the bomb inside the clock tower, guarded by Mr. 7 and Miss Father's Day",
        "significance": "The location where Crocodile's bomb was hidden to destroy Alubarna",
        "spoilerLevel": "MAJOR"
      },
      {
        "episodeNumber": 125,
        "timestamp": "09:45",
        "description": "Vivi defeats Mr. 7 and Miss Father's Day at the clock tower but cannot disable the bomb",
        "significance": "Sets up the desperate situation requiring Pell's sacrifice",
        "spoilerLevel": "MAJOR"
      },
      {
        "episodeNumber": 125,
        "timestamp": "13:20",
        "description": "Pell arrives at the clock tower, grabs the bomb, and flies it into the sky",
        "significance": "The starting point of Pell's heroic sacrifice to save Arabasta",
        "spoilerLevel": "CRITICAL"
      }
    ],
    "description": "A tall clock tower in the center of Alubarna where Crocodile hid his bomb with a 5-kilometer blast radius. The tower served as the hiding place for the explosive device meant to destroy the capital during the climax of the civil war.",
    "culturalSignificance": "Central landmark of Alubarna and the site of one of the most dramatic moments in the Arabasta Arc.",
    "images": []
  },
  {
    "id": "alubarna",
    "names": {
      "english": "Alubarna",
      "japanese": "アルバーナ",
      "romanized": "Arubāna",
      "aliases": ["Capital of Arabasta"]
    },
    "type": "CITY",
    "debut": {
      "episode": 110,
      "chapter": 172
    },
    "episodeAppearances": [125],
    "parentLocation": "arabasta",
    "keyEvents": [
      {
        "episodeNumber": 125,
        "timestamp": "07:15",
        "description": "Zoro takes a hit from Mr. 7 and Miss Father's Day to protect Vivi and Chopper as they race to the clock tower",
        "significance": "Shows the desperate battle happening throughout Alubarna to stop the bomb",
        "spoilerLevel": "MAJOR"
      },
      {
        "episodeNumber": 125,
        "timestamp": "14:00",
        "description": "The bomb explodes high in the sky above Alubarna, saving the city and its inhabitants",
        "significance": "The entire city is saved from destruction thanks to Pell's sacrifice",
        "spoilerLevel": "CRITICAL"
      },
      {
        "episodeNumber": 125,
        "timestamp": "17:30",
        "description": "Tashigi and Marines fight Baroque Works agents throughout Alubarna",
        "significance": "Shows the ongoing conflict between Marines and Baroque Works in the capital",
        "spoilerLevel": "MAJOR"
      }
    ],
    "description": "The capital city of the Arabasta Kingdom where the climactic battles of the arc take place. The city was threatened by a massive bomb planted by Baroque Works that would have destroyed everything within a 5-kilometer radius.",
    "culturalSignificance": "The political and cultural center of Arabasta, home to the royal palace and where the fate of the kingdom was decided.",
    "images": []
  },
  {
    "id": "alubarna-palace",
    "names": {
      "english": "Alubarna Palace",
      "japanese": "アルバーナ宮殿",
      "romanized": "Arubāna Kyūden",
      "aliases": ["Royal Palace", "Arabasta Palace"]
    },
    "type": "PALACE",
    "debut": {
      "episode": 110,
      "chapter": 172
    },
    "episodeAppearances": [125],
    "parentLocation": "alubarna",
    "keyEvents": [
      {
        "episodeNumber": 125,
        "timestamp": "19:00",
        "description": "Luffy continues his battle with Crocodile inside the palace, getting poisoned by Crocodile's hook",
        "significance": "The site of the final confrontation between Luffy and Crocodile",
        "spoilerLevel": "CRITICAL"
      }
    ],
    "description": "The royal palace of Arabasta located in Alubarna where Luffy confronts Crocodile in their climactic battle. The palace serves as the backdrop for the final showdown between the protagonist and the arc's main antagonist.",
    "culturalSignificance": "Seat of power for the Nefertari royal family and the location where Crocodile's plans are ultimately thwarted.",
    "images": []
  }
]
