[
  {
    "name": {
      "english": "Clone-Clone Fruit",
      "japanese": "マネマネの実",
      "romanized": "Mane Mane no Mi"
    },
    "type": "PARAMECIA",
    "debutEpisode": 92,
    "debutChapter": 156,
    "episodeAppearances": [92],
    "currentUser": "mr-2-bon-kurei",
    "formerUsers": [],
    "abilities": [
      {
        "abilityName": "Perfect Physical Transformation",
        "description": "Allows the user to transform into a perfect physical copy of anyone whose face they have touched with their right hand. The transformation includes appearance, voice, and body structure.",
        "episodeFirstShown": 92,
        "limitations": [
          "Must touch the target's face with right hand to copy them",
          "Must touch own face with left hand to return to normal",
          "Cannot copy Devil Fruit abilities",
          "Cannot copy the target's memories or mannerisms automatically"
        ]
      },
      {
        "abilityName": "Face Memory Storage",
        "description": "The user can store multiple faces in memory and transform into any of them at will, even if the original person is not present.",
        "episodeFirstShown": 92,
        "limitations": [
          "Must have previously touched the person's face to copy them"
        ]
      }
    ],
    "awakening": {
      "isAwakened": false,
      "awakeningEpisode": null,
      "awakeningAbilities": []
    },
    "weaknesses": [
      {
        "weakness": "Standard Devil Fruit weaknesses (sea water, Seastone)",
        "episodeRevealed": 92
      },
      {
        "weakness": "Transformation is purely physical - does not copy abilities, memories, or fighting skills",
        "episodeRevealed": 92
      }
    ],
    "userHistory": [
      {
        "userId": "mr-2-bon-kurei",
        "episodeObtained": null,
        "episodeLost": null,
        "methodObtained": "Unknown",
        "methodLost": null
      }
    ],
    "significance": "The Mane Mane no Mi is one of the most versatile Devil Fruits for espionage and infiltration. Its ability to perfectly copy appearances makes it invaluable for Baroque Works' operations and creates significant plot complications throughout the Arabasta Arc.",
    "trivia": [
      "This is one of the few Devil Fruits that can directly copy another person's appearance without any technological assistance.",
      "The fruit's power is so perfect that even close friends and family cannot distinguish the copy from the original by appearance alone.",
      "Mr. 2's demonstration shows he has copied multiple people's faces, including King Cobra of Arabasta, suggesting extensive infiltration operations."
    ]
  },
  {
    "name": {
      "english": "Sand-Sand Fruit",
      "japanese": "スナスナの実",
      "romanized": "Suna Suna no Mi"
    },
    "type": "LOGIA",
    "debutEpisode": 77,
    "debutChapter": null,
    "episodeAppearances": [92],
    "currentUser": "crocodile",
    "formerUsers": [],
    "abilities": [
      {
        "abilityName": "Sand Twister Creation",
        "description": "Can create powerful twisters made of sand that can dehydrate and kill multiple opponents simultaneously.",
        "episodeFirstShown": 92,
        "limitations": []
      },
      {
        "abilityName": "Dehydration Attack",
        "description": "Can drain the moisture from living beings through sand contact, causing rapid dehydration and death.",
        "episodeFirstShown": 92,
        "limitations": []
      },
      {
        "abilityName": "Logia Intangibility",
        "description": "Can transform body into sand, allowing physical attacks to pass through harmlessly.",
        "episodeFirstShown": 92,
        "limitations": []
      }
    ],
    "awakening": {
      "isAwakened": false,
      "awakeningEpisode": null,
      "awakeningAbilities": []
    },
    "weaknesses": [
      {
        "weakness": "Water negates the Logia intangibility and makes the sand solidify",
        "episodeRevealed": 92
      }
    ],
    "userHistory": [
      {
        "userId": "crocodile",
        "episodeObtained": null,
        "episodeLost": null,
        "methodObtained": "Unknown",
        "methodLost": null
      }
    ],
    "significance": "In this episode, Crocodile's devastating use of the Suna Suna no Mi against Puppu and his crew demonstrates why he is one of the Seven Warlords of the Sea. The instant dehydration attack showcases the fruit's lethal potential.",
    "trivia": []
  }
]
