[
  {
    "id": "theory-ep511-001",
    "title": "The 16 Bells Point to Sabaody Grove 16",
    "theoryText": "Some fans theorized that the number 16 in Luffy's bell ringing wasn't just symbolic but also indicated a specific meeting location - Sabaody Archipelago Grove 16. This theory suggested the bells served a dual purpose: the traditional era-ending symbolism and a coded location marker for the Straw Hats' reunion point.",
    "author": "One Piece Fan Community (2010)",
    "source": "Various forum discussions from August 2010",
    "dateProposed": "2010-08-02",
    "episodesSpanned": [511, 517],
    "spoilerStatus": {
      "containsSpoilers": true,
      "maxEpisodeSpoiler": 517,
      "spoilerLevel": "MINOR"
    },
    "theoryStatus": "PARTIALLY_CONFIRMED",
    "evidenceFor": [
      "The specific number 16 was emphasized in both the bell ringing and could correspond to a grove number",
      "The Straw Hats needed a specific meeting location at Sabaody",
      "Oda often includes multiple layers of meaning in important moments"
    ],
    "evidenceAgainst": [
      "The 3D2Y tattoo message was more explicit about timing rather than location",
      "The 16 bells more clearly represent the traditional 8+8 New Year ceremony doubled",
      "The original plan was already to meet at Sabaody, so location didn't need encoding"
    ],
    "popularity": "MODERATE",
    "tags": ["location-theory", "symbolism", "coded-message"]
  },
  {
    "id": "theory-ep511-002",
    "title": "Rayleigh Orchestrated the Entire Plan",
    "theoryText": "Fans immediately recognized that the elaborate coded message was too strategic for Luffy's usual straightforward personality. The theory proposed that Rayleigh masterminded the entire Marineford return, the bell ringing ceremony, and the tattoo display to accomplish multiple goals: allow Luffy to mourn, send a message only the Straw Hats would understand, and make a public statement about the changing era.",
    "author": "One Piece Fan Community",
    "source": "Episode 511 discussions and Never Watched One Piece blog",
    "dateProposed": "2011-08-21",
    "episodesSpanned": [511, 512, 517],
    "spoilerStatus": {
      "containsSpoilers": false,
      "maxEpisodeSpoiler": 512,
      "spoilerLevel": "MINOR"
    },
    "theoryStatus": "CONFIRMED",
    "evidenceFor": [
      "Zoro explicitly states 'Luffy doesn't do sneaky, clever stuff like that! This must be Rayleigh's plan'",
      "Rayleigh is shown accompanying Luffy and would have the wisdom to create such a multi-layered message",
      "The plan serves strategic purposes beyond Luffy's typical thinking",
      "Later episodes confirm Rayleigh's role in planning Luffy's training"
    ],
    "evidenceAgainst": [],
    "popularity": "VERY_HIGH",
    "tags": ["rayleigh", "strategy", "confirmed-theory"]
  },
  {
    "id": "theory-ep511-003",
    "title": "The Message Has Different Meanings for Different Audiences",
    "theoryText": "A sophisticated theory that Rayleigh designed the message to be interpreted differently depending on the viewer's perspective: the Marines see a declaration of war, pirates see the dawn of a new era led by Luffy, and only the Straw Hats understand the true meaning about the training period. This multi-layered communication demonstrates masterful strategy.",
    "author": "Never Watched One Piece blog and fan discussions",
    "source": "Tumblr blog post and forum discussions",
    "dateProposed": "2011-08-21",
    "episodesSpanned": [511, 512],
    "spoilerStatus": {
      "containsSpoilers": false,
      "maxEpisodeSpoiler": 512,
      "spoilerLevel": "MINOR"
    },
    "theoryStatus": "CONFIRMED",
    "evidenceFor": [
      "Marines interpret it as a declaration of war and threat",
      "Pirates like Killer interpret it as 'end of one era, beginning of another'",
      "The Straw Hats each immediately understand the 3D2Y meaning",
      "Brannew calls it a 'declaration' while the crew sees it as a reunion plan",
      "The plan successfully accomplished all three communication goals"
    ],
    "evidenceAgainst": [],
    "popularity": "VERY_HIGH",
    "tags": ["multi-layered-message", "strategy", "communication", "confirmed-theory"]
  },
  {
    "id": "theory-ep511-004",
    "title": "The Timing References Manga Publication",
    "theoryText": "Some meta-theory discussions suggested that Oda chose the 2-year timeskip partly because it would allow real-world time to pass and the manga to reach significant milestones. Fans theorized the timeskip would refresh the series and allow Oda to introduce new world-building elements without rushing.",
    "author": "One Piece Community Meta-Analysis",
    "source": "Various 2010-2011 forum discussions",
    "dateProposed": "2010-08-02",
    "episodesSpanned": [511, 517, 518, 519],
    "spoilerStatus": {
      "containsSpoilers": false,
      "maxEpisodeSpoiler": 520,
      "spoilerLevel": "MINOR"
    },
    "theoryStatus": "SPECULATION",
    "evidenceFor": [
      "The timeskip allowed Oda to revitalize the series at a natural breaking point",
      "Reader engagement remained high during the training arc glimpses",
      "The two-year gap allowed for major world changes without detailed coverage"
    ],
    "evidenceAgainst": [
      "Oda has stated timeskips are primarily story-driven decisions",
      "The narrative need for power-ups to face the New World was the primary driver"
    ],
    "popularity": "LOW",
    "tags": ["meta-theory", "publication", "speculation"]
  }
]
