[
  {
    "id": "marineford",
    "name": {
      "english": "Marineford",
      "japanese": "マリンフォード",
      "romanized": "Marinfōdo"
    },
    "episodeAppearances": [511],
    "keyEvents": [
      {
        "episodeNumber": 511,
        "eventId": "ep511-event-002",
        "title": "Luffy's Return to Marineford",
        "description": "Luffy returns to Marineford with Rayleigh and Jinbe, circling the destroyed fortress in a stolen Marine ship before entering the plaza.",
        "significance": "Marks Luffy's return to the traumatic site of the Marineford War for a symbolic ceremony and coded message.",
        "timestamp": "04:15"
      },
      {
        "episodeNumber": 511,
        "eventId": "ep511-event-003",
        "title": "The Ox Bell Ceremony",
        "description": "Luffy rings the Ox Bell sixteen times in the Marineford plaza, performing a symbolic ceremony that resonates throughout the world.",
        "significance": "The iconic moment where Luffy declares a new era while secretly communicating with his crew. The Ox Bell becomes a symbol of transition.",
        "timestamp": "06:45"
      },
      {
        "episodeNumber": 511,
        "eventId": "ep511-event-004",
        "title": "Paying Respects to the Fallen",
        "description": "Luffy drops flowers into the largest battle crater at Marineford, paying respects to Ace, Whitebeard, and all who died in the war.",
        "significance": "A poignant moment of remembrance that shows Luffy's emotional growth and closure regarding the traumatic events.",
        "timestamp": "08:20"
      }
    ],
    "description": "The headquarters of the Marines in the first half of the series, Marineford was the site of the massive Summit War. By this episode, it is largely destroyed and being rebuilt. The Ox Bell, a sacred ceremonial bell, remains a significant landmark in the central plaza."
  },
  {
    "id": "marine-headquarters",
    "name": {
      "english": "Marine Headquarters",
      "japanese": "海軍本部",
      "romanized": "Kaigun Honbu"
    },
    "episodeAppearances": [511],
    "keyEvents": [
      {
        "episodeNumber": 511,
        "eventId": "ep511-event-001",
        "title": "Post-War Intelligence Briefing",
        "description": "Lieutenant Commander Brannew conducts a briefing about Luffy's survival and the aftermath of the war to a room full of Marine vice-admirals.",
        "significance": "Establishes the Marine perspective on recent events and their monitoring of Luffy's actions.",
        "timestamp": "02:30"
      },
      {
        "episodeNumber": 511,
        "eventId": "ep511-event-006",
        "title": "Sengoku's Retirement Announcement",
        "description": "Sengoku officially steps down as Fleet Admiral and nominates Aokiji as his successor at Marine Headquarters.",
        "significance": "Marks a major transition in Marine leadership structure following the war.",
        "timestamp": "13:30"
      }
    ],
    "description": "The main administrative center of the Marine organization, where strategic decisions and briefings occur."
  },
  {
    "id": "foodvalten",
    "name": {
      "english": "Foodvalten",
      "japanese": "フードヴァルテン",
      "romanized": "Fūdovaruten"
    },
    "debutEpisode": 511,
    "episodeAppearances": [511],
    "keyEvents": [
      {
        "episodeNumber": 511,
        "eventId": "ep511-event-011",
        "title": "Brownbeard's Territorial Claim",
        "description": "Brownbeard confronts Basil Hawkins on Foodvalten, claiming the island as his territory and demanding Hawkins leave.",
        "significance": "Introduces Foodvalten as a contested territory in the New World and establishes Brownbeard's presence.",
        "timestamp": "21:30"
      },
      {
        "episodeNumber": 511,
        "eventId": "ep511-event-012",
        "title": "Hawkins vs Brownbeard",
        "description": "Basil Hawkins uses his Devil Fruit power to confront Brownbeard after predicting his death with tarot cards.",
        "significance": "Demonstrates the violent territorial disputes occurring in the New World as new pirates challenge established ones.",
        "timestamp": "22:00"
      }
    ],
    "description": "An island in the New World that becomes a battleground between Brownbeard and Basil Hawkins as they compete for territory.",
    "locationType": "ISLAND"
  },
  {
    "id": "raijin-island",
    "name": {
      "english": "Raijin Island",
      "japanese": "雷神島",
      "romanized": "Raijin-tō"
    },
    "debutEpisode": 511,
    "episodeAppearances": [511],
    "keyEvents": [
      {
        "episodeNumber": 511,
        "eventId": "ep511-event-013",
        "title": "Urouge's Arrival Attempt",
        "description": "Urouge and his crew attempt to land on Raijin Island, which is constantly struck by massive lightning bolts. A mysterious old woman in a boat offers to sell them umbrellas.",
        "significance": "Showcases one of the extreme environmental hazards of the New World and hints at inhabitants who have adapted to these deadly conditions.",
        "timestamp": "23:10"
      }
    ],
    "description": "A dangerous island in the New World characterized by constant, devastating lightning strikes. The island's name means 'Thunder God Island' in Japanese, reflecting its deadly weather phenomenon.",
    "locationType": "ISLAND",
    "environmentalHazards": [
      {
        "hazard": "Constant Lightning Strikes",
        "description": "The island is perpetually bombarded by massive lightning bolts, making it extremely dangerous for ships and people attempting to land.",
        "severity": "EXTREME"
      }
    ]
  },
  {
    "id": "new-world",
    "name": {
      "english": "New World",
      "japanese": "新世界",
      "romanized": "Shin Sekai"
    },
    "episodeAppearances": [511],
    "keyEvents": [
      {
        "episodeNumber": 511,
        "eventId": "ep511-event-009",
        "title": "Kid Pirates Navigate the New World",
        "description": "Eustass Kid and his crew are shown sailing through the New World, commenting on how the first half of the Grand Line seems like paradise in comparison.",
        "significance": "Emphasizes the extreme danger escalation in the second half of the Grand Line.",
        "timestamp": "18:50"
      },
      {
        "episodeNumber": 511,
        "eventId": "ep511-event-010",
        "title": "Capone Bege's Sea Monster Encounter",
        "description": "Capone Bege's ship is lifted into the air by a massive sea creature in the New World.",
        "significance": "Demonstrates the unpredictable and dangerous creatures that inhabit these waters.",
        "timestamp": "20:15"
      }
    ],
    "description": "The second half of the Grand Line, known for its extreme dangers, unpredictable weather, and powerful pirates. Multiple Supernova crews are shown struggling with its harsh conditions in this episode.",
    "locationType": "REGION"
  }
]
